config/doom/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2023-07-16 Sun 17:30 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Emacs Configuration</title>
    <meta name="author" content="leniviy" />
    <meta name="generator" content="Org Mode" />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"
    />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"
    />
  </head>
  <body>
    <div id="content" class="content">
      <h1 class="title">Emacs Configuration</h1>
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#org67482a1">1. Config</a>
              <ul>
                <li><a href="#org4e708db">1.1. Personal information</a></li>
                <li>
                  <a href="#org6dd6034">1.2. Better defaults</a>
                  <ul>
                    <li><a href="#org4e246cd">1.2.1. Simple settings</a></li>
                    <li><a href="#org37bf738">1.2.2. Frame sizing</a></li>
                    <li>
                      <a href="#orgb1ad7e4">1.2.3. Auto-customisations</a>
                    </li>
                    <li><a href="#orgb4f6044">1.2.4. Windows</a></li>
                  </ul>
                </li>
                <li>
                  <a href="#orgb1eb86a">1.3. Doom configuration</a>
                  <ul>
                    <li>
                      <a href="#org33b9223">1.3.1. Modules</a>
                      <ul>
                        <li><a href="#org3d777e9">1.3.1.1. Structure</a></li>
                        <li><a href="#org7c2c3a1">1.3.1.2. Interface</a></li>
                        <li>
                          <a href="#orga0e4e6b">1.3.1.3. Language support</a>
                        </li>
                        <li>
                          <a href="#orgfe1e063">1.3.1.4. Everything in Emacs</a>
                        </li>
                      </ul>
                    </li>
                    <li>
                      <a href="#org609c739">1.3.2. Visual settings</a>
                      <ul>
                        <li><a href="#org3b71662">1.3.2.1. Font Face</a></li>
                        <li>
                          <a href="#orge2d015e">1.3.2.2. Theme and modeline</a>
                        </li>
                        <li>
                          <a href="#org91805eb">1.3.2.3. Miscellaneous</a>
                        </li>
                        <li><a href="#orgc66c08b">1.3.2.4. Ligatures</a></li>
                        <li><a href="#orga0e0d9b">1.3.2.5. Scrolling</a></li>
                        <li>
                          <a href="#org2fae20f"
                            >1.3.2.6. Prettier page breaks</a
                          >
                        </li>
                      </ul>
                    </li>
                    <li>
                      <a href="#org4f9b492"
                        >1.3.3. Allow babel execution in CLI actions</a
                      >
                    </li>
                  </ul>
                </li>
                <li><a href="#org99e5d54">1.4. Performance</a></li>
                <li>
                  <a href="#org8919c85">1.5. Other Things</a>
                  <ul>
                    <li>
                      <a href="#org088c595">1.5.1. Editor interaction</a>
                      <ul>
                        <li>
                          <a href="#org003a069">1.5.1.1. Mouse buttons</a>
                        </li>
                      </ul>
                    </li>
                    <li><a href="#org7fc617b">1.5.2. Splash screen</a></li>
                    <li>
                      <a href="#org139369a">1.5.3. Daemon</a>
                      <ul>
                        <li><a href="#org4104ee6">1.5.3.1. Dashboard</a></li>
                      </ul>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>
            <li>
              <a href="#org116981c">2. Package loading</a>
              <ul>
                <li>
                  <a href="#orgf823c52">2.1. General packages</a>
                  <ul>
                    <li><a href="#orgebadd40">2.1.1. Fun</a></li>
                    <li>
                      <a href="#orgc4c419d">2.1.2. Features</a>
                      <ul>
                        <li><a href="#org65c2b71">2.1.2.1. CalcTeX</a></li>
                        <li><a href="#orgd1a1fab">2.1.2.2. Info colors</a></li>
                        <li>
                          <a href="#orgbb3eb80"
                            >2.1.2.3. Calibre and ebook reading</a
                          >
                        </li>
                        <li><a href="#org06f5371">2.1.2.4. Screenshots</a></li>
                        <li>
                          <a href="#orgede6dc9">2.1.2.5. Theme schedule</a>
                        </li>
                        <li>
                          <a href="#orgc714a0b"
                            >2.1.2.6. Non-default keyboard layouts support</a
                          >
                        </li>
                        <li><a href="#orgd87c73b">2.1.2.7. Kdeconnect</a></li>
                        <li><a href="#org73d2b5d">2.1.2.8. Imenu</a></li>
                        <li><a href="#orgda41a4c">2.1.2.9. Deadgrep</a></li>
                        <li>
                          <a href="#orgf99a976">2.1.2.10. Company</a>
                          <ul>
                            <li>
                              <a href="#orgda75a4d">2.1.2.10.1. Prescient</a>
                            </li>
                            <li><a href="#org6131ecf">2.1.2.10.2. Fuzzy</a></li>
                            <li><a href="#orgf6b9c3f">2.1.2.10.3. Math</a></li>
                          </ul>
                        </li>
                        <li>
                          <a href="#org2be4301">2.1.2.11. Top in emacs</a>
                        </li>
                        <li>
                          <a href="#orgce1550a">2.1.2.12. Google-translate</a>
                        </li>
                        <li><a href="#org4727326">2.1.2.13. Timesheet</a></li>
                        <li><a href="#org3c8d5e4">2.1.2.14. Wakatime</a></li>
                        <li><a href="#orgc1d4913">2.1.2.15. iscroll</a></li>
                      </ul>
                    </li>
                  </ul>
                </li>
                <li>
                  <a href="#org67392f0">2.2. Language packages</a>
                  <ul>
                    <li><a href="#org4acc851">2.2.1. LaTeX</a></li>
                    <li>
                      <a href="#orgaa2aa55">2.2.2. Org Mode</a>
                      <ul>
                        <li>
                          <a href="#org18b2205"
                            >2.2.2.1. Improve agenda/capture</a
                          >
                        </li>
                        <li><a href="#org043de87">2.2.2.2. Visuals</a></li>
                        <li>
                          <a href="#orgf13ec19">2.2.2.3. Extra functionality</a>
                        </li>
                      </ul>
                    </li>
                    <li><a href="#org806cd22">2.2.3. Systemd</a></li>
                    <li><a href="#orgf7bc9f8">2.2.4. Graphviz</a></li>
                    <li><a href="#org7067be3">2.2.5. Authinfo</a></li>
                  </ul>
                </li>
              </ul>
            </li>
            <li>
              <a href="#org01eab99">3. Package configuration</a>
              <ul>
                <li><a href="#org5a94f54">3.1. Abbrev mode</a></li>
                <li><a href="#org409f122">3.2. Avy</a></li>
                <li><a href="#orga4a772b">3.3. Calc</a></li>
                <li>
                  <a href="#org7eaf276">3.4. Circadian (Theme schedule)</a>
                </li>
                <li>
                  <a href="#orgca65bb4">3.5. Company</a>
                  <ul>
                    <li><a href="#org87cedb7">3.5.1. ESS</a></li>
                  </ul>
                </li>
                <li><a href="#orgfc2bdc1">3.6. Deadgrep</a></li>
                <li><a href="#org42dfe0f">3.7. Direnv</a></li>
                <li><a href="#org3011cc4">3.8. Doom modeline</a></li>
                <li><a href="#org8096c4e">3.9. Emacs-everywhere</a></li>
                <li><a href="#org6fd1971">3.10. Eros-eval</a></li>
                <li><a href="#orgf68f359">3.11. EVIL</a></li>
                <li><a href="#org8275cfa">3.12. Gif-screencast</a></li>
                <li><a href="#org9d24fff">3.13. Google-translate</a></li>
                <li><a href="#org0efe1ee">3.14. Imenu</a></li>
                <li><a href="#orgbcd3aab">3.15. Info colours</a></li>
                <li><a href="#orgd02df21">3.16. Leetcode</a></li>
                <li><a href="#org78b408d">3.17. Kdeconnect</a></li>
                <li><a href="#org9a46a40">3.18. Keycast</a></li>
                <li><a href="#orgdb00831">3.19. Org Chef</a></li>
                <li>
                  <a href="#orgdbbe0c8">3.20. Reverse-im (Keyboard layouts)</a>
                </li>
                <li><a href="#org392c103">3.21. Which-key</a></li>
                <li><a href="#orgb59d72e">3.22. Writeroom</a></li>
                <li><a href="#orga989f01">3.23. Wakatime</a></li>
                <li><a href="#org3c7ee8e">3.24. YASnippet</a></li>
                <li><a href="#orgaa7e9fe">3.25. Fountain</a></li>
                <li><a href="#orga74b3bd">3.26. Open-With</a></li>
                <li><a href="#org29fd4c8">3.27. Spray</a></li>
                <li><a href="#orgea17a76">3.28. iscroll</a></li>
                <li><a href="#org5bb02aa">3.29. Git blame</a></li>
                <li>
                  <a href="#org0598239">3.30. Hydra</a>
                  <ul>
                    <li><a href="#org8e9f10c">3.30.1. Hydra Posframe</a></li>
                  </ul>
                </li>
                <li><a href="#org64d38a7">3.31. Terminal Here</a></li>
                <li><a href="#org065d423">3.32. Spell-fu</a></li>
              </ul>
            </li>
            <li>
              <a href="#org9a92f8b">4. Applications</a>
              <ul>
                <li><a href="#org41fc923">4.1. Ebooks</a></li>
                <li>
                  <a href="#orgf8870a4">4.2. File types</a>
                  <ul>
                    <li><a href="#orgf9df63d">4.2.1. Systemd</a></li>
                  </ul>
                </li>
                <li><a href="#org7fd4f72">4.3. Obsidian</a></li>
              </ul>
            </li>
            <li>
              <a href="#org595fa3e">5. Language configuration</a>
              <ul>
                <li><a href="#orgd58f8ac">5.1. Haskell</a></li>
                <li><a href="#org6750ad6">5.2. Rust</a></li>
                <li><a href="#org85d6c2a">5.3. Js</a></li>
                <li><a href="#org44a35fb">5.4. LaTeX</a></li>
                <li><a href="#orgf749833">5.5. Markdown</a></li>
                <li><a href="#orge85eeb8">5.6. Nix</a></li>
                <li>
                  <a href="#org">5.7. Org</a>
                  <ul>
                    <li>
                      <a href="#org89b8cba">5.7.1. Behavior</a>
                      <ul>
                        <li>
                          <a href="#orga6fc366">5.7.1.1. Tweaking defaults</a>
                        </li>
                        <li>
                          <a href="#org14cbf23">5.7.1.2. Latex snippets</a>
                        </li>
                        <li>
                          <a href="#org1987fff">5.7.1.3. Extra functionality</a>
                          <ul>
                            <li>
                              <a href="#org10a4c54"
                                >5.7.1.3.1. Org buffer creation</a
                              >
                            </li>
                            <li>
                              <a href="#org094600f"
                                >5.7.1.3.2. The utility of zero-width spaces</a
                              >
                            </li>
                            <li>
                              <a href="#orgc278a83"
                                >5.7.1.3.3. List bullet sequence</a
                              >
                            </li>
                            <li>
                              <a href="#orgdd84e9d">5.7.1.3.4. cdlatex</a>
                            </li>
                            <li>
                              <a href="#org6026632"
                                >5.7.1.3.5. View exported file</a
                              >
                            </li>
                            <li>
                              <a href="#org1ef68ca">5.7.1.3.6. Citation</a>
                            </li>
                          </ul>
                        </li>
                        <li><a href="#orgabe94a7">5.7.1.4. Super agenda</a></li>
                        <li>
                          <a href="#org604eefd">5.7.1.5. Snippet Helpers</a>
                        </li>
                        <li>
                          <a href="#org344bb28"
                            >5.7.1.6. Translate capital keywords (old) to lower
                            case (new)</a
                          >
                        </li>
                        <li>
                          <a href="#org5c0e9d2"
                            >5.7.1.7. Fix problematic hooks</a
                          >
                        </li>
                        <li>
                          <a href="#orgbe5b5a4">5.7.1.8. Mermaid diagrams</a>
                        </li>
                        <li><a href="#orgd123597">5.7.1.9. Org-roam</a></li>
                        <li>
                          <a href="#org5364cb5">5.7.1.10. Org-transclusion</a>
                        </li>
                      </ul>
                    </li>
                    <li>
                      <a href="#org6a9762f">5.7.2. Visuals</a>
                      <ul>
                        <li><a href="#org97b32db">5.7.2.1. Org Modern</a></li>
                        <li>
                          <a href="#org4001f82">5.7.2.2. Emphasis markers</a>
                        </li>
                        <li><a href="#org07c074c">5.7.2.3. Font Display</a></li>
                        <li>
                          <a href="#orgde97588">5.7.2.4. Reduced text indent</a>
                        </li>
                        <li>
                          <a href="#orgf662579"
                            >5.7.2.5. Fontifying inline src blocks</a
                          >
                        </li>
                        <li><a href="#org6004c2b">5.7.2.6. Symbols</a></li>
                        <li>
                          <a href="#orgd5bdaa5">5.7.2.7. LaTeX Fragments</a>
                          <ul>
                            <li>
                              <a href="#org5efe4fb"
                                >5.7.2.7.1. Prettier highlighting</a
                              >
                            </li>
                            <li>
                              <a href="#org3a00c44"
                                >5.7.2.7.2. More eager rendering</a
                              >
                            </li>
                            <li>
                              <a href="#org38e47cb"
                                >5.7.2.7.3. Prettier rendering</a
                              >
                            </li>
                            <li>
                              <a href="#org1aa67b3"
                                >5.7.2.7.4. Fixes for lualatex</a
                              >
                            </li>
                          </ul>
                        </li>
                      </ul>
                    </li>
                    <li>
                      <a href="#orga10a1b2">5.7.3. Exporting</a>
                      <ul>
                        <li>
                          <a href="#org720d7d2">5.7.3.1. Exporting Org code</a>
                        </li>
                        <li>
                          <a href="#orgff2f5f4">5.7.3.2. General settings</a>
                        </li>
                      </ul>
                    </li>
                    <li>
                      <a href="#orga71dd14">5.7.4. LaTeX Export</a>
                      <ul>
                        <li><a href="#org125401e">5.7.4.1. Compiling</a></li>
                        <li>
                          <a href="#org3a6e8da">5.7.4.2. Class templates</a>
                        </li>
                        <li>
                          <a href="#org4731cb0"
                            >5.7.4.3. Extra special strings</a
                          >
                        </li>
                        <li>
                          <a href="#org234d24a"
                            >5.7.4.4. Make verbatim different to code</a
                          >
                        </li>
                        <li>
                          <a href="#orgca1baec"
                            >5.7.4.5. Support images from URLs</a
                          >
                        </li>
                        <li>
                          <a href="#orga6f39c7">5.7.4.6. Pretty code blocks</a>
                        </li>
                      </ul>
                    </li>
                    <li><a href="#orge407a3a">5.7.5. Beamer Export</a></li>
                    <li><a href="#org927af9b">5.7.6. ASCII export</a></li>
                    <li><a href="#org62987a8">5.7.7. Reveal export</a></li>
                  </ul>
                </li>
                <li>
                  <a href="#org7bc8b15">5.8. Plaintext</a>
                  <ul>
                    <li><a href="#org83b97b8">5.8.1. Ansi colours</a></li>
                  </ul>
                </li>
                <li><a href="#org3fceeae">5.9. Python</a></li>
                <li><a href="#org5464b82">5.10. Rust</a></li>
                <li><a href="#org5155ff9">5.11. CSharp</a></li>
                <li><a href="#orgee917a7">5.12. HTML</a></li>
              </ul>
            </li>
            <li>
              <a href="#orgf82e89a">6. Functions</a>
              <ul>
                <li><a href="#org5091255">6.1. Org</a></li>
                <li><a href="#org715a587">6.2. Files</a></li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
      <blockquote>
        <p>
          Let us change our traditional attitude to the construction of
          programs: Instead of imagining that our main task is to instruct a
          computer what to do, let us concentrate rather on explaining to human
          beings what we want a computer to do. &#x2014; Donald Knuth
        </p>
      </blockquote>
