config/doom/config.html

      <div id="outline-container-org67482a1" class="outline-2">
        <h2 id="org67482a1"><span class="section-number-2">1.</span> Config</h2>
        <div class="outline-text-2" id="text-1">
          <p>
            Make this file run (slightly) faster with lexical binding (see
            <a href="https://nullprogram.com/blog/2016/12/22/"
              >this blog post</a
            >
            for more info).
          </p>
          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #5a5b5a;">;;; </span><span style="color: #5a5b5a;">config.el -*- lexical-binding: t; -*-</span>
</pre>
          </div>
        </div>
        <div id="outline-container-org4e708db" class="outline-3">
          <h3 id="org4e708db">
            <span class="section-number-3">1.1.</span> Personal information
          </h3>
          <div class="outline-text-3" id="text-1-1">
            <p>Basic personal information</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">user-full-name</span> <span style="color: #b5bd68;">"Danylo Osipchuk"</span>
      <span style="color: #cc6666;">user-mail-address</span> <span style="color: #b5bd68;">"xocada@gmail.com"</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org6dd6034" class="outline-3">
          <h3 id="org6dd6034">
            <span class="section-number-3">1.2.</span> Better defaults
          </h3>
          <div class="outline-text-3" id="text-1-2"></div>
          <div id="outline-container-org4e246cd" class="outline-4">
            <h4 id="org4e246cd">
              <span class="section-number-4">1.2.1.</span> Simple settings
            </h4>
            <div class="outline-text-4" id="text-1-2-1">
              <p>Some better defaults from internet</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-default</span>
 <span style="color: #cc6666;">delete-by-moving-to-trash</span> t                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Delete files to trash</span>
 <span style="color: #cc6666;">window-combination-resize</span> t                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">take new window space from all other windows (not just current)</span>
 <span style="color: #cc6666;">x-stretch-cursor</span> t<span style="color: #b294bb;">)</span>                              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Stretch cursor to the glyph width</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">undo-limit</span> <span style="color: #de935f; font-weight: bold;">80000000</span>                         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Raise undo-limit to 80Mb</span>
      <span style="color: #cc6666;">evil-want-fine-undo</span> t                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">By default while in insert all changes are one big blob. Be more granular</span>
      <span style="color: #cc6666;">auto-save-default</span> t                         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Nobody likes to loose work, I certainly don't</span>
      <span style="color: #cc6666;">truncate-string-ellipsis</span> <span style="color: #b5bd68;">"&#8230;"</span><span style="color: #b294bb;">)</span>               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Unicode ellispis are nicer than "...", and also save /precious/ space</span>

<span style="color: #b294bb;">(</span><span style="color: #cc6666;">global-subword-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span>                           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Iterate through CamelCase words</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org37bf738" class="outline-4">
            <h4 id="org37bf738">
              <span class="section-number-4">1.2.2.</span> Frame sizing
            </h4>
            <div class="outline-text-4" id="text-1-2-2">
              <p>
                It&rsquo;s nice to control the size of new frames, when
                launching Emacs that can be done with
                <code>emacs -geometry 160x48</code>. After the font size
                adjustment during initialisation this works out to be
                <code>102x31</code>.
              </p>

              <p>
                Thanks to hotkeys, it&rsquo;s easy for me to expand a frame to
                half/full-screen, so it makes sense to be conservative with the
                sizing of new frames.
              </p>

              <p>
                Then, for creating new frames within the same Emacs instance,
                we&rsquo;ll just set the default to be something roughly 80% of
                that size.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">default-frame-alist</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>height . <span style="color: #de935f; font-weight: bold;">24</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">default-frame-alist</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>width . <span style="color: #de935f; font-weight: bold;">80</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-orgb1ad7e4" class="outline-4">
            <h4 id="orgb1ad7e4">
              <span class="section-number-4">1.2.3.</span> Auto-customisations
            </h4>
            <div class="outline-text-4" id="text-1-2-3">
              <p>
                By default changes made via a customisation interface are added
                to <code>init.el</code>. I prefer the idea of using a separate
                file for this. We just need to change a setting, and load it if
                it exists.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-default</span> <span style="color: #cc6666;">custom-file</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">expand-file-name</span> <span style="color: #b5bd68;">".custom.el"</span> <span style="color: #cc6666;">doom-private-dir</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">file-exists-p</span> <span style="color: #cc6666;">custom-file</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">load</span> <span style="color: #cc6666;">custom-file</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-orgb4f6044" class="outline-4">
            <h4 id="orgb4f6044">
              <span class="section-number-4">1.2.4.</span> Windows
            </h4>
            <div class="outline-text-4" id="text-1-2-4">
              <p>
                I find it rather handy to be asked which buffer I want to see
                after splitting the window. Let&rsquo;s make that happen. First,
                we&rsquo;ll enter the new window
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">evil-vsplit-window-right</span> t
      <span style="color: #cc6666;">evil-split-window-below</span> t<span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>Then, we&rsquo;ll pull up a buffer prompt.</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> prompt-for-buffer <span style="color: #81a2be;">(</span><span style="color: #f0c674;">&amp;rest</span> _<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>evil-window-split evil-window-vsplit<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">consult-buffer</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                Window rotation is nice, and can be found under
                <code>SPC w r</code> and <code>SPC w R</code>.
                <i>Layout</i> rotation is also nice though. Let&rsquo;s stash
                this under <code>SPC w SPC</code>, inspired by Tmux&rsquo;s use
                of <code>C-b SPC</code> to rotate windows.
              </p>

              <p>
                We could also do with adding the missing arrow-key variants of
                the window navigation/swapping commands.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">evil-window-map</span>
      <span style="color: #b5bd68;">"SPC"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">rotate-layout</span>
      <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Navigation</span>
      <span style="color: #b5bd68;">"&lt;left&gt;"</span>     <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">evil-window-left</span>
      <span style="color: #b5bd68;">"&lt;down&gt;"</span>     <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">evil-window-down</span>
      <span style="color: #b5bd68;">"&lt;up&gt;"</span>       <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">evil-window-up</span>
      <span style="color: #b5bd68;">"&lt;right&gt;"</span>    <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">evil-window-right</span>
      <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Swapping windows</span>
      <span style="color: #b5bd68;">"C-&lt;left&gt;"</span>       <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+evil/window-move-left</span>
      <span style="color: #b5bd68;">"C-&lt;down&gt;"</span>       <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+evil/window-move-down</span>
      <span style="color: #b5bd68;">"C-&lt;up&gt;"</span>         <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+evil/window-move-up</span>
      <span style="color: #b5bd68;">"C-&lt;right&gt;"</span>      <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+evil/window-move-right</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
