config/doom/config.html

        <div id="outline-container-orgb1eb86a" class="outline-3">
          <h3 id="orgb1eb86a">
            <span class="section-number-3">1.3.</span> Doom configuration
          </h3>
          <div class="outline-text-3" id="text-1-3"></div>
          <div id="outline-container-org33b9223" class="outline-4">
            <h4 id="org33b9223">
              <span class="section-number-4">1.3.1.</span> Modules
            </h4>
            <div class="outline-text-4" id="text-1-3-1">
              <p>
                Doom has this lovely <i>modular configuration base</i> that
                takes a lot of work out of configuring Emacs. Each module (when
                enabled) can provide a list of packages to install (on
                <code>doom sync</code>) and configuration to be applied. The
                modules can also have flags applied to tweak their behaviour.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                  id="org9a5e7f0"
                ><span style="color: #5a5b5a;">;;; </span><span style="color: #5a5b5a;">init.el -*- lexical-binding: t; -*-</span>

<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">This file controls what Doom modules are enabled and what order they load in.</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Press '</span><span style="color: #de935f;">K</span><span style="color: #5a5b5a;">' on a module to view its documentation, and '</span><span style="color: #de935f;">gd</span><span style="color: #5a5b5a;">' to browse its directory.</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">doom!</span> <span style="color: #81a2be;">:completion</span>
       &lt;&lt;doom-completion&gt;&gt;

       <span style="color: #81a2be;">:ui</span>
       &lt;&lt;doom-ui&gt;&gt;

       <span style="color: #81a2be;">:editor</span>
       &lt;&lt;doom-editor&gt;&gt;

       <span style="color: #81a2be;">:emacs</span>
       &lt;&lt;doom-emacs&gt;&gt;

       <span style="color: #81a2be;">:term</span>
       &lt;&lt;doom-term&gt;&gt;

       <span style="color: #81a2be;">:checkers</span>
       &lt;&lt;doom-checkers&gt;&gt;

       <span style="color: #81a2be;">:tools</span>
       &lt;&lt;doom-tools&gt;&gt;

       <span style="color: #81a2be;">:os</span>
       &lt;&lt;doom-os&gt;&gt;

       <span style="color: #81a2be;">:lang</span>
       &lt;&lt;doom-lang&gt;&gt;

       <span style="color: #81a2be;">:email</span>
       &lt;&lt;doom-email&gt;&gt;

       <span style="color: #81a2be;">:app</span>
       &lt;&lt;doom-app&gt;&gt;

       <span style="color: #81a2be;">:config</span>
       &lt;&lt;doom-config&gt;&gt;
       <span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
            <div id="outline-container-org3d777e9" class="outline-5">
              <h5 id="org3d777e9">
                <span class="section-number-5">1.3.1.1.</span> Structure
              </h5>
              <div class="outline-text-5" id="text-1-3-1-1">
                <p>
                  As you may have noticed by this point, this is a
                  <a href="https://en.wikipedia.org/wiki/Literate_programming"
                    >literate</a
                  >
                  configuration. Doom has good support for this which we access
                  though the <code>literate</code> module.
                </p>

                <p>
                  While we&rsquo;re in the <code>:config</code> section,
                  we&rsquo;ll use Dooms nicer defaults, along with the bindings
                  and smartparens behaviour (the flags aren&rsquo;t documented,
                  but they exist).
                </p>
                <div class="org-src-container">
                  <pre class="src src-emacs-lisp" id="org0543366">literate
<span style="color: #b294bb;">(</span>default +bindings +smartparens<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
