config/doom/config.org
**** Interface
#+name: doom-completion
#+begin_src emacs-lisp
(company                     ; the ultimate code completion backend
 +childframe)                ; ... when your children are better than you
;;helm                       ; the *other* search engine for love and life
;;ido                        ; the other *other* search engine...
;; (ivy                         ; a search engine for love and life
;;  +icons                      ; ... icons are nice
;;  +childframe                 ; ... when your children are better than you
;;  +prescient)                 ; ... I know what I want(ed)
(vertico +icons
         ;; +childframe
         )
#+end_src


#+name: doom-ui
#+begin_src emacs-lisp
;;deft                       ; notational velocity for Emacs
doom                         ; what makes DOOM look the way it does
doom-dashboard               ; a nifty splash screen for Emacs
doom-quit                    ; DOOM quit-message prompts when you quit Emacs
(emoji                       ; 🙂
 +unicode
 +github)
;;fill-column                ; a `fill-column' indicator
hl-todo                      ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
hydra                      ; quick documentation for related commands
indent-guides              ; highlighted indent columns, notoriously slow
(ligatures
 +pragmata-pro
 +iosevka
 +extra
)           ; ligatures and symbols to make your code pretty again
minimap                    ; show a map of the code on the side
modeline                     ; snazzy, Atom-inspired modeline, plus API
nav-flash                    ; blink the current line after jumping
;;neotree                    ; a project drawer, like NERDTree for vim
ophints                      ; highlight the region an operation acts on
(popup                       ; tame sudden yet inevitable temporary windows
 +all                        ; catch all popups that start with an asterix
 +defaults)                  ; default popup rules
;;(tabs                      ; an tab bar for Emacs
;;  +centaur-tabs)           ; ... with prettier tabs
(treemacs                     ; a project drawer, like neotree but cooler
 +lsp)
unicode                    ; extended unicode support for various languages
(vc-gutter                    ; vcs diff in the fringe
 +pretty
 +diff-hl
 )
vi-tilde-fringe              ; fringe tildes to mark beyond EOB
window-select                ; visually switch windows
workspaces                   ; tab emulation, persistence & separate workspaces
zen                          ; distraction-free coding or writing
#+end_src

#+name: doom-editor
#+begin_src emacs-lisp
(evil +everywhere)           ; come to the dark side, we have cookies
file-templates               ; auto-snippets for empty files
fold                         ; (nigh) universal code folding
format             ; automated prettiness
;;god                        ; run Emacs commands without modifier keys
;;lispy                      ; vim for lisp, for people who don't like vim
multiple-cursors             ; editing in many places at once
;;objed                      ; text object editing for the innocent
;;parinfer                   ; turn lisp into python, sort of
rotate-text                  ; cycle region at point between text candidates
snippets                     ; my elves. They type so I don't have to
;;word-wrap                  ; soft wrapping with language-aware indent
#+end_src

#+name: doom-emacs
#+begin_src emacs-lisp
(dired
 +icons
 ;; +ranger
 +dirvish
 )               ; making dired pretty [functional]
electric                     ; smarter, keyword-based electric-indent
(ibuffer +icons)             ; interactive buffer management
(undo +tree)                 ; persistent, smarter undo for your inevitable mistakes
vc                           ; version-control and Emacs, sitting in a tree
#+end_src


#+name: doom-term
#+begin_src emacs-lisp
eshell            ; a consistent, cross-platform shell (WIP)
;; shell             ; a terminal REPL for Emacs
;; term              ; terminals in Emacs
vterm             ; another terminals in Emacs
#+end_src

#+name: doom-checkers
#+begin_src emacs-lisp
(syntax                       ; tasing you for every semicolon you forget
 +flymake
 +childframe)
(spell +aspell)                        ; tasing you for misspelling mispelling
grammar                      ; tasing grammar mistake every you make
#+end_src

#+name: doom-tools
#+begin_src emacs-lisp
;; ansible                      ; a crucible for infrastructure as code
biblio
;; (
debugger                     ; FIXME stepping through code, to help you add bugs
;;+lsp)
direnv                     ; be direct about your environment
docker                     ; port everything to containers
editorconfig               ; let someone else argue about tabs vs spaces
;;ein                        ; tame Jupyter notebooks with emacs
(eval +overlay)              ; run code, run (also, repls)
gist                       ; interacting with github gists
(lookup                      ; helps you navigate your code and documentation
 +dictionary                 ; dictionary/thesaurus is nice
 +docsets)                   ; ...or in Dash docsets locally
(lsp +peek)                          ; Language Server Protocol
(magit                       ; a git porcelain for Emacs
 ;; +forge
 )                     ; interface with git forges
make                         ; run make tasks from Emacs
pass                       ; password manager for nerds
pdf                          ; pdf enhancements
;;prodigy                    ; FIXME managing external services & code builders
rgb                          ; creating color strings
;;taskrunner                 ; taskrunner for all your projects
;;terraform                  ; infrastructure as code
tmux                       ; an API for interacting with tmux
upload                       ; map local to remote projects via ssh/ftp
tree-sitter
#+end_src

#+name: doom-os
#+begin_src emacs-lisp
(:if IS-MAC macos)  ; improve compatibility with macOS
(tty +osc)                          ; improve the terminal Emacs experience
#+end_src
