config/doom/config.html
            <div id="outline-container-org7c2c3a1" class="outline-5">
              <h5 id="org7c2c3a1">
                <span class="section-number-5">1.3.1.2.</span> Interface
              </h5>
              <div class="outline-text-5" id="text-1-3-1-2">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org5720ae4"
                  ><span style="color: #b294bb;">(</span>company                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">the ultimate code completion backend</span>
 +childframe<span style="color: #b294bb;">)</span>                <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">... when your children are better than you</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">helm                       ; the *other* search engine for love and life</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ido                        ; the other *other* search engine...</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(ivy                         ; a search engine for love and life</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">+icons                      ; ... icons are nice</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">+childframe                 ; ... when your children are better than you</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">+prescient)                 ; ... I know what I want(ed)</span>
<span style="color: #b294bb;">(</span>vertico +icons
         <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">+childframe</span>
         <span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="orge731e2e"
                  ><span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">deft                       ; notational velocity for Emacs</span>
doom                         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">what makes DOOM look the way it does</span>
doom-dashboard               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a nifty splash screen for Emacs</span>
doom-quit                    <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">DOOM quit-message prompts when you quit Emacs</span>
<span style="color: #b294bb;">(</span>emoji                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">&#128578;</span>
 +unicode
 +github<span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">fill-column                ; a `</span><span style="color: #de935f;">fill-column</span><span style="color: #5a5b5a;">' indicator</span>
hl-todo                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">highlight </span><span style="color: #f0c674; font-weight: bold;">TODO</span><span style="color: #5a5b5a;">/</span><span style="color: #cc6666; font-weight: bold;">FIXME</span><span style="color: #5a5b5a;">/</span><span style="color: #b5bd68; font-weight: bold;">NOTE</span><span style="color: #5a5b5a;">/</span><span style="color: #717171; font-weight: bold;">DEPRECATED</span><span style="color: #5a5b5a;">/</span><span style="color: #de935f; font-weight: bold;">HACK</span><span style="color: #5a5b5a;">/</span><span style="color: #b294bb; font-weight: bold;">REVIEW</span>
hydra                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">quick documentation for related commands</span>
indent-guides              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">highlighted indent columns, notoriously slow</span>
<span style="color: #b294bb;">(</span>ligatures
 +pragmata-pro
 +iosevka
 +extra
<span style="color: #b294bb;">)</span>           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">ligatures and symbols to make your code pretty again</span>
minimap                    <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">show a map of the code on the side</span>
modeline                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">snazzy, Atom-inspired modeline, plus API</span>
nav-flash                    <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">blink the current line after jumping</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">neotree                    ; a project drawer, like NERDTree for vim</span>
ophints                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">highlight the region an operation acts on</span>
<span style="color: #b294bb;">(</span>popup                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">tame sudden yet inevitable temporary windows</span>
 +all                        <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">catch all popups that start with an asterix</span>
 +defaults<span style="color: #b294bb;">)</span>                  <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">default popup rules</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">(tabs                      ; an tab bar for Emacs</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">+centaur-tabs)           ; ... with prettier tabs</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">treemacs</span>                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a project drawer, like neotree but cooler</span>
 +lsp<span style="color: #b294bb;">)</span>
unicode                    <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">extended unicode support for various languages</span>
<span style="color: #b294bb;">(</span>vc-gutter                    <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">vcs diff in the fringe</span>
 +pretty
 +diff-hl
 <span style="color: #b294bb;">)</span>
vi-tilde-fringe              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">fringe tildes to mark beyond EOB</span>
window-select                <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">visually switch windows</span>
workspaces                   <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">tab emulation, persistence &amp; separate workspaces</span>
zen                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">distraction-free coding or writing</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org6a3a144"
                  ><span style="color: #b294bb;">(</span>evil +everywhere<span style="color: #b294bb;">)</span>           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">come to the dark side, we have cookies</span>
file-templates               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">auto-snippets for empty files</span>
fold                         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">(nigh) universal code folding</span>
format             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">automated prettiness</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">god                        ; run Emacs commands without modifier keys</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">lispy                      ; vim for lisp, for people who don't like vim</span>
multiple-cursors             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">editing in many places at once</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">objed                      ; text object editing for the innocent</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">parinfer                   ; turn lisp into python, sort of</span>
rotate-text                  <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">cycle region at point between text candidates</span>
snippets                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">my elves. They type so I don't have to</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">word-wrap                  ; soft wrapping with language-aware indent</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org83c02c1"
                  ><span style="color: #b294bb;">(</span><span style="color: #de935f;">dired</span>
 +icons
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">+ranger</span>
 +dirvish
 <span style="color: #b294bb;">)</span>               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">making dired pretty [functional]</span>
electric                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">smarter, keyword-based electric-indent</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">ibuffer</span> +icons<span style="color: #b294bb;">)</span>             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">interactive buffer management</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">undo</span> +tree<span style="color: #b294bb;">)</span>                 <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">persistent, smarter undo for your inevitable mistakes</span>
vc                           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">version-control and Emacs, sitting in a tree</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="orge29a3fe"
                  >eshell            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a consistent, cross-platform shell (WIP)</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">shell             ; a terminal REPL for Emacs</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">term              ; terminals in Emacs</span>
vterm             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">another terminals in Emacs</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org6edee11"
                  ><span style="color: #b294bb;">(</span>syntax                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">tasing you for every semicolon you forget</span>
 +childframe<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span>spell +aspell<span style="color: #b294bb;">)</span>                        <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">tasing you for misspelling mispelling</span>
grammar                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">tasing grammar mistake every you make</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org2b07c85"
                  ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">ansible                      ; a crucible for infrastructure as code</span>
biblio
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(</span>
<span style="color: #cc6666;">debugger</span>                     <span style="color: #5a5b5a;">; </span><span style="color: #cc6666; font-weight: bold;">FIXME</span><span style="color: #5a5b5a;"> stepping through code, to help you add bugs</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">+lsp)</span>
direnv                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">be direct about your environment</span>
docker                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">port everything to containers</span>
editorconfig               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">let someone else argue about tabs vs spaces</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ein                        ; tame Jupyter notebooks with emacs</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">eval</span> +overlay<span style="color: #b294bb;">)</span>              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">run code, run (also, repls)</span>
gist                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">interacting with github gists</span>
<span style="color: #b294bb;">(</span>lookup                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">helps you navigate your code and documentation</span>
 +dictionary                 <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">dictionary/thesaurus is nice</span>
 +docsets<span style="color: #b294bb;">)</span>                   <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">...or in Dash docsets locally</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">lsp</span> +peek<span style="color: #b294bb;">)</span>                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Language Server Protocol</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">magit</span>                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a git porcelain for Emacs</span>
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">+forge</span>
 <span style="color: #b294bb;">)</span>                     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">interface with git forges</span>
make                         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">run make tasks from Emacs</span>
pass                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">password manager for nerds</span>
pdf                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">pdf enhancements</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">prodigy                    ; </span><span style="color: #cc6666; font-weight: bold;">FIXME</span><span style="color: #5a5b5a;"> managing external services &amp; code builders</span>
rgb                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">creating color strings</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">taskrunner                 ; taskrunner for all your projects</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">terraform                  ; infrastructure as code</span>
tmux                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">an API for interacting with tmux</span>
upload                       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">map local to remote projects via ssh/ftp</span>
tree-sitter
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org4e3182b"
                  ><span style="color: #b294bb;">(</span><span style="color: #81a2be;">:if</span> <span style="color: #cc6666;">IS-MAC</span> macos<span style="color: #b294bb;">)</span>  <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">improve compatibility with macOS</span>
<span style="color: #b294bb;">(</span>tty +osc<span style="color: #b294bb;">)</span>                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">improve the terminal Emacs experience</span>
</pre>
                </div>
              </div>
            </div>
