config/doom/config.org
**** Language support
#+name: doom-lang
#+begin_src emacs-lisp
;;agda              ; types of types of types of types...
;;assembly          ; assembly for fun or debugging
(cc +lsp +tree-sitter)                ; C/C++/Obj-C madness
;;clojure           ; java with a lisp
common-lisp       ; if you've seen one lisp, you've seen them all
;;coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
(csharp
 +lsp
 ;; +unity
 +tree-sitter
 +dotnet)            ; unity, .NET, and mono shenanigans
data              ; config/data formats
;; (dart +flutter +lsp)   ; paint ui and not much else
;;erlang            ; an elegant language for a more civilized age
ess                          ; emacs speaks statistics
(elixir
 +lsp
 )                                        ; erlang done right
;;elm               ; care for a cup of TEA?
emacs-lisp        ; drown in parentheses
;;ess               ; emacs speaks statistics
(fsharp           ; ML stands for Microsoft's Language
 +lsp
 )
(go +lsp +tree-sitter)                ; the hipster dialect
(haskell             ; a language that's lazier than I am
 +lsp
 +tree-sitter
 )
;;hy                ; readability of scheme w/ speed of python
;;idris             ;
;;(java +meghanada) ; the poster child for carpal tunnel syndrome
(javascript
 +lsp
 +tree-sitter
 )        ; all(hope(abandon(ye(who(enter(here))))))

(json +lsp +tree-sitter)
;;julia             ; a better, faster MATLAB
(kotlin +lsp +tree-sitter)            ; a better, slicker Java(Script)
(latex
 +lsp
 +cdlatex
 +latexmk
 +fold)            ; writing papers in Emacs has never been so fun
;;ledger            ; an accounting system in Emacs
lua               ; one-based indices? one-based indices
(markdown +grip)         ; writing docs for people to ignore
;;nim               ; python + lisp at the speed of c
(nix
 +tree-sitter
 )               ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
(org              ; organize your plain life in plain text
 ;; +pretty       ; Disable since I use org-modern
 +pandoc
 +dragndrop       ; file drag & drop support
 +noter                      ; enhanced PDF notetaking
 +present         ; using Emacs for presentations
 +gnuplot
 +journal
 +roam2
 )
;;perl              ; write code no one else can comprehend
(php +lsp +tree-sitter)               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
;;purescript        ; javascript, but functional
(python
 +lsp
 +tree-sitter
 )           ; beautiful is better than ugly
;;qt                ; the 'cutest' gui framework ever
;;racket            ; a DSL for DSLs
;;rest              ; Emacs as a REST client
;;ruby              ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(rust
 +lsp
 +tree-sitter
 )            ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
(scala +lsp)             ; java, but good
scheme            ; a fully conniving family of lisps
(sh +lsp +tree-sitter)                ; she sells {ba,z,fi}sh shells on the C xor
solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
(web +lsp +tree-sitter)              ; the tubes
(yaml +lsp +tree-sitter)
;; graphql
;;vala              ; GObjective-C
#+end_src
**** Everything in Emacs
It's just too convenient being able to have everything in Emacs.
I couldn't resist the Email and Feed modules.

#+name: doom-email
#+begin_src emacs-lisp
(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

#+name: doom-app
#+begin_src emacs-lisp
calendar
everywhere                   ; *leave* Emacs!? You must be joking.
irc                          ; how neckbeards socialize
(rss +org)                   ; emacs as an RSS reader
;;twitter                    ; twitter client https://twitter.com/vnought
#+end_src

*** Visual settings
