config/doom/config.html
            <div id="outline-container-orga0e4e6b" class="outline-5">
              <h5 id="orga0e4e6b">
                <span class="section-number-5">1.3.1.3.</span> Language support
              </h5>
              <div class="outline-text-5" id="text-1-3-1-3">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="orgbd78de8"
                  ><span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">agda              ; types of types of types of types...</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">assembly          ; assembly for fun or debugging</span>
<span style="color: #b294bb;">(</span>cc +lsp +tree-sitter<span style="color: #b294bb;">)</span>                <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">C/C++/Obj-C madness</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">clojure           ; java with a lisp</span>
common-lisp       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">if you've seen one lisp, you've seen them all</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">coq               ; proofs-as-programs</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">crystal           ; ruby at the speed of c</span>
<span style="color: #b294bb;">(</span>csharp
 +lsp
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">+unity</span>
 +tree-sitter
 +dotnet<span style="color: #b294bb;">)</span>            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">unity, .NET, and mono shenanigans</span>
data              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">config/data formats</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(dart +flutter +lsp)   ; paint ui and not much else</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">erlang            ; an elegant language for a more civilized age</span>
ess                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">emacs speaks statistics</span>
<span style="color: #b294bb;">(</span>elixir
 +lsp
 <span style="color: #b294bb;">)</span>                                        <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">erlang done right</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">elm               ; care for a cup of TEA?</span>
emacs-lisp        <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">drown in parentheses</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ess               ; emacs speaks statistics</span>
<span style="color: #b294bb;">(</span>fsharp           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">ML stands for Microsoft's Language</span>
 +lsp
 <span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span>go +lsp +tree-sitter<span style="color: #b294bb;">)</span>                <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">the hipster dialect</span>
<span style="color: #b294bb;">(</span>haskell             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a language that's lazier than I am</span>
 +lsp
 +tree-sitter
 <span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">hy                ; readability of scheme w/ speed of python</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">idris             ;</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">(java +meghanada) ; the poster child for carpal tunnel syndrome</span>
<span style="color: #b294bb;">(</span>javascript
 +lsp
 +tree-sitter
 <span style="color: #b294bb;">)</span>        <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">all(hope(abandon(ye(who(enter(here))))))</span>

<span style="color: #b294bb;">(</span>json +lsp +tree-sitter<span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">julia             ; a better, faster MATLAB</span>
<span style="color: #b294bb;">(</span>kotlin +lsp +tree-sitter<span style="color: #b294bb;">)</span>            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a better, slicker Java(Script)</span>
<span style="color: #b294bb;">(</span>latex
 +lsp
 +cdlatex
 +latexmk
 +fold<span style="color: #b294bb;">)</span>            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">writing papers in Emacs has never been so fun</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ledger            ; an accounting system in Emacs</span>
lua               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">one-based indices? one-based indices</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">markdown</span> +grip<span style="color: #b294bb;">)</span>         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">writing docs for people to ignore</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">nim               ; python + lisp at the speed of c</span>
<span style="color: #b294bb;">(</span>nix
 +tree-sitter
 <span style="color: #b294bb;">)</span>               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">I hereby declare "nix geht mehr!"</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ocaml             ; an objective camel</span>
<span style="color: #b294bb;">(</span>org              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">organize your plain life in plain text</span>
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">+pretty       ; Disable since I use org-modern</span>
 +pandoc
 +dragndrop       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">file drag &amp; drop support</span>
 +noter                      <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">enhanced PDF notetaking</span>
 +present         <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">using Emacs for presentations</span>
 +gnuplot
 +journal
 +roam2
 <span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">perl              ; write code no one else can comprehend</span>
<span style="color: #b294bb;">(</span>php +lsp +tree-sitter<span style="color: #b294bb;">)</span>               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">perl's insecure younger brother</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">plantuml          ; diagrams for confusing people more</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">purescript        ; javascript, but functional</span>
<span style="color: #b294bb;">(</span>python
 +lsp
 +tree-sitter
 <span style="color: #b294bb;">)</span>           <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">beautiful is better than ugly</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">qt                ; the '</span><span style="color: #de935f;">cutest</span><span style="color: #5a5b5a;">' gui framework ever</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">racket            ; a DSL for DSLs</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">rest              ; Emacs as a REST client</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">ruby              ; 1.step {|i| p "Ruby is #{i.even? ? '</span><span style="color: #de935f;">love</span><span style="color: #5a5b5a;">' : '</span><span style="color: #de935f;">life</span><span style="color: #5a5b5a;">'}"}</span>
<span style="color: #b294bb;">(</span>rust
 +lsp
 +tree-sitter
 <span style="color: #b294bb;">)</span>            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Fe2O3.unwrap().unwrap().unwrap().unwrap()</span>
<span style="color: #b294bb;">(</span>scala +lsp<span style="color: #b294bb;">)</span>             <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">java, but good</span>
scheme            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">a fully conniving family of lisps</span>
<span style="color: #b294bb;">(</span>sh +lsp +tree-sitter<span style="color: #b294bb;">)</span>                <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">she sells {ba,z,fi}sh shells on the C xor</span>
solidity          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">do you need a blockchain? No.</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">swift             ; who asked for emoji variables?</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">terra             ; Earth and Moon in alignment for performance.</span>
<span style="color: #b294bb;">(</span>web +lsp +tree-sitter<span style="color: #b294bb;">)</span>              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">the tubes</span>
<span style="color: #b294bb;">(</span>yaml +lsp +tree-sitter<span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">graphql</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">vala              ; GObjective-C</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgfe1e063" class="outline-5">
              <h5 id="orgfe1e063">
                <span class="section-number-5">1.3.1.4.</span> Everything in
                Emacs
              </h5>
              <div class="outline-text-5" id="text-1-3-1-4">
                <p>
                  It&rsquo;s just too convenient being able to have everything
                  in Emacs. I couldn&rsquo;t resist the Email and Feed modules.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org0ccf299"
                  ><span style="color: #b294bb;">(</span><span style="color: #81a2be;">mu4e</span> +org +gmail<span style="color: #b294bb;">)</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">notmuch</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">(wanderlust +gmail)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre class="src src-emacs-lisp" id="org314d66b">calendar
everywhere                   <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">*leave* Emacs!? You must be joking.</span>
irc                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">how neckbeards socialize</span>
<span style="color: #b294bb;">(</span>rss +org<span style="color: #b294bb;">)</span>                   <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">emacs as an RSS reader</span>
<span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">twitter                    ; twitter client https://twitter.com/vnought</span>
</pre>
                </div>
              </div>
            </div>
          </div>

          <div id="outline-container-org609c739" class="outline-4">
            <h4 id="org609c739">
              <span class="section-number-4">1.3.2.</span> Visual settings
            </h4>
