config/doom/config.org
**** Font Face
Use font aliases defined in fontconfig.
#+begin_src emacs-lisp
;; (setq! doom-font (font-spec :family "monospace" :size 16)
;;        ;; doom-big-font (font-spec :family "monospace" :size 26)
;;        doom-variable-pitch-font (font-spec :family "sans" :size 16)
;;        ;; doom-unicode-font (font-spec :family "JuliaMono")
;;        doom-unicode-font doom-variable-pitch-font
;;        ;; doom-unicode-font doom-font
;;        doom-serif-font doom-variable-pitch-font
;;        )

(setq doom-font (font-spec :family "monospace" :size 16)
      doom-big-font (font-spec :family "monospace" :size 26)
      doom-variable-pitch-font (font-spec :family "sans" :size 16)
      ;; doom-unicode-font (font-spec :family "JuliaMono")
      doom-unicode-font doom-variable-pitch-font
      doom-serif-font doom-variable-pitch-font)

;; Fix cyryllic fonts
;; (if (display-graphic-p)

;;     (dolist (charset '(koi8))
;;       (set-fontset-font (frame-parameter nil 'font)
;;                         charset (font-spec :family "sans" :height 90)))

;;   (after! unicode-fonts
;;     (dolist (unicode-block '("Cyrillic"
;;                              "Cyrillic Supplement"))
;;       (push "sans" (cadr (assoc unicode-block unicode-fonts-block-font-mapping)))))

;;   )
#+end_src
**** Theme and modeline
#+begin_src emacs-lisp
(setq doom-theme 'doom-tomorrow-night)
#+end_src

I don't need it to tell me its UTF-8
#+begin_src emacs-lisp
;; I don't need it to tell me its UTF-8
(setq doom-modeline-buffer-encoding nil
      +modeline-encoding nil)
#+end_src
**** Miscellaneous
Relative line numbers are fantastic for knowing how far away line numbers are,
then =ESC 12 <UP>= gets you exactly where you think.
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

Prevents some cases of Emacs flickering
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(inhibit-double-buffering . t))
#+end_src

 Don't blink the cursor, it's too distracting.
 #+begin_src emacs-lisp
(setq visible-cursor nil
      blink-cursor-mode -1)
#+end_src
**** Ligatures
I really don't like some ligatures so disabling them here.
#+begin_src emacs-lisp
(plist-put! +ligatures-extra-symbols
  :int           nil
  :name          nil
  :composition   nil
  :map           nil
  :not           nil
  :and           nil
  :or            nil
  :for           nil
  :return        nil
  :yield         nil
  :diff          nil
  :tuple         nil
  :pipe          nil
)
#+end_src
**** Scrolling
Smooth scrolling in emacs
#+begin_src emacs-lisp :tangle packages.el
(package! good-scroll)
#+end_src
#+begin_src emacs-lisp
(use-package! good-scroll
  :config
  (good-scroll-mode)
)
#+end_src

