config/doom/config.html
            <div class="outline-text-4" id="text-1-3-2"></div>
            <div id="outline-container-org3b71662" class="outline-5">
              <h5 id="org3b71662">
                <span class="section-number-5">1.3.2.1.</span> Font Face
              </h5>
              <div class="outline-text-5" id="text-1-3-2-1">
                <p>Use font aliases defined in fontconfig.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq!</span> <span style="color: #cc6666;">doom-font</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">font-spec</span> <span style="color: #81a2be;">:family</span> <span style="color: #b5bd68;">"monospace"</span> <span style="color: #81a2be;">:size</span> <span style="color: #de935f; font-weight: bold;">16</span><span style="color: #81a2be;">)</span>
       <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">doom-big-font (font-spec :family "monospace" :size 26)</span>
       <span style="color: #cc6666;">doom-variable-pitch-font</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">font-spec</span> <span style="color: #81a2be;">:family</span> <span style="color: #b5bd68;">"sans"</span> <span style="color: #81a2be;">:size</span> <span style="color: #de935f; font-weight: bold;">16</span><span style="color: #81a2be;">)</span>
       <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">doom-unicode-font (font-spec :family "JuliaMono")</span>
       <span style="color: #cc6666;">doom-unicode-font</span> <span style="color: #cc6666;">doom-variable-pitch-font</span>
       <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">doom-unicode-font doom-font</span>
       <span style="color: #cc6666;">doom-serif-font</span> <span style="color: #cc6666;">doom-variable-pitch-font</span>
       <span style="color: #b294bb;">)</span>

<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Fix cyryllic fonts</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">if</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">display-graphic-p</span><span style="color: #81a2be;">)</span>

    <span style="color: #81a2be;">(</span><span style="color: #b294bb;">dolist</span> <span style="color: #de935f;">(</span>charset <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>koi8<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #de935f;">set-fontset-font</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">frame-parameter</span> nil <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">font</span><span style="color: #b5bd68;">)</span>
                        charset <span style="color: #b5bd68;">(</span><span style="color: #de935f;">font-spec</span> <span style="color: #81a2be;">:family</span> <span style="color: #b5bd68;">"sans"</span> <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">90</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">after!</span> unicode-fonts
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">dolist</span> <span style="color: #b5bd68;">(</span>unicode-block <span style="color: #c5c8c6;">'</span><span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"Cyrillic"</span>
                             <span style="color: #b5bd68;">"Cyrillic Supplement"</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">push</span> <span style="color: #b5bd68;">"sans"</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">cadr</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">assoc</span> unicode-block <span style="color: #cc6666;">unicode-fonts-block-font-mapping</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orge2d015e" class="outline-5">
              <h5 id="orge2d015e">
                <span class="section-number-5">1.3.2.2.</span> Theme and
                modeline
              </h5>
              <div class="outline-text-5" id="text-1-3-2-2">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">doom-theme</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">doom-tomorrow-night</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>I don&rsquo;t need it to tell me its UTF-8</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">I don't need it to tell me its UTF-8</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">doom-modeline-buffer-encoding</span> nil
      +modeline-encoding nil<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-org91805eb" class="outline-5">
              <h5 id="org91805eb">
                <span class="section-number-5">1.3.2.3.</span> Miscellaneous
              </h5>
              <div class="outline-text-5" id="text-1-3-2-3">
                <p>
                  Relative line numbers are fantastic for knowing how far away
                  line numbers are, then <code>ESC 12 &lt;UP&gt;</code> gets you
                  exactly where you think.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">display-line-numbers-type</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">relative</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Prevents some cases of Emacs flickering</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">default-frame-alist</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>inhibit-double-buffering . t<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Don&rsquo;t blink the cursor, it&rsquo;s too distracting.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">visible-cursor</span> nil
      <span style="color: #cc6666;">blink-cursor-mode</span> <span style="color: #de935f; font-weight: bold;">-1</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgc66c08b" class="outline-5">
              <h5 id="orgc66c08b">
                <span class="section-number-5">1.3.2.4.</span> Ligatures
              </h5>
              <div class="outline-text-5" id="text-1-3-2-4">
                <p>
                  I really don&rsquo;t like some ligatures so disabling them
                  here.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">plist-put!</span> <span style="color: #cc6666;">+ligatures-extra-symbols</span>
  <span style="color: #81a2be;">:int</span>           nil
  <span style="color: #81a2be;">:name</span>          nil
  <span style="color: #81a2be;">:composition</span>   nil
  <span style="color: #81a2be;">:map</span>           nil
  <span style="color: #81a2be;">:not</span>           nil
  <span style="color: #81a2be;">:and</span>           nil
  <span style="color: #81a2be;">:or</span>            nil
  <span style="color: #81a2be;">:for</span>           nil
  <span style="color: #81a2be;">:return</span>        nil
  <span style="color: #81a2be;">:yield</span>         nil
  <span style="color: #81a2be;">:diff</span>          nil
  <span style="color: #81a2be;">:tuple</span>         nil
  <span style="color: #81a2be;">:pipe</span>          nil
<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orga0e0d9b" class="outline-5">
              <h5 id="orga0e0d9b">
                <span class="section-number-5">1.3.2.5.</span> Scrolling
              </h5>
              <div class="outline-text-5" id="text-1-3-2-5">
                <p>Smooth scrolling in emacs</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> good-scroll<span style="color: #b294bb;">)</span>
</pre>
                </div>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> good-scroll
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">good-scroll-mode</span><span style="color: #81a2be;">)</span>
<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
