config/doom/config.html

            <div id="outline-container-org2fae20f" class="outline-5">
              <h5 id="org2fae20f">
                <span class="section-number-5">1.3.2.6.</span> Prettier page
                breaks
              </h5>
              <div class="outline-text-5" id="text-1-3-2-6">
                <p>
                  In some files, <code>^L</code> appears as a page break
                  character. This isn&rsquo;t that visually appealing, and Steve
                  Purcell has been nice enough to make a package to display
                  these as horizontal rules.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> page-break-lines <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"purcell/page-break-lines"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"79eca86e0634..."</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> page-break-lines
  <span style="color: #81a2be;">:commands</span> page-break-lines-mode
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">autoload</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">turn-on-page-break-lines-mode</span> <span style="color: #b5bd68;">"page-break-lines"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> page-break-lines-max-width <span style="color: #cc6666;">fill-column</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:prefix</span> <span style="color: #b5bd68;">"g"</span>
        <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Prev page break"</span> <span style="color: #81a2be;">:nv</span> <span style="color: #b5bd68;">"["</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">backward-page</span>
        <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Next page break"</span> <span style="color: #81a2be;">:nv</span> <span style="color: #b5bd68;">"]"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">forward-page</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>

          <div id="outline-container-org4f9b492" class="outline-4">
            <h4 id="org4f9b492">
              <span class="section-number-4">1.3.3.</span> Allow babel execution
              in CLI actions
            </h4>
            <div class="outline-text-4" id="text-1-3-3">
              <p>
                In this config I sometimes generate code to include in my
                config. This works nicely, but for it to work with
                <code>doom sync</code> et. al. I need to make sure that Org
                doesn&rsquo;t try to confirm that I want to allow evaluation (I
                do!).
              </p>

              <p>
                Thankfully Doom supports <code>$DOOMDIR/cli.el</code> file which
                is sourced every time a CLI command is run, so we can just
                enable evaluation by setting
                <code>org-confirm-babel-evaluate</code> to
                <code>nil</code> there. While we&rsquo;re at it, we should
                silence <code>org-babel-execute-src-block</code> to avoid
                polluting the output.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #5a5b5a;">;;; </span><span style="color: #5a5b5a;">cli.el -*- lexical-binding: t; -*-</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-confirm-babel-evaluate</span> nil<span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">doom-shut-up-a</span> <span style="color: #81a2be;">(</span>orig-fn <span style="color: #f0c674;">&amp;rest</span> args<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">quiet!</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">apply</span> orig-fn args<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">advice-add</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-babel-execute-src-block</span> <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">doom-shut-up-a</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
        <div id="outline-container-org99e5d54" class="outline-3">
          <h3 id="org99e5d54">
            <span class="section-number-3">1.4.</span> Performance
          </h3>
          <div class="outline-text-3" id="text-1-4">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">gcmh-high-cons-threshold</span> <span style="color: #cc6666;">most-positive-fixnum</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">max-specpdl-size</span> <span style="color: #de935f; font-weight: bold;">100000</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org8919c85" class="outline-3">
          <h3 id="org8919c85">
            <span class="section-number-3">1.5.</span> Other Things
          </h3>
          <div class="outline-text-3" id="text-1-5"></div>
          <div id="outline-container-org088c595" class="outline-4">
            <h4 id="org088c595">
              <span class="section-number-4">1.5.1.</span> Editor interaction
            </h4>
            <div class="outline-text-4" id="text-1-5-1"></div>
            <div id="outline-container-org003a069" class="outline-5">
              <h5 id="org003a069">
                <span class="section-number-5">1.5.1.1.</span> Mouse buttons
              </h5>
              <div class="outline-text-5" id="text-1-5-1-1">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:n</span> <span style="color: #81a2be;">[</span>mouse-8<span style="color: #81a2be;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">better-jumper-jump-backward</span>
      <span style="color: #81a2be;">:n</span> <span style="color: #81a2be;">[</span>mouse-9<span style="color: #81a2be;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">better-jumper-jump-forward</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>
          <div id="outline-container-org7fc617b" class="outline-4">
            <h4 id="org7fc617b">
              <span class="section-number-4">1.5.2.</span> Splash screen
            </h4>
            <div class="outline-text-4" id="text-1-5-2">
              <p>Splash image</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">fancy-splash-image</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #cc6666;">doom-private-dir</span> <span style="color: #b5bd68;">"splash.png"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>Hide modeline and cursor</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #de935f;">remove-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">+doom-dashboard-functions</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">doom-dashboard-widget-loaded</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">+doom-dashboard-mode-hook</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">hide-mode-line-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">hl-line-mode</span> <span style="color: #de935f; font-weight: bold;">-1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">+doom-dashboard-mode-hook</span> <span style="color: #cc6666;">evil-normal-state-cursor</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">list</span> nil<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org139369a" class="outline-4">
            <h4 id="org139369a">
              <span class="section-number-4">1.5.3.</span> Daemon
            </h4>
            <div class="outline-text-4" id="text-1-5-3"></div>
            <div id="outline-container-org4104ee6" class="outline-5">
              <h5 id="org4104ee6">
                <span class="section-number-5">1.5.3.1.</span> Dashboard
              </h5>
              <div class="outline-text-5" id="text-1-5-3-1">
                <p>
                  I&rsquo;m not sure quite why it happens, but after a bit it
                  seems that new Emacsclient frames start on the
                  <code>*scratch*</code> buffer instead of the dashboard. I
                  prefer the dashboard, so let&rsquo;s ensure that&rsquo;s
                  always switched to in new frames.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                    id="org84ff706"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">daemonp</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">server-after-make-frame-hook</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">switch-to-buffer</span> <span style="color: #cc6666;">+doom-dashboard-name</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-org116981c" class="outline-2">
        <h2 id="org116981c">
          <span class="section-number-2">2.</span> Package loading
        </h2>
        <div class="outline-text-2" id="text-2">
          <p>This file shouldn&rsquo;t be byte compiled.</p>
          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">-*- no-byte-compile: t; -*-</span>
</pre>
          </div>
        </div>
