config/doom/config.org
** General packages
*** Fun
Every so often, you want everyone else to /know/ that you're typing, or just to
amuse oneself. Introducing: typewriter sounds!
#+begin_src emacs-lisp
(package! selectric-mode)
#+end_src

Practice typing speed
#+begin_src emacs-lisp
(package! speed-type)
#+end_src

Why not flash words on the screen. Why not --- hey, it could be fun.
#+begin_src emacs-lisp
(package! spray)
#+end_src

For some reason, I find myself demoing Emacs every now and then. Showing what
keyboard stuff I'm doing on-screen seems helpful. While [[https://gitlab.com/screenkey/screenkey][screenkey]] does exist,
having something that doesn't cover up screen content is nice.
#+begin_src emacs-lisp
(package! keycast)
#+end_src

In a similar manner, [[https://gitlab.com/ambrevar/emacs-gif-screencast][gif-screencast]] may come in handy.
#+begin_src emacs-lisp
(package! gif-screencast)
#+end_src

*** Features
**** CalcTeX
This is a nice extension to ~calc~
#+begin_src emacs-lisp
(package! calctex :recipe (:host github :repo "johnbcoughlin/calctex"
                           :files ("*.el" "calctex/*.el" "calctex-contrib/*.el" "org-calctex/*.el"))
)
#+end_src
**** Info colors
This makes manual pages nicer to look at :)
Variable pitch fontification + colouring
#+begin_src emacs-lisp
(package! info-colors :pin "47ee73cc19b1049eef32c9f3e264ea7ef2aaf8a5")
#+end_src

**** Calibre and ebook reading
For managing my ebooks, I'll hook into the well-established ebook library
manager [[https://calibre-ebook.com/][calibre]]. A number of Emacs clients for this exist, but this seems like a
good option.
#+begin_src emacs-lisp
(package! calibredb)
#+end_src

Then for reading them, the only currently viable options seems to be [[https://depp.brause.cc/nov.el/][nov.el]].
#+begin_src emacs-lisp
(package! nov)
#+end_src

Together these should give me a rather good experience reading ebooks.
**** Screenshots
This makes it a breeze to take lovely screenshots.
#+begin_src emacs-lisp
(package! screenshot :recipe (:host github :repo "tecosaur/screenshot" :build (:not compile)))
#+end_src
**** Theme schedule
#+begin_src emacs-lisp
(package! circadian)
#+end_src
**** Non-default keyboard layouts support
#+begin_src emacs-lisp
(package! reverse-im)
#+end_src
**** Kdeconnect
#+begin_src emacs-lisp
(package! kdeconnect)
#+end_src
**** Imenu
#+begin_src emacs-lisp
(package! imenu-list)
#+end_src
**** Deadgrep
#+begin_src emacs-lisp
(package! deadgrep)
#+end_src
**** Company
*****  Prescient
#+begin_src emacs-lisp
(package! company-prescient)
#+end_src
*****  Fuzzy
#+begin_src emacs-lisp
(package! company-fuzzy)
(package! flx)
;; (package! flx-rs)
#+end_src
*****  Math
#+begin_src emacs-lisp
(package! company-math)
#+end_src
