config/doom/config.html
        <div id="outline-container-orgf823c52" class="outline-3">
          <h3 id="orgf823c52">
            <span class="section-number-3">2.1.</span> General packages
          </h3>
          <div class="outline-text-3" id="text-2-1"></div>
          <div id="outline-container-orgebadd40" class="outline-4">
            <h4 id="orgebadd40">
              <span class="section-number-4">2.1.1.</span> Fun
            </h4>
            <div class="outline-text-4" id="text-2-1-1">
              <p>
                Every so often, you want everyone else to <i>know</i> that
                you&rsquo;re typing, or just to amuse oneself. Introducing:
                typewriter sounds!
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> <span style="color: #cc6666;">selectric-mode</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>Practice typing speed</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> speed-type<span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                Why not flash words on the screen. Why not &#x2014; hey, it
                could be fun.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> spray<span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                For some reason, I find myself demoing Emacs every now and then.
                Showing what keyboard stuff I&rsquo;m doing on-screen seems
                helpful. While
                <a href="https://gitlab.com/screenkey/screenkey">screenkey</a>
                does exist, having something that doesn&rsquo;t cover up screen
                content is nice.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> keycast<span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                In a similar manner,
                <a href="https://gitlab.com/ambrevar/emacs-gif-screencast"
                  >gif-screencast</a
                >
                may come in handy.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> gif-screencast<span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>

          <div id="outline-container-orgc4c419d" class="outline-4">
            <h4 id="orgc4c419d">
              <span class="section-number-4">2.1.2.</span> Features
            </h4>
            <div class="outline-text-4" id="text-2-1-2"></div>
            <div id="outline-container-org65c2b71" class="outline-5">
              <h5 id="org65c2b71">
                <span class="section-number-5">2.1.2.1.</span> CalcTeX
              </h5>
              <div class="outline-text-5" id="text-2-1-2-1">
                <p>This is a nice extension to <code>calc</code></p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> calctex <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"johnbcoughlin/calctex"</span>
                           <span style="color: #81a2be;">:files</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"*.el"</span> <span style="color: #b5bd68;">"calctex/*.el"</span> <span style="color: #b5bd68;">"calctex-contrib/*.el"</span> <span style="color: #b5bd68;">"org-calctex/*.el"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgd1a1fab" class="outline-5">
              <h5 id="orgd1a1fab">
                <span class="section-number-5">2.1.2.2.</span> Info colors
              </h5>
              <div class="outline-text-5" id="text-2-1-2-2">
                <p>
                  This makes manual pages nicer to look at :) Variable pitch
                  fontification + colouring
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> info-colors <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"47ee73cc19b1..."</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>

            <div id="outline-container-orgbb3eb80" class="outline-5">
              <h5 id="orgbb3eb80">
                <span class="section-number-5">2.1.2.3.</span> Calibre and ebook
                reading
              </h5>
              <div class="outline-text-5" id="text-2-1-2-3">
                <p>
                  For managing my ebooks, I&rsquo;ll hook into the
                  well-established ebook library manager
                  <a href="https://calibre-ebook.com/">calibre</a>. A number of
                  Emacs clients for this exist, but this seems like a good
                  option.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> calibredb<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Then for reading them, the only currently viable options seems
                  to be <a href="https://depp.brause.cc/nov.el/">nov.el</a>.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> nov<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Together these should give me a rather good experience reading
                  ebooks.
                </p>
              </div>
            </div>
            <div id="outline-container-org06f5371" class="outline-5">
              <h5 id="org06f5371">
                <span class="section-number-5">2.1.2.4.</span> Screenshots
              </h5>
              <div class="outline-text-5" id="text-2-1-2-4">
                <p>This makes it a breeze to take lovely screenshots.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> screenshot <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"tecosaur/screenshot"</span> <span style="color: #81a2be;">:build</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">:not</span> compile<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgede6dc9" class="outline-5">
              <h5 id="orgede6dc9">
                <span class="section-number-5">2.1.2.5.</span> Theme schedule
              </h5>
              <div class="outline-text-5" id="text-2-1-2-5">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> circadian<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgc714a0b" class="outline-5">
              <h5 id="orgc714a0b">
                <span class="section-number-5">2.1.2.6.</span> Non-default
                keyboard layouts support
              </h5>
              <div class="outline-text-5" id="text-2-1-2-6">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> reverse-im<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
