config/doom/config.html
            <div id="outline-container-org043de87" class="outline-5">
              <h5 id="org043de87">
                <span class="section-number-5">2.2.2.2.</span> Visuals
              </h5>
              <div class="outline-text-5" id="text-2-2-2-2">
                <p>
                  For automatically toggling LaTeX fragment previews
                  there&rsquo;s this nice package
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-fragtog <span style="color: #81a2be;">:pin</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Then for pretty markers</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-appear <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"awth13/org-appear"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  <code>org-superstar-mode</code> is great. While we&rsquo;re at
                  it we may as well make tags prettier as well :)
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-pretty-tags<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  There&rsquo;s this nice package that can provide nice syntax
                  highlighting with LaTeX exports.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> engrave-faces <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"tecosaur/engrave-faces"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> engrave-faces-latex
  <span style="color: #81a2be;">:after</span> ox-latex<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgf13ec19" class="outline-5">
              <h5 id="orgf13ec19">
                <span class="section-number-5">2.2.2.3.</span> Extra
                functionality
              </h5>
              <div class="outline-text-5" id="text-2-2-2-3">
                <p>
                  Because of the
                  <i
                    ><a
                      href="https://github.com/commonmark/commonmark-spec/wiki/markdown-flavors"
                      >lovely variety in markdown implementations</a
                    ></i
                  >
                  there isn&rsquo;t actually such a thing a standard table spec
                  &#x2026; or standard anything really. Because
                  <code>org-md</code> is a goody-two-shoes, it just uses HTML
                  for all these non-standardised elements (a lot of them). So
                  <code>ox-gfm</code> is handy for exporting markdown with all
                  the features that GitHub has.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> ox-gfm<span style="color: #b294bb;">)</span>
</pre>
                </div>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> ox-gfm
  <span style="color: #81a2be;">:after</span> org<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Now and then citations need to happen</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-ref<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Came across this and &#x2026; it&rsquo;s cool</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-graph-view <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"alphapapa/org-graph-view"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  I <b>need</b> this in my life. It take a URL to a recipe from
                  a common site, and inserts an org-ified version at point.
                  Isn&rsquo;t that just great.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-chef<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Sometimes I&rsquo;m given non-org files, that&rsquo;s very
                  sad. Luckily Pandoc offers a way to make that right again, and
                  this package makes that even easier to do.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-pandoc-import <span style="color: #81a2be;">:recipe</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"tecosaur/org-pandoc-import"</span> <span style="color: #81a2be;">:files</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"*.el"</span> <span style="color: #b5bd68;">"filters"</span> <span style="color: #b5bd68;">"preprocessors"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-pandoc-import
  <span style="color: #81a2be;">:after</span> org<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> ob-mermaid<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-modern<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-appear <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"awth13/org-appear"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"60ba267c5da3..."</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>It&rsquo;s nice to have UI for org-roam</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-roam-ui<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> websocket<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-transclusion<span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>
          <div id="outline-container-org806cd22" class="outline-4">
            <h4 id="org806cd22">
              <span class="section-number-4">2.2.3.</span> Systemd
            </h4>
            <div class="outline-text-4" id="text-2-2-3">
              <p>For editing systemd unit files</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> systemd <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"b6ae63a23660..."</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-orgf7bc9f8" class="outline-4">
            <h4 id="orgf7bc9f8">
              <span class="section-number-4">2.2.4.</span> Graphviz
            </h4>
            <div class="outline-text-4" id="text-2-2-4">
              <p>
                Graphviz is a nice method of visualising simple graphs, based on
                plaintext
                <code>.dot</code> / <code>.gv</code> files.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> graphviz-dot-mode <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"3642a0a5f41a..."</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
