config/doom/config.org
*** Authinfo
#+begin_src emacs-lisp
(package! authinfo-color-mode
  :recipe (:host github :repo  "tecosaur/authinfo-color-mode"))
#+end_src
Now we just need to load it appropriately.
#+begin_src emacs-lisp :tangle yes
(use-package! authinfo-color-mode
  :mode ("authinfo.gpg\\'" . authinfo-color-mode)
  :init (advice-add 'authinfo-mode :override #'authinfo-color-mode))
#+end_src
* Package configuration
** Abbrev mode
Thanks to [[https://emacs.stackexchange.com/questions/45462/use-a-single-abbrev-table-for-multiple-modes/45476#45476][use a single abbrev-table for multiple modes? - Emacs Stack Exchange]] I
have the following.
#+begin_src emacs-lisp
(use-package abbrev
  :init
  (setq-default abbrev-mode t)
  ;; a hook funtion that sets the abbrev-table to org-mode-abbrev-table
  ;; whenever the major mode is a text mode
  (defun tec/set-text-mode-abbrev-table ()
    (if (derived-mode-p 'text-mode)
        (setq local-abbrev-table org-mode-abbrev-table)))
  :commands abbrev-mode
  :hook
  (abbrev-mode . tec/set-text-mode-abbrev-table)
  :config
  (setq abbrev-file-name (expand-file-name "abbrev.el" doom-private-dir))
  (setq save-abbrevs 'silently))
#+end_src
** Avy
I want avy to jump though windows and auto-jump when theres 1 candidate
#+begin_src  emacs-lisp
(setq
 ;; Avy can jump through windows
 avy-all-windows t
 ;; Avy can auto-jump when theres 1 candidate
 avy-single-candidate-jump t)
#+end_src
** Calc
#+begin_src emacs-lisp
(add-hook 'calc-mode-hook #'calctex-mode)
#+end_src
** Circadian (Theme schedule)
#+begin_src emacs-lisp
(use-package! circadian
  :config
  (setq circadian-themes '(("8:00" . doom-tomorrow-night)
                           ("20:30" . doom-tomorrow-night)))
  (circadian-setup)
)
#+end_src
# ** Modus themes
# #+begin_src emacs-lisp :tangle packages.el
# (package! modus-themes)
# #+end_src

# #+begin_src emacs-lisp
# (use-package modus-themes
#   :config
#   (setq modus-themes-slanted-constructs t
#         modus-themes-bold-constructs t
#         modus-themes-subtle-line-numbers t
#         modus-themes-paren-match 'intense-bold
#         modus-themes-prompts 'subtle-accented
#         modus-themes-completions nil
#         modus-themes-region 'accent-no-extend
#         modus-themes-syntax 'alt-syntax-yellow-comments
#         modus-themes-scale-headings t
#         modus-themes-headings '((t . rainbow))
#         modus-themes-mode-line 'borderless
#         modus-themes-org-blocks 'grayscale
#         )
#   )
# #+end_src
