config/doom/config.html
          <div id="outline-container-org7067be3" class="outline-4">
            <h4 id="org7067be3">
              <span class="section-number-4">2.2.5.</span> Authinfo
            </h4>
            <div class="outline-text-4" id="text-2-2-5">
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> authinfo-color-mode
  <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span>  <span style="color: #b5bd68;">"tecosaur/authinfo-color-mode"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
              <p>Now we just need to load it appropriately.</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> authinfo-color-mode
  <span style="color: #81a2be;">:mode</span> <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"authinfo.gpg\\'"</span> . authinfo-color-mode<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:init</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">advice-add</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">authinfo-mode</span> <span style="color: #81a2be;">:override</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">authinfo-color-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-org01eab99" class="outline-2">
        <h2 id="org01eab99">
          <span class="section-number-2">3.</span> Package configuration
        </h2>
        <div class="outline-text-2" id="text-3"></div>
        <div id="outline-container-org5a94f54" class="outline-3">
          <h3 id="org5a94f54">
            <span class="section-number-3">3.1.</span> Abbrev mode
          </h3>
          <div class="outline-text-3" id="text-3-1">
            <p>
              Thanks to
              <a
                href="https://emacs.stackexchange.com/questions/45462/use-a-single-abbrev-table-for-multiple-modes/45476#45476"
                >use a single abbrev-table for multiple modes? - Emacs Stack
                Exchange</a
              >
              I have the following.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package</span> abbrev
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq-default</span> <span style="color: #cc6666;">abbrev-mode</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">a hook funtion that sets the abbrev-table to org-mode-abbrev-table</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">whenever the major mode is a text mode</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">tec/set-text-mode-abbrev-table</span> <span style="color: #de935f;">()</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">derived-mode-p</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">text-mode</span><span style="color: #b5bd68;">)</span>
        <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">local-abbrev-table</span> <span style="color: #cc6666;">org-mode-abbrev-table</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:commands</span> <span style="color: #cc6666;">abbrev-mode</span>
  <span style="color: #81a2be;">:hook</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">abbrev-mode</span> . tec/set-text-mode-abbrev-table<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">abbrev-file-name</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">expand-file-name</span> <span style="color: #b5bd68;">"abbrev.el"</span> <span style="color: #cc6666;">doom-private-dir</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">save-abbrevs</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">silently</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org409f122" class="outline-3">
          <h3 id="org409f122">
            <span class="section-number-3">3.2.</span> Avy
          </h3>
          <div class="outline-text-3" id="text-3-2">
            <p>
              I want avy to jump though windows and auto-jump when theres 1
              candidate
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span>
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Avy can jump through windows</span>
 <span style="color: #cc6666;">avy-all-windows</span> t
 <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Avy can auto-jump when theres 1 candidate</span>
 <span style="color: #cc6666;">avy-single-candidate-jump</span> t<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orga4a772b" class="outline-3">
          <h3 id="orga4a772b">
            <span class="section-number-3">3.3.</span> Calc
          </h3>
          <div class="outline-text-3" id="text-3-3">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">calc-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calctex-mode</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org7eaf276" class="outline-3">
          <h3 id="org7eaf276">
            <span class="section-number-3">3.4.</span> Circadian (Theme
            schedule)
          </h3>
          <div class="outline-text-3" id="text-3-4">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> circadian
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">circadian-themes</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"8:00"</span> . doom-tomorrow-night<span style="color: #b5bd68;">)</span>
                           <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"20:30"</span> . doom-tomorrow-night<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">circadian-setup</span><span style="color: #81a2be;">)</span>
<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
