config/doom/config.org
** Company
Some settings
#+begin_src emacs-lisp
(after! company
  (setq
   company-show-numbers t
   company-minimum-prefix-length 2
   )
  )
#+end_src

Now, the improvements from ~precedent~ are mostly from remembering history, so
let's improve that memory.
#+begin_src emacs-lisp
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src

Use prescient sorting
#+begin_src emacs-lisp
(use-package company-prescient
  :after company
  :hook (company-mode . company-prescient-mode))
#+end_src

# Use fuzzy sorting
# #+begin_src emacs-lisp
# (use-package! company-fuzzy
#   :hook (company-mode . company-fuzzy-mode)
#   :init
#   (setq
#    company-fuzzy-sorting-backend 'flx
#    ;; company-fuzzy-sorting-backend 'alphabetical
#    company-fuzzy-prefix-on-top nil
#    company-fuzzy-history-backends '(company-yasnippet)
#    company-fuzzy-trigger-symbols '("." "->" "<" "\"" "'" "@"))
#   )
# #+end_src

Math support
#+begin_src emacs-lisp
(use-package! company-math
  :after (:any org-mode TeX-mode)
  :config
  (set-company-backend! 'org-mode 'company-math-symbols-latex)
  (set-company-backend! 'TeX-mode 'company-math-symbols-latex)
  (set-company-backend! 'org-mode 'company-latex-commands)
  (set-company-backend! 'TeX-mode 'company-latex-commands)
  (setq company-tooltip-align-annotations t)
  (setq company-math-allow-latex-symbols-in-faces t))
#+end_src
*** ESS
** Deadgrep
#+begin_src emacs-lisp
(use-package! deadgrep
  :defer t
  :init
  (map!
   (:leader
    :desc "Search via deadgrep" "s <f5>" #'deadgrep))
  )
#+end_src
** Direnv
Silence all that useless output
#+begin_src emacs-lisp
(setq direnv-always-show-summary nil)
#+end_src
