config/doom/config.html
        <div id="outline-container-orgca65bb4" class="outline-3">
          <h3 id="orgca65bb4">
            <span class="section-number-3">3.5.</span> Company
          </h3>
          <div class="outline-text-3" id="text-3-5">
            <p>Some settings</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> company
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span>
   <span style="color: #cc6666;">company-show-numbers</span> t
   <span style="color: #cc6666;">company-minimum-prefix-length</span> <span style="color: #de935f; font-weight: bold;">2</span>
   <span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              Now, the improvements from <code>precedent</code> are mostly from
              remembering history, so let&rsquo;s improve that memory.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-default</span> <span style="color: #cc6666;">history-length</span> <span style="color: #de935f; font-weight: bold;">1000</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-default</span> <span style="color: #cc6666;">prescient-history-length</span> <span style="color: #de935f; font-weight: bold;">1000</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Use prescient sorting</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package</span> company-prescient
  <span style="color: #81a2be;">:after</span> company
  <span style="color: #81a2be;">:hook</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">company-mode</span> . <span style="color: #cc6666;">company-prescient-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Math support</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> company-math
  <span style="color: #81a2be;">:after</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:any</span> org-mode TeX-mode<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-company-backend!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">company-math-symbols-latex</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-company-backend!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">TeX-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">company-math-symbols-latex</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-company-backend!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">company-latex-commands</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-company-backend!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">TeX-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">company-latex-commands</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">company-tooltip-align-annotations</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> company-math-allow-latex-symbols-in-faces t<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
          <div id="outline-container-org87cedb7" class="outline-4">
            <h4 id="org87cedb7">
              <span class="section-number-4">3.5.1.</span> ESS
            </h4>
          </div>
        </div>
        <div id="outline-container-orgfc2bdc1" class="outline-3">
          <h3 id="orgfc2bdc1">
            <span class="section-number-3">3.6.</span> Deadgrep
          </h3>
          <div class="outline-text-3" id="text-3-6">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> deadgrep
  <span style="color: #81a2be;">:defer</span> t
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #de935f;">(</span><span style="color: #81a2be;">:leader</span>
    <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Search via deadgrep"</span> <span style="color: #b5bd68;">"s &lt;f5&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">deadgrep</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org42dfe0f" class="outline-3">
          <h3 id="org42dfe0f">
            <span class="section-number-3">3.7.</span> Direnv
          </h3>
          <div class="outline-text-3" id="text-3-7">
            <p>Silence all that useless output</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> direnv-always-show-summary nil<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
