config/doom/config.html
        <div id="outline-container-org3011cc4" class="outline-3">
          <h3 id="org3011cc4">
            <span class="section-number-3">3.8.</span> Doom modeline
          </h3>
          <div class="outline-text-3" id="text-3-8">
            <p>
              Very nice and pretty, however I think the PDF modeline could do
              with tweaking. I raised
              <a href="https://github.com/seagle0128/doom-modeline/pull/425"
                >an issue</a
              >
              on this, however the response was basically &ldquo;put your
              preferences in your personal config, the current default is
              sensible&rdquo; &#x2014; so here we are.
            </p>

            <p>
              First up I&rsquo;m going to want a segment for just the buffer
              file name, and a PDF icon. Then we&rsquo;ll redefine two functions
              used to generate the modeline.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> doom-modeline
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">doom-modeline-def-segment</span> <span style="color: #de935f;">buffer-name</span>
    <span style="color: #717171;">"Display the current buffer's name, without any other information."</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span>
     <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">doom-modeline-spc</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">doom-modeline--buffer-name</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">doom-modeline-def-segment</span> <span style="color: #de935f;">pdf-icon</span>
    <span style="color: #717171;">"PDF icon from all-the-icons."</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span>
     <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">doom-modeline-spc</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #cc6666;">doom-modeline-icon</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">octicon</span> <span style="color: #b5bd68;">"file-pdf"</span> nil nil
                         <span style="color: #81a2be;">:face</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">if</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline--active</span><span style="color: #81a2be;">)</span>
                                   <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-red</span>
                                 <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mode-line-inactive</span><span style="color: #b294bb;">)</span>
                         <span style="color: #81a2be;">:v-adjust</span> <span style="color: #de935f; font-weight: bold;">0.02</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">doom-modeline-update-pdf-pages</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Update PDF pages."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">doom-modeline--pdf-pages</span>
          <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">(</span>current-page-str <span style="color: #de935f;">(</span><span style="color: #de935f;">number-to-string</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eval</span> <span style="color: #c5c8c6;">`</span><span style="color: #b294bb;">(</span><span style="color: #b294bb;">pdf-view-current-page</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                <span style="color: #81a2be;">(</span>total-page-str <span style="color: #de935f;">(</span><span style="color: #de935f;">number-to-string</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">pdf-cache-number-of-pages</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
            <span style="color: #b294bb;">(</span><span style="color: #de935f;">concat</span>
             <span style="color: #81a2be;">(</span><span style="color: #de935f;">propertize</span>
              <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">make-string</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">-</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">length</span> total-page-str<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">length</span> current-page-str<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span> ? <span style="color: #b5bd68;">)</span>
                      <span style="color: #b5bd68;">" P"</span> current-page-str<span style="color: #de935f;">)</span>
              <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mode-line</span><span style="color: #81a2be;">)</span>
             <span style="color: #81a2be;">(</span><span style="color: #de935f;">propertize</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span> <span style="color: #b5bd68;">"/"</span> total-page-str<span style="color: #de935f;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">doom-modeline-buffer-minor-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">doom-modeline-def-segment</span> <span style="color: #de935f;">pdf-pages</span>
    <span style="color: #717171;">"Display PDF pages."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">doom-modeline--active</span><span style="color: #b5bd68;">)</span> <span style="color: #cc6666;">doom-modeline--pdf-pages</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">propertize</span> <span style="color: #cc6666;">doom-modeline--pdf-pages</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mode-line-inactive</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline-def-modeline</span> <span style="color: #de935f;">'pdf</span>
    <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span>bar window-number pdf-pages pdf-icon buffer-name<span style="color: #de935f;">)</span>
    <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span>misc-info matches <span style="color: #cc6666;">major-mode</span> process vcs<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org8096c4e" class="outline-3">
          <h3 id="org8096c4e">
            <span class="section-number-3">3.9.</span> Emacs-everywhere
          </h3>
          <div class="outline-text-3" id="text-3-9">
            <p>Configure it a bit</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> emacs-everywhere
  <span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">Make it easier to match with xmonad rule</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">emacs-everywhere-frame-name-format</span> <span style="color: #b5bd68;">"emacs-anywhere"</span><span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(defun emacs-everywhere-set-frame-position ()</span>
  <span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">)</span>

  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">The modeline is not useful to me in the popup window. It looks much nicer</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">to hide it.</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">remove-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">emacs-everywhere-init-hooks</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">hide-mode-line-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">remove-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">emacs-everywhere-init-hooks</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">emacs-everywhere-set-frame-position</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org6fd1971" class="outline-3">
          <h3 id="org6fd1971">
            <span class="section-number-3">3.10.</span> Eros-eval
          </h3>
          <div class="outline-text-3" id="text-3-10">
            <p>
              This makes the result of evals with <code>gr</code> and
              <code>gR</code> just slightly prettier. Every bit counts right?
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">eros-eval-result-prefix</span> <span style="color: #b5bd68;">"&#10233; "</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
