config/doom/config.html
        <div id="outline-container-orgf68f359" class="outline-3">
          <h3 id="orgf68f359">
            <span class="section-number-3">3.11.</span> EVIL
          </h3>
          <div class="outline-text-3" id="text-3-11">
            <p>
              When I want to make a substitution, I want it to be global more
              often than not &#x2014; so let&rsquo;s make that the default.
            </p>

            <p>
              Now, EVIL cares a fair bit about keeping compatibility with
              Vim&rsquo;s default behaviour. I don&rsquo;t. There are some
              particular settings that I&rsquo;d rather be something else, so
              let&rsquo;s change them.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> evil
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">evil-ex-substitute-global</span> t     <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">I like my s/../.. to by global by default</span>
        <span style="color: #cc6666;">evil-move-cursor-back</span> nil       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Don't move the block cursor when toggling insert mode</span>
        <span style="color: #cc6666;">evil-kill-on-visual-paste</span> nil<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">Don't put overwritten text in the kill ring</span>
</pre>
            </div>

            <p>
              I don&rsquo;t use <code>evil-escape-mode</code>, so I may as well
              turn it off, I&rsquo;ve heard it contributes a typing delay.
              I&rsquo;m not sure it&rsquo;s much, but it is an extra
              <code>pre-command-hook</code> that I don&rsquo;t benefit from,
              so&#x2026; It seems that there&rsquo;s a dedicated package for
              this, so instead of just disabling the mode on startup,
              let&rsquo;s prevent installation of the package.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> evil-escape <span style="color: #81a2be;">:disable</span> t<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org8275cfa" class="outline-3">
          <h3 id="org8275cfa">
            <span class="section-number-3">3.12.</span> Gif-screencast
          </h3>
          <div class="outline-text-3" id="text-3-12">
            <p>We can lazy load this using the start/stop commands.</p>

            <p>
              I initially installed <code>scrot</code> for this, since it was
              the default capture program. However it raised
              <code>glib error: Saving to file ... failed</code> each time it
              was run. Google didn&rsquo;t reveal any easy fixed, so I switched
              to <a href="https://github.com/naelstrof/maim">maim</a>. We now
              need to pass it the window ID. This doesn&rsquo;t change
              throughout the lifetime of an emacs instance, so as long as a
              single window is used <code>xdotool getactivewindow</code> will
              give a satisfactory result.
            </p>

            <p>
              It seems that when new colours appear, that tends to make
              <code>gifsicle</code> introduce artefacts. To avoid this we
              pre-populate the colour map using the current doom theme.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> gif-screencast
  <span style="color: #81a2be;">:commands</span> gif-screencast-mode
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> gif-screencast-mode-map
        <span style="color: #81a2be;">:g</span> <span style="color: #b5bd68;">"&lt;f8&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">gif-screencast-toggle-pause</span>
        <span style="color: #81a2be;">:g</span> <span style="color: #b5bd68;">"&lt;f9&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">gif-screencast-stop</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> gif-screencast-program <span style="color: #b5bd68;">"maim"</span>
        gif-screencast-args <span style="color: #c5c8c6;">`</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"--quality"</span> <span style="color: #b5bd68;">"3"</span> <span style="color: #b5bd68;">"-i"</span> ,<span style="color: #b5bd68;">(</span><span style="color: #de935f;">string-trim-right</span>
                                                     <span style="color: #b294bb;">(</span><span style="color: #de935f;">shell-command-to-string</span>
                                                      <span style="color: #b5bd68;">"xdotool getactivewindow"</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
        gif-screencast-optimize-args <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"--batch"</span> <span style="color: #b5bd68;">"--optimize=3"</span> <span style="color: #b5bd68;">"--usecolormap=/tmp/doom-color-theme"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">gif-screencast-write-colormap</span> <span style="color: #de935f;">()</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">f-write-text</span>
     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">replace-regexp-in-string</span>
      <span style="color: #b5bd68;">"\n+"</span> <span style="color: #b5bd68;">"\n"</span>
      <span style="color: #b294bb;">(</span><span style="color: #de935f;">mapconcat</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #de935f;">(</span>c<span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">listp</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">cdr</span> c<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
                                 <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cadr</span> c<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span> <span style="color: #f0c674;">doom-themes--colors</span><span style="color: #f0c674;"> </span><span style="color: #f0c674;">"\n"</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">utf-8</span>
     <span style="color: #b5bd68;">"/tmp/doom-color-theme"</span> <span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span>gif-screencast-write-colormap<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">doom-load-theme-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">gif-screencast-write-colormap</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org9d24fff" class="outline-3">
          <h3 id="org9d24fff">
            <span class="section-number-3">3.13.</span> Google-translate
          </h3>
          <div class="outline-text-3" id="text-3-13">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> go-translate
  <span style="color: #81a2be;">:defer</span> t
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span>
   <span style="color: #cc6666;">gts-translate-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"en"</span> <span style="color: #b5bd68;">"ru"</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"ru"</span> <span style="color: #b5bd68;">"en"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #cc6666;">gts-buffer-follow-p</span> t
   <span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #de935f;">(</span><span style="color: #81a2be;">:leader</span>
    <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">:prefix-map</span> <span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"o g"</span> . <span style="color: #b5bd68;">"google"</span><span style="color: #b294bb;">)</span>
     <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Open google-translator"</span> <span style="color: #b5bd68;">"t"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">gts-do-translate</span><span style="color: #b5bd68;">)</span>
    <span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
