config/doom/config.org
** Imenu
#+begin_src emacs-lisp
(use-package! imenu-list
  :defer t
  :init
  (setq
   imenu-list-position 'right
   ;; just a tad lower than the default
   imenu-list-size 0.25
   ;; That modeline is plain ugly. Treemacs & neotree don't have a modeline either.
   imenu-list-mode-line-format nil
   ;; imenu-list-auto-resize t
   imenu-list-auto-resize nil
   )
  (map!
   (:leader
    :desc "Toggle imenu-list" "oi" #'imenu-list-smart-toggle)
   :map imenu-list-major-mode-map
   :g "r"   #'imenu-list-refresh
   :g [tab] #'hs-toggle-hiding
   :n "gr"  #'imenu-list-refresh))
#+end_src
** Info colours
#+begin_src emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)

(add-hook 'Info-mode-hook #'mixed-pitch-mode)
#+end_src
# ** Ivy
# I prefer search matching to be ordered; it's more precise
# #+begin_src emacs-lisp
# (after! ivy
#   (add-to-list 'ivy-re-builders-alist '(counsel-projectile-find-file . ivy--regex-plus))
#   (setq +ivy-buffer-preview t))
# #+end_src

# While in an ivy mini-buffer =C-o= shows a list of all possible actions one may take.
# By default this is ~#'ivy-read-action-by-key~ however a better interface to this
# is using Hydra.
# #+begin_src emacs-lisp
# (setq ivy-read-action-function #'ivy-hydra-read-action)
# #+end_src
** Leetcode
It's nice to have leetcode in emacs
#+begin_src emacs-lisp :tangle packages.el
;; (package! leetcode)
#+end_src
#+begin_src emacs-lisp
;; (use-package! leetcode
;;   :config
;;   (setq leetcode-save-solutions t
;;         leetcode-directory "~/code/practice/leetcode"
;;         leetcode-prefer-sql "sqlite3")
;;   )
#+end_src
** Kdeconnect
#+begin_src emacs-lisp
(use-package! kdeconnect
  :config
  (setq kdeconnect-devices "2580ec370a27fbb7"))
#+end_src
** Keycast
let's just make sure this is lazy-loaded appropriately.
#+begin_src emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast--update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast--update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    '(keycast-command :inherit doom-modeline-debug
      :height 0.9)
    '(keycast-key :inherit custom-modified
      :height 1.1
      :weight bold)))
#+end_src
** Org Chef
Loading after org seems a bit premature. Let's just load it when we try to use
it, either by command or in a capture template.
#+begin_src emacs-lisp
(use-package! org-chef
  :commands (org-chef-insert-recipe org-chef-get-recipe-from-url))
#+end_src
