config/doom/config.html
        <div id="outline-container-org0efe1ee" class="outline-3">
          <h3 id="org0efe1ee">
            <span class="section-number-3">3.14.</span> Imenu
          </h3>
          <div class="outline-text-3" id="text-3-14">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> imenu-list
  <span style="color: #81a2be;">:defer</span> t
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span>
   imenu-list-position <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">right</span>
   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">just a tad lower than the default</span>
   imenu-list-size <span style="color: #de935f; font-weight: bold;">0.25</span>
   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">That modeline is plain ugly. Treemacs &amp; neotree don't have a modeline either.</span>
   imenu-list-mode-line-format nil
   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">imenu-list-auto-resize t</span>
   imenu-list-auto-resize nil
   <span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #de935f;">(</span><span style="color: #81a2be;">:leader</span>
    <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Toggle imenu-list"</span> <span style="color: #b5bd68;">"oi"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">imenu-list-smart-toggle</span><span style="color: #de935f;">)</span>
   <span style="color: #81a2be;">:map</span> imenu-list-major-mode-map
   <span style="color: #81a2be;">:g</span> <span style="color: #b5bd68;">"r"</span>   <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">imenu-list-refresh</span>
   <span style="color: #81a2be;">:g</span> <span style="color: #de935f;">[</span>tab<span style="color: #de935f;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">hs-toggle-hiding</span>
   <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"gr"</span>  <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">imenu-list-refresh</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgbcd3aab" class="outline-3">
          <h3 id="orgbcd3aab">
            <span class="section-number-3">3.15.</span> Info colours
          </h3>
          <div class="outline-text-3" id="text-3-15">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> info-colors
  <span style="color: #81a2be;">:commands</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">info-colors-fontify-node</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">Info-selection-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">info-colors-fontify-node</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">Info-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">mixed-pitch-mode</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgd02df21" class="outline-3">
          <h3 id="orgd02df21">
            <span class="section-number-3">3.16.</span> Leetcode
          </h3>
          <div class="outline-text-3" id="text-3-16">
            <p>It&rsquo;s nice to have leetcode in emacs</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(package! leetcode)</span>
</pre>
            </div>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(use-package! leetcode</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:config</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">(setq leetcode-save-solutions t</span>
<span style="color: #5a5b5a;">;;         </span><span style="color: #5a5b5a;">leetcode-directory "~/code/practice/leetcode"</span>
<span style="color: #5a5b5a;">;;         </span><span style="color: #5a5b5a;">leetcode-prefer-sql "sqlite3")</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org78b408d" class="outline-3">
          <h3 id="org78b408d">
            <span class="section-number-3">3.17.</span> Kdeconnect
          </h3>
          <div class="outline-text-3" id="text-3-17">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> kdeconnect
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">kdeconnect-devices</span> <span style="color: #b5bd68;">"2580ec370a27fbb7"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org9a46a40" class="outline-3">
          <h3 id="org9a46a40">
            <span class="section-number-3">3.18.</span> Keycast
          </h3>
          <div class="outline-text-3" id="text-3-18">
            <p>let&rsquo;s just make sure this is lazy-loaded appropriately.</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> keycast
  <span style="color: #81a2be;">:commands</span> keycast-mode
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">define-minor-mode</span> <span style="color: #81a2be;">keycast-mode</span>
    <span style="color: #717171;">"Show current command and its key binding in the mode line."</span>
    <span style="color: #81a2be;">:global</span> t
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> keycast-mode
        <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">progn</span>
          <span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">pre-command-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">keycast--update</span> t<span style="color: #b294bb;">)</span>
          <span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">global-mode-string</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">""</span> mode-line-keycast <span style="color: #b5bd68;">" "</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">remove-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">pre-command-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">keycast--update</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">global-mode-string</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">remove</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">""</span> mode-line-keycast <span style="color: #b5bd68;">" "</span><span style="color: #81a2be;">)</span> <span style="color: #cc6666;">global-mode-string</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">custom-set-faces!</span>
    <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span>keycast-command <span style="color: #81a2be;">:inherit</span> doom-modeline-debug
                      <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">0.9</span><span style="color: #de935f;">)</span>
    <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span>keycast-key <span style="color: #81a2be;">:inherit</span> custom-modified
                  <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.1</span>
                  <span style="color: #81a2be;">:weight</span> bold<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgdb00831" class="outline-3">
          <h3 id="orgdb00831">
            <span class="section-number-3">3.19.</span> Org Chef
          </h3>
          <div class="outline-text-3" id="text-3-19">
            <p>
              Loading after org seems a bit premature. Let&rsquo;s just load it
              when we try to use it, either by command or in a capture template.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-chef
  <span style="color: #81a2be;">:commands</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">org-chef-insert-recipe</span> org-chef-get-recipe-from-url<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
