config/doom/config.org
** Reverse-im (Keyboard layouts)
#+begin_src emacs-lisp
;; Needed for `:after char-fold' to work
(use-package char-fold
  :custom
  (char-fold-symmetric t)
  (search-default-mode #'char-fold-to-regexp))

(use-package! reverse-im
  :ensure t
  :demand t
  :after char-fold ; but only after `char-fold' is loaded
  :bind
  ("M-T" . reverse-im-translate-word)
  :custom
  (reverse-im-avy-action-char nil)
  (reverse-im-input-methods '("russian-computer" "ukrainian-computer"))
  ;; That breaks avy
  ;; (reverse-im-read-char-advice-function #'reverse-im-read-char-exclude)
  (reverse-im-char-fold t)
  :config
  (reverse-im-mode t)
  )
#+end_src
** Which-key
Let's make this popup a bit faster
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.5) ;; I need the help, I really do
#+end_src

I also think that having =evil-= appear in so many popups is a bit too verbose, let's change that, and do a few other similar tweaks while we're at it.
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))
#+end_src
