config/doom/config.html
        <div id="outline-container-orgdbbe0c8" class="outline-3">
          <h3 id="orgdbbe0c8">
            <span class="section-number-3">3.20.</span> Reverse-im (Keyboard
            layouts)
          </h3>
          <div class="outline-text-3" id="text-3-20">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Needed for `:after char-fold' to work</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package</span> char-fold
  <span style="color: #81a2be;">:custom</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">char-fold-symmetric</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">search-default-mode</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">char-fold-to-regexp</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> reverse-im
  <span style="color: #81a2be;">:ensure</span> t
  <span style="color: #81a2be;">:demand</span> t
  <span style="color: #81a2be;">:after</span> char-fold <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">but only after `</span><span style="color: #de935f;">char-fold</span><span style="color: #5a5b5a;">' is loaded</span>
  <span style="color: #81a2be;">:bind</span>
  <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"M-T"</span> . reverse-im-translate-word<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:custom</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">reverse-im-avy-action-char</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">reverse-im-input-methods</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"russian-computer"</span> <span style="color: #b5bd68;">"ukrainian-computer"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">That breaks avy</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(reverse-im-read-char-advice-function #'reverse-im-read-char-exclude)</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">reverse-im-char-fold</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">reverse-im-mode</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org392c103" class="outline-3">
          <h3 id="org392c103">
            <span class="section-number-3">3.21.</span> Which-key
          </h3>
          <div class="outline-text-3" id="text-3-21">
            <p>Let&rsquo;s make this popup a bit faster</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">which-key-idle-delay</span> <span style="color: #de935f; font-weight: bold;">0.5</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">I need the help, I really do</span>
</pre>
            </div>

            <p>
              I also think that having <code>evil-</code> appear in so many
              popups is a bit too verbose, let&rsquo;s change that, and do a few
              other similar tweaks while we&rsquo;re at it.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">which-key-allow-multiple-replacements</span> t<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> which-key
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">pushnew!</span>
   <span style="color: #cc6666;">which-key-replacement-alist</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">""</span> . <span style="color: #b5bd68;">"\\`+?evil[-:]?</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(?:</span><span style="color: #b5bd68;">a-</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">?</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(</span><span style="color: #b5bd68;">.*</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">"</span><span style="color: #b5bd68;">)</span> . <span style="color: #b5bd68;">(</span>nil . <span style="color: #b5bd68;">"&#9666;\\1"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\`g s"</span> . <span style="color: #b5bd68;">"\\`evilem--?motion-</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(</span><span style="color: #b5bd68;">.*</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">"</span><span style="color: #b5bd68;">)</span> . <span style="color: #b5bd68;">(</span>nil . <span style="color: #b5bd68;">"&#9667;\\1"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
