config/doom/config.html
        <div id="outline-container-orgb59d72e" class="outline-3">
          <h3 id="orgb59d72e">
            <span class="section-number-3">3.22.</span> Writeroom
          </h3>
          <div class="outline-text-3" id="text-3-22">
            <blockquote>
              <p>From the <code>:ui zen</code> module.</p>
            </blockquote>

            <p>
              Then, when using Org it would be nice to make a number of other
              aesthetic tweaks. Namely:
            </p>
            <ul class="org-ul">
              <li>Use a serifed variable-pitch font</li>
              <li>Hiding headline leading stars</li>
              <li>Using fleurons as headline bullets</li>
              <li>Hiding line numbers</li>
              <li>Removing outline indentation</li>
              <li>Centring the text</li>
            </ul>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">+zen-serif-p</span> t
  <span style="color: #717171;">"Whether to use a serifed font with `</span><span style="color: #de935f;">mixed-pitch-mode</span><span style="color: #717171;">'."</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">+zen-org-starhide</span> t
  <span style="color: #717171;">"The value `</span><span style="color: #de935f;">org-modern-hide-stars</span><span style="color: #717171;">' is set to."</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> <span style="color: #cc6666;">writeroom-mode</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+zen-prose-org-h</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Reformat the current Org buffer appearance for prose."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">display-line-numbers</span> nil
            <span style="color: #cc6666;">visual-fill-column-width</span> <span style="color: #de935f; font-weight: bold;">60</span>
            <span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">featurep</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">org-modern</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">org-modern-star</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"&#128600;"</span> <span style="color: #b5bd68;">"&#128601;"</span> <span style="color: #b5bd68;">"&#128602;"</span> <span style="color: #b5bd68;">"&#128603;"</span><span style="color: #81a2be;">)</span>
                    <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">org-modern-star '("&#128592;" "&#128593;" "&#128594;" "&#128595;" "&#128596;" "&#128597;" "&#128598;" "&#128599;")</span>
                    <span style="color: #cc6666;">org-modern-hide-stars</span> <span style="color: #cc6666;">+zen-org-starhide</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #cc6666;">org-modern-mode</span> <span style="color: #de935f; font-weight: bold;">-1</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #cc6666;">org-modern-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span>
       +zen--original-org-indent-mode-p <span style="color: #cc6666;">org-indent-mode</span><span style="color: #b5bd68;">)</span>
      <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(org-indent-mode -1)</span>
      <span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+zen-nonprose-org-h</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Reverse the effect of `</span><span style="color: #de935f;">+zen-prose-org</span><span style="color: #717171;">'."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">bound-and-true-p</span> <span style="color: #cc6666;">org-modern-mode</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #cc6666;">org-modern-mode</span> <span style="color: #de935f; font-weight: bold;">-1</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #cc6666;">org-modern-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">when</span> +zen--original-org-indent-mode-p <span style="color: #b294bb;">(</span><span style="color: #cc6666;">org-indent-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">pushnew!</span> <span style="color: #cc6666;">writeroom--local-variables</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">display-line-numbers</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">visual-fill-column-width</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-adapt-indentation</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-modern-mode</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-modern-star</span>
            <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-modern-hide-stars</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">writeroom-mode-enable-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+zen-prose-org-h</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">writeroom-mode-disable-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+zen-nonprose-org-h</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-orga989f01" class="outline-3">
          <h3 id="orga989f01">
            <span class="section-number-3">3.23.</span> Wakatime
          </h3>
          <div class="outline-text-3" id="text-3-23">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> <span style="color: #cc6666;">wakatime-mode</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org3c7ee8e" class="outline-3">
          <h3 id="org3c7ee8e">
            <span class="section-number-3">3.24.</span> YASnippet
          </h3>
          <div class="outline-text-3" id="text-3-24">
            <p>Nested snippets are good, enable that.</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">yas-triggers-in-field</span> t<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgaa7e9fe" class="outline-3">
          <h3 id="orgaa7e9fe">
            <span class="section-number-3">3.25.</span> Fountain
          </h3>
          <div class="outline-text-3" id="text-3-25">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> fountain-mode<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> fountain-mode<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orga74b3bd" class="outline-3">
          <h3 id="orga74b3bd">
            <span class="section-number-3">3.26.</span> Open-With
          </h3>
          <div class="outline-text-3" id="text-3-26">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> crux<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> crux
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">global-set-key</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">kbd</span> <span style="color: #b5bd68;">"C-c o"</span><span style="color: #de935f;">)</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">crux-open-with</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
