config/doom/config.org
** Spray

Why not flash words on the screen. Why not --- hey, it could be fun.
#+begin_src emacs-lisp :tangle packages.el
(package! spray :pin "74d9dcfa2e8b38f96a43de9ab0eb13364300cb46")
#+end_src

It would be nice if Spray's default speed suited me better, and the keybindings
worked in evil mode. Let's do that and make the display slightly nicer while
we're at it.

#+begin_src emacs-lisp
(use-package! spray
  :commands spray-mode
  :config
  (setq spray-wpm 600
        spray-height 800)
  (defun spray-mode-hide-cursor ()
    "Hide or unhide the cursor as is appropriate."
    (if spray-mode
        (setq-local spray--last-evil-cursor-state evil-normal-state-cursor
                    evil-normal-state-cursor '(nil))
      (setq-local evil-normal-state-cursor spray--last-evil-cursor-state)))
  (add-hook 'spray-mode-hook #'spray-mode-hide-cursor)
  (map! :map spray-mode-map
        "<return>" #'spray-start/stop
        "f" #'spray-faster
        "s" #'spray-slower
        "t" #'spray-time
        "<right>" #'spray-forward-word
        "h" #'spray-forward-word
        "<left>" #'spray-backward-word
        "l" #'spray-backward-word
        "q" #'spray-quit))
#+end_src
** iscroll

Enable image scrolling

#+begin_src emacs-lisp
(use-package! iscroll
  :config
  (add-hook! 'org-mode-hook 'iscroll-mode)
  )
#+end_src
** Git blame
Visualize code authorship at a glance

#+begin_src emacs-lisp :tangle packages.el
(package! blamer :recipe (:host github :repo "artawower/blamer.el"))
#+end_src

#+begin_src emacs-lisp
(use-package! blamer
  :defer 20
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                   :background nil
                   :height 140
                   :italic t)))
  :init
  (map!
   (:leader
    :desc "Toggle authorship visualizer" "gT"
    (lambda () (interactive) (if  blamer-mode (blamer-mode 0) (blamer-mode 1)
                                  ))))
  :config
  (setq blamer-mode 0)
  ;;(global-blamer-mode 1)
  )
#+end_src
** Hydra
*** Pretty hydra
#+begin_src emacs-lisp
(use-package! pretty-hydra)
#+end_src
*** Hydra Posframe
#+begin_src emacs-lisp :tangle packages.el
(package! hydra-posframe :recipe (:host github :repo "Ladicle/hydra-posframe"))
#+end_src

#+begin_src emacs-lisp
(use-package! hydra-posframe
  :init
  ;; (setq hydra-posframe-poshandler 'posframe-poshandler-frame-bottom-center)
  (setq hydra-posframe-border-width 1)
  (setq hydra-posframe-parameters '((left-fringe . 10)(right-fringe . 10)))
  :config
  (when (display-graphic-p)
    (add-hook! 'after-init-hook 'hydra-posframe-enable)
    )
  )
#+end_src
*** Hydra's
