config/doom/config.html
        <div id="outline-container-org29fd4c8" class="outline-3">
          <h3 id="org29fd4c8">
            <span class="section-number-3">3.27.</span> Spray
          </h3>
          <div class="outline-text-3" id="text-3-27">
            <p>
              Why not flash words on the screen. Why not &#x2014; hey, it could
              be fun.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> spray <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"74d9dcfa2e8b..."</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              It would be nice if Spray&rsquo;s default speed suited me better,
              and the keybindings worked in evil mode. Let&rsquo;s do that and
              make the display slightly nicer while we&rsquo;re at it.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> spray
  <span style="color: #81a2be;">:commands</span> spray-mode
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> spray-wpm <span style="color: #de935f; font-weight: bold;">600</span>
        spray-height <span style="color: #de935f; font-weight: bold;">800</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">spray-mode-hide-cursor</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Hide or unhide the cursor as is appropriate."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> spray-mode
        <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq-local</span> spray--last-evil-cursor-state <span style="color: #cc6666;">evil-normal-state-cursor</span>
                    <span style="color: #cc6666;">evil-normal-state-cursor</span> <span style="color: #c5c8c6;">'</span><span style="color: #b294bb;">(</span>nil<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">evil-normal-state-cursor</span> spray--last-evil-cursor-state<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">spray-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-mode-hide-cursor</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> spray-mode-map
        <span style="color: #b5bd68;">"&lt;return&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-start/stop</span>
        <span style="color: #b5bd68;">"f"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-faster</span>
        <span style="color: #b5bd68;">"s"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-slower</span>
        <span style="color: #b5bd68;">"t"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-time</span>
        <span style="color: #b5bd68;">"&lt;right&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-forward-word</span>
        <span style="color: #b5bd68;">"h"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-forward-word</span>
        <span style="color: #b5bd68;">"&lt;left&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-backward-word</span>
        <span style="color: #b5bd68;">"l"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-backward-word</span>
        <span style="color: #b5bd68;">"q"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">spray-quit</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgea17a76" class="outline-3">
          <h3 id="orgea17a76">
            <span class="section-number-3">3.28.</span> iscroll
          </h3>
          <div class="outline-text-3" id="text-3-28">
            <p>Enable image scrolling</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> iscroll
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">iscroll-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org5bb02aa" class="outline-3">
          <h3 id="org5bb02aa">
            <span class="section-number-3">3.29.</span> Git blame
          </h3>
          <div class="outline-text-3" id="text-3-29">
            <p>Visualize code authorship at a glance</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> blamer <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"artawower/blamer.el"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> blamer
  <span style="color: #81a2be;">:defer</span> <span style="color: #de935f; font-weight: bold;">20</span>
  <span style="color: #81a2be;">:custom</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">blamer-idle-time</span> <span style="color: #de935f; font-weight: bold;">0.3</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">blamer-min-offset</span> <span style="color: #de935f; font-weight: bold;">70</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:custom-face</span>
  <span style="color: #81a2be;">(</span>blamer-face <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>t <span style="color: #81a2be;">:foreground</span> <span style="color: #b5bd68;">"#7a88cf"</span>
                   <span style="color: #81a2be;">:background</span> nil
                   <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">140</span>
                   <span style="color: #81a2be;">:italic</span> t<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #de935f;">(</span><span style="color: #81a2be;">:leader</span>
    <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Toggle authorship visualizer"</span> <span style="color: #b5bd68;">"gT"</span>
    <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #b294bb;">()</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #b294bb;">)</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">if</span>  <span style="color: #cc6666;">blamer-mode</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">blamer-mode</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">blamer-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span>
                                  <span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">blamer-mode</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;;</span><span style="color: #5a5b5a;">(global-blamer-mode 1)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org0598239" class="outline-3">
          <h3 id="org0598239">
            <span class="section-number-3">3.30.</span> Hydra
          </h3>
          <div class="outline-text-3" id="text-3-30"></div>
          <div id="outline-container-org8e9f10c" class="outline-4">
            <h4 id="org8e9f10c">
              <span class="section-number-4">3.30.1.</span> Hydra Posframe
            </h4>
            <div class="outline-text-4" id="text-3-30-1">
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> hydra-posframe <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"Ladicle/hydra-posframe"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> hydra-posframe
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">when</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">display-graphic-p</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">after-init-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">hydra-posframe-enable</span><span style="color: #de935f;">)</span>
    <span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
