config/doom/config.org
**** Windows
Let's add hydra for window controls

#+begin_src emacs-lisp
(map!
 (:leader
  :desc "Open hydra for windows controls" "w/"
  #'+hydra/window-nav/body
  )
 )
#+end_src


#+begin_src emacs-lisp
;; (defhydra hydra-window (:color blue :hint nil)
;;             "
;;                                                                        ╭─────────┐
;;      Move to      Size    Scroll        Split                    Do    │ Windows │
;;   ╭────────────────────────────────────────────────────────────────────┴─────────╯
;;         ^_k_^           ^_K_^       ^_p_^    ╭─┬─┐^ ^        ╭─┬─┐^ ^         ↺ [_u_] undo layout
;;         ^^↑^^           ^^↑^^       ^^↑^^    │ │ │_v_ertical ├─┼─┤_b_alance   ↻ [_r_] restore layout
;;     _h_ ←   → _l_   _H_ ←   → _L_   ^^ ^^    ╰─┴─╯^ ^        ╰─┴─╯^ ^         ✗ [_d_] close window
;;         ^^↓^^           ^^↓^^       ^^↓^^    ╭───┐^ ^        ╭───┐^ ^         ⇋ [_w_] cycle window
;;         ^_j_^           ^_J_^       ^_n_^    ├───┤_s_tack    │   │_z_oom
;;         ^^ ^^           ^^ ^^       ^^ ^^    ╰───╯^ ^        ╰───╯^ ^
;;   --------------------------------------------------------------------------------
;;             "
;;   ("<tab>" hydra-master/body "back")
;;   ("<ESC>" nil "quit")
;;   ("n" joe-scroll-other-window :color red)
;;   ("p" joe-scroll-other-window-down :color red)
;;   ("b" balance-windows)
;;   ("d" delete-window)
;;   ("H" enlarge-window-horizontally :color red)
;;   ("h" windmove-left :color red)
;;   ("J" shrink-window :color red)
;;   ("j" windmove-down :color red)
;;   ("K" enlarge-window :color red)
;;   ("k" windmove-up :color red)
;;   ("L" shrink-window-horizontally :color red)
;;   ("l" windmove-right :color red)
;;   ("r" winner-redo :color red)
;;   ("s" split-window-vertically :color red)
;;   ("u" winner-undo :color red)
;;   ("v" split-window-horizontally :color red)
;;   ("w" other-window)
;;   ("z" delete-other-windows)
;;   )
#+end_src

**** Text zoom
Let's add hydra for zoom control

#+begin_src emacs-lisp
(map!
 (:leader
  :desc "Open hydra for zoom controls" "wz"
  #'+hydra/text-zoom/body
  )
 )
#+end_src

**** File info

Simple hydra for displaying and copying file information.

#+begin_src emacs-lisp :tangle packages.el
(package! file-info)
#+end_src
#+begin_src emacs-lisp
(use-package! file-info
  :ensure t
  :config
  (setq hydra-posframe-show-params
        `(:poshandler posframe-poshandler-frame-center
          :internal-border-width 2
          :left-fringe 16
          :right-fringe 16
          )
        )
  :init
  (map!
   (:leader
    :desc "Show file info" "fi"
    #'file-info-show
    )
   )
  )
#+end_src
**** Math hydra

Hidra for quickly inserting math symbols

#+begin_src emacs-lisp :tangle packages.el
(package! math-hydras
  :recipe (
           :host github
           :repo "ashok-khanna/math-hydras"
           :files ("math-hydras.el")
           )
  )
#+end_src
#+begin_src emacs-lisp
(provide 'math-hydras)
(use-package! math-hydras)
#+end_src
**** Dired hydra
#+begin_src emacs-lisp
(defhydra hydra-dired (:hint nil :color pink)
  "
_+_ mkdir          _v_iew           _m_ark             _(_ details        _i_nsert-subdir    wdired
_C_opy             _O_ view other   _U_nmark all       _)_ omit-mode      _$_ hide-subdir    C-x C-q : edit
_D_elete           _o_pen other     _u_nmark           _l_ redisplay      _w_ kill-subdir    C-c C-c : commit
_R_ename           _M_ chmod        _t_oggle           _g_ revert buf     _e_ ediff          C-c ESC : abort
_Y_ rel symlink    _G_ chgrp        _E_xtension mark   _s_ort             _=_ pdiff
_S_ymlink          ^ ^              _F_ind marked      _._ toggle hydra   \\ flyspell
_r_sync            ^ ^              ^ ^                ^ ^                _?_ summary
_z_ compress-file  _A_ find regexp
_Z_ compress       _Q_ repl regexp

T - tag prefix
"
  ("\\" dired-do-ispell)
  ("(" dired-hide-details-mode)
  (")" dired-omit-mode)
  ("+" dired-create-directory)
  ("=" diredp-ediff)         ;; smart diff
  ("?" dired-summary)
  ("$" diredp-hide-subdir-nomove)
  ("A" dired-do-find-regexp)
  ("C" dired-do-copy)        ;; Copy all marked files
  ("D" dired-do-delete)
  ("E" dired-mark-extension)
  ("e" dired-ediff-files)
  ("F" dired-do-find-marked-files)
  ("G" dired-do-chgrp)
  ("g" revert-buffer)        ;; read all directories again (refresh)
  ("i" dired-maybe-insert-subdir)
  ("l" dired-do-redisplay)   ;; relist the marked or singel directory
  ("M" dired-do-chmod)
  ("m" dired-mark)
  ("O" dired-display-file)
  ("o" dired-find-file-other-window)
  ("Q" dired-do-find-regexp-and-replace)
  ("R" dired-do-rename)
  ("r" dired-do-rsynch)
  ("S" dired-do-symlink)
  ("s" dired-sort-toggle-or-edit)
  ("t" dired-toggle-marks)
  ("U" dired-unmark-all-marks)
  ("u" dired-unmark)
  ("v" dired-view-file)      ;; q to exit, s to search, = gets line #
  ("w" dired-kill-subdir)
  ("Y" dired-do-relsymlink)
  ("z" diredp-compress-this-file)
  ("Z" dired-do-compress)
  ("q" nil)
  ("<ESC>" nil)
  ("." nil :color blue))

(map! :map dired-mode-map
      :ng "?" #'hydra-dired/body
      )
#+end_src

** Terminal Here

It's convenient to open terminals for current dir
#+begin_src emacs-lisp :tangle packages.el
(package! terminal-here)
#+end_src

#+begin_src emacs-lisp
(use-package! terminal-here
  :custom
  (terminal-here-linux-terminal-command 'alacritty)
  :init
  (map!
   (:leader
    :desc "Open folder with terminal" "ft"
    #'terminal-here-launch
    )
   (
    :leader
    :desc "Open folder with terminal" "fT"
    #'terminal-here-project-launch)
   )
  )
#+end_src
** Spell-fu

More dictionaries

#+begin_src emacs-lisp
(add-hook
 'spell-fu-mode-hook
 (lambda ()
   (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "uk"))
   (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "ru"))
   (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "en-computers"))
   (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "en-science"))
   ))
#+end_src

** Xresources-themes

#+begin_src emacs-lisp :tangle packages.el
(package! xresources-theme)
#+end_src
#+begin_src emacs-lisp
(use-package! xresources-theme)
#+end_src

* Applications
