config/doom/config.html
        <div id="outline-container-org64d38a7" class="outline-3">
          <h3 id="org64d38a7">
            <span class="section-number-3">3.31.</span> Terminal Here
          </h3>
          <div class="outline-text-3" id="text-3-31">
            <p>It&rsquo;s convenient to open terminals for current dir</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> terminal-here<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> terminal-here
  <span style="color: #81a2be;">:custom</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">terminal-here-linux-terminal-command</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">alacritty</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #de935f;">(</span><span style="color: #81a2be;">:leader</span>
    <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Open folder with terminal"</span> <span style="color: #b5bd68;">"ft"</span>
    <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">terminal-here-launch</span>
    <span style="color: #de935f;">)</span>
   <span style="color: #de935f;">(</span>
    <span style="color: #81a2be;">:leader</span>
    <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Open folder with terminal"</span> <span style="color: #b5bd68;">"fT"</span>
    <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">terminal-here-project-launch</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org065d423" class="outline-3">
          <h3 id="org065d423">
            <span class="section-number-3">3.32.</span> Spell-fu
          </h3>
          <div class="outline-text-3" id="text-3-32">
            <p>More dictionaries</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span>
 <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">spell-fu-mode-hook</span>
 <span style="color: #81a2be;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #de935f;">()</span>
   <span style="color: #de935f;">(</span><span style="color: #de935f;">spell-fu-dictionary-add</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">spell-fu-get-ispell-dictionary</span> <span style="color: #b5bd68;">"uk"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #de935f;">(</span><span style="color: #de935f;">spell-fu-dictionary-add</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">spell-fu-get-ispell-dictionary</span> <span style="color: #b5bd68;">"ru"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>
