config/doom/config.html
      <div id="outline-container-org9a92f8b" class="outline-2">
        <h2 id="org9a92f8b">
          <span class="section-number-2">4.</span> Applications
        </h2>
        <div class="outline-text-2" id="text-4"></div>
        <div id="outline-container-org41fc923" class="outline-3">
          <h3 id="org41fc923">
            <span class="section-number-3">4.1.</span> Ebooks
          </h3>
          <div class="outline-text-3" id="text-4-1">
            <p>
              For managing my ebooks, I&rsquo;ll hook into the well-established
              ebook library manager
              <a href="https://calibre-ebook.com/">calibre</a>. A number of
              Emacs clients for this exist, but this seems like a good option.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> calibredb <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"2f2cfc38f2d1..."</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              Then for reading them, the only currently viable options seems to
              be <a href="https://depp.brause.cc/nov.el/">nov.el</a>.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> nov <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"8f5b42e9d9f3..."</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              Together these should give me a rather good experience reading
              ebooks.
            </p>

            <p>
              <code>calibredb</code> lets us use calibre through Emacs, because
              who wouldn&rsquo;t want to use something through Emacs?
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> calibredb
  <span style="color: #81a2be;">:commands</span> calibredb
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> calibredb-root-dir <span style="color: #b5bd68;">"~/Documents/books"</span>
        calibredb-db-dir <span style="color: #de935f;">(</span><span style="color: #de935f;">expand-file-name</span> <span style="color: #b5bd68;">"metadata.db"</span> calibredb-root-dir<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> calibredb-show-mode-map
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"?"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-entry-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"o"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-find-file</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"O"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-find-file-other-frame</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"V"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-open-file-with-default-tool</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"s"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"e"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-export-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"q"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-entry-quit</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"."</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-open-dired</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #de935f;">[</span>tab<span style="color: #de935f;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-view-at-point</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-t"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--tags</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-a"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--author_sort</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-A"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--authors</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-T"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--title</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-c"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--comments</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> calibredb-search-mode-map
        <span style="color: #81a2be;">:ne</span> <span style="color: #de935f;">[</span>mouse-3<span style="color: #de935f;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-search-mouse</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"RET"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-find-file</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"?"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"a"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-add</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"A"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-add-dir</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"c"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-clone</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"d"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-remove</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"D"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-remove-marked-items</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"j"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-next-entry</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"k"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-previous-entry</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"l"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-virtual-library-list</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"L"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-library-list</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"n"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-virtual-library-next</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"N"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-library-next</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"p"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-virtual-library-previous</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"P"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-library-previous</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"s"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"S"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-switch-library</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"o"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-find-file</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"O"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-find-file-other-frame</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"v"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-view</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"V"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-open-file-with-default-tool</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"."</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-open-dired</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"b"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-catalog-bib-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"e"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-export-dispatch</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"r"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-search-refresh-and-clear-filter</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"R"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-search-clear-filter</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"q"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-search-quit</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"m"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-mark-and-forward</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"f"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-favorite-at-point</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"x"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-archive-at-point</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"h"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-highlight-at-point</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"u"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-unmark-and-forward</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"i"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-edit-annotation</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"DEL"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-unmark-and-backward</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #de935f;">[</span>backtab<span style="color: #de935f;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-view</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #de935f;">[</span>tab<span style="color: #de935f;">]</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-toggle-view-at-point</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-n"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-show-next-entry</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-p"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-show-previous-entry</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"/"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-search-live-filter</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-t"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--tags</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-a"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--author_sort</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-A"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--authors</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-T"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--title</span>
        <span style="color: #81a2be;">:ne</span> <span style="color: #b5bd68;">"M-c"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">calibredb-set-metadata--comments</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Then, to actually read the ebooks we use <code>nov</code>.</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> nov
  <span style="color: #81a2be;">:mode</span> <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"\\.epub\\'"</span> . nov-mode<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> nov-mode-map
        <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"RET"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">nov-scroll-up</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">doom-modeline-segment--nov-info</span> <span style="color: #de935f;">()</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span>
     <span style="color: #b5bd68;">" "</span>
     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">propertize</span>
      <span style="color: #b294bb;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">assoc</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">creator</span> nov-metadata<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">doom-modeline-project-parent-dir</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">" "</span>
     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">assoc</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">title</span> nov-metadata<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">" "</span>
     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">propertize</span>
      <span style="color: #b294bb;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"%d/%d"</span>
              <span style="color: #81a2be;">(</span><span style="color: #de935f;">1+</span> nov-documents-index<span style="color: #81a2be;">)</span>
              <span style="color: #81a2be;">(</span><span style="color: #de935f;">length</span> nov-documents<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">doom-modeline-info</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #de935f;">advice-add</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">nov-render-title</span> <span style="color: #81a2be;">:override</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">ignore</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+nov-mode-setup</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Tweak nov-mode to our liking."</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">face-remap-add-relative</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">variable-pitch</span>
                             <span style="color: #81a2be;">:family</span> <span style="color: #b5bd68;">"Merriweather"</span>
                             <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.4</span>
                             <span style="color: #81a2be;">:width</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">semi-expanded</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">face-remap-add-relative</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">default</span> <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.3</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">line-spacing</span> <span style="color: #de935f; font-weight: bold;">0.2</span>
                <span style="color: #cc6666;">next-screen-context-lines</span> <span style="color: #de935f; font-weight: bold;">4</span>
                <span style="color: #cc6666;">shr-use-colors</span> nil<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">require</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">visual-fill-column</span> nil t<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">visual-fill-column-center-text</span> t
                <span style="color: #cc6666;">visual-fill-column-width</span> <span style="color: #de935f; font-weight: bold;">81</span>
                nov-text-width <span style="color: #de935f; font-weight: bold;">80</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #cc6666;">visual-fill-column-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #cc6666;">hl-line-mode</span> <span style="color: #de935f; font-weight: bold;">-1</span><span style="color: #de935f;">)</span>
    <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Re-render with new display settings</span>
    <span style="color: #de935f;">(</span>nov-render-document<span style="color: #de935f;">)</span>
    <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Look up words with the dictionary.</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">+lookup-definition-functions</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+lookup/dictionary-definition</span><span style="color: #de935f;">)</span>
    <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Customise the mode-line to make it more minimal and relevant.</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq-local</span>
     <span style="color: #cc6666;">mode-line-format</span>
     <span style="color: #c5c8c6;">`</span><span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #81a2be;">:eval</span>
        <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline-segment--workspace-name</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
       <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:eval</span>
        <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline-segment--window-number</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
       <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:eval</span>
        <span style="color: #81a2be;">(</span>doom-modeline-segment--nov-info<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
       ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">propertize</span>
         <span style="color: #b5bd68;">" %P "</span>
         <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">doom-modeline-buffer-minor-mode</span><span style="color: #b294bb;">)</span>
       ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">propertize</span>
         <span style="color: #b5bd68;">" "</span>
         <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">doom-modeline--active</span><span style="color: #de935f;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mode-line</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mode-line-inactive</span><span style="color: #81a2be;">)</span>
         <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">display</span> <span style="color: #c5c8c6;">`</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span>space
                     <span style="color: #81a2be;">:align-to</span>
                     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">-</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">+</span> right right-fringe right-margin<span style="color: #b294bb;">)</span>
                        ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">*</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>width <span style="color: #b294bb;">(</span><span style="color: #de935f;">doom-modeline--font-width</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
                              <span style="color: #de935f;">(</span><span style="color: #b294bb;">or</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">and</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">=</span> width <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b5bd68;">)</span>
                                  <span style="color: #b5bd68;">(</span><span style="color: #de935f;">/</span> width <span style="color: #b294bb;">(</span><span style="color: #de935f;">frame-char-width</span><span style="color: #b294bb;">)</span> <span style="color: #de935f; font-weight: bold;">1.0</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                            <span style="color: #81a2be;">(</span><span style="color: #de935f;">string-width</span>
                             <span style="color: #de935f;">(</span><span style="color: #de935f;">format-mode-line</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cons</span> <span style="color: #b5bd68;">""</span> <span style="color: #c5c8c6;">'</span><span style="color: #b294bb;">(</span><span style="color: #81a2be;">:eval</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline-segment--major-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
       <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:eval</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">doom-modeline-segment--major-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">nov-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+nov-mode-setup</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
