config/doom/config.org
** File types
*** Systemd

For editing systemd unit files
#+begin_src emacs-lisp :tangle packages.el
(package! systemd :pin "b6ae63a236605b1c5e1069f7d3afe06ae32a7bae")
#+end_src

#+begin_src emacs-lisp
(use-package! systemd
  :defer t)
#+end_src
** Obsidian

It's nice to have some integration with obsidian in emacs

#+begin_src emacs-lisp :tangle packages.el
(package! obsidian)
#+end_src

#+begin_src emacs-lisp
(use-package obsidian
  :ensure t
  :demand t
  :config
  (obsidian-specify-path "~/Knowledge base")
  (global-obsidian-mode t)
  :bind (:map obsidian-mode-map
              ;; Replace C-c C-o with Obsidian.el's implementation. It's ok to use another key binding.
              ("C-c C-o" . obsidian-follow-link-at-point)
              ;; Jump to backlinks
              ("C-c C-b" . obsidian-backlink-jump)
              ;; If you prefer you can use `obsidian-insert-link'
              ("C-c C-l" . obsidian-insert-wikilink)))
#+end_src

* Language configuration
** Haskell
Set formatter
#+begin_src emacs-lisp
(after! lsp-haskell
  (setq lsp-haskell-formatting-provider "fourmolu"))
#+end_src

** Rust
Disable lsp formatter
#+begin_src emacs-lisp
(setq-hook! 'rustic-mode-hook +format-with-lsp nil)
#+end_src
** Js
Prefer prettier formatter.
#+begin_src emacs-lisp
(setq-hook! 'js2-mode-hook +format-with-lsp nil)
(setq-hook! 'typescript-mode-hook +format-with-lsp nil)
(setq-hook! 'typescript-tsx-mode-hook +format-with-lsp nil)
#+end_src

Show eslint help
#+begin_src emacs-lisp
(after! (:and lsp-mode flycheck-mode)
  (flycheck-add-next-checker 'lsp 'javascript-eslint))
#+end_src
** LaTeX
#+begin_src emacs-lisp
(setq TeX-save-query nil
      TeX-show-compilation t
      TeX-command-extra-options "-shell-escape")
(after! latex
  (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t)))
#+end_src

Let's re-order the preferences.
#+begin_src emacs-lisp
(setq +latex-viewers '(zathura pdf-tools evince okular skim sumatrapdf))
#+end_src
