config/doom/config.html
        <div id="outline-container-orgf8870a4" class="outline-3">
          <h3 id="orgf8870a4">
            <span class="section-number-3">4.2.</span> File types
          </h3>
          <div class="outline-text-3" id="text-4-2"></div>
          <div id="outline-container-orgf9df63d" class="outline-4">
            <h4 id="orgf9df63d">
              <span class="section-number-4">4.2.1.</span> Systemd
            </h4>
            <div class="outline-text-4" id="text-4-2-1">
              <p>For editing systemd unit files</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> systemd <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"b6ae63a23660..."</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> systemd
  <span style="color: #81a2be;">:defer</span> t<span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
        <div id="outline-container-org7fd4f72" class="outline-3">
          <h3 id="org7fd4f72">
            <span class="section-number-3">4.3.</span> Obsidian
          </h3>
          <div class="outline-text-3" id="text-4-3">
            <p>
              It&rsquo;s nice to have some integration with obsidian in emacs
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> obsidian<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package</span> obsidian
  <span style="color: #81a2be;">:ensure</span> t
  <span style="color: #81a2be;">:demand</span> t
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">obsidian-specify-path</span> <span style="color: #b5bd68;">"~/Knowledge base"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">global-obsidian-mode</span> t<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:bind</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">obsidian-mode-map</span>
              <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Replace C-c C-o with Obsidian.el's implementation. It's ok to use another key binding.</span>
              <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"C-c C-o"</span> . obsidian-follow-link-at-point<span style="color: #de935f;">)</span>
              <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Jump to backlinks</span>
              <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"C-c C-b"</span> . obsidian-backlink-jump<span style="color: #de935f;">)</span>
              <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">If you prefer you can use `</span><span style="color: #de935f;">obsidian-insert-link</span><span style="color: #5a5b5a;">'</span>
              <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"C-c C-l"</span> . obsidian-insert-wikilink<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>

      <div id="outline-container-org595fa3e" class="outline-2">
        <h2 id="org595fa3e">
          <span class="section-number-2">5.</span> Language configuration
        </h2>
        <div class="outline-text-2" id="text-5"></div>
        <div id="outline-container-orgd58f8ac" class="outline-3">
          <h3 id="orgd58f8ac">
            <span class="section-number-3">5.1.</span> Haskell
          </h3>
          <div class="outline-text-3" id="text-5-1">
            <p>Set formatter</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> lsp-haskell
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">lsp-haskell-formatting-provider</span> <span style="color: #b5bd68;">"fourmolu"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org6750ad6" class="outline-3">
          <h3 id="org6750ad6">
            <span class="section-number-3">5.2.</span> Rust
          </h3>
          <div class="outline-text-3" id="text-5-2">
            <p>Disable lsp formatter</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">rustic-mode-hook</span> <span style="color: #cc6666;">+format-with-lsp</span> nil<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org85d6c2a" class="outline-3">
          <h3 id="org85d6c2a"><span class="section-number-3">5.3.</span> Js</h3>
          <div class="outline-text-3" id="text-5-3">
            <p>Prefer prettier formatter.</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">js2-mode-hook</span> <span style="color: #cc6666;">+format-with-lsp</span> nil<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">typescript-mode-hook</span> <span style="color: #cc6666;">+format-with-lsp</span> nil<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">typescript-tsx-mode-hook</span> <span style="color: #cc6666;">+format-with-lsp</span> nil<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Show eslint help</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:and</span> <span style="color: #cc6666;">lsp-mode</span> <span style="color: #cc6666;">flycheck-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">flycheck-add-next-checker</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">lsp</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">javascript-eslint</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org44a35fb" class="outline-3">
          <h3 id="org44a35fb">
            <span class="section-number-3">5.4.</span> LaTeX
          </h3>
          <div class="outline-text-3" id="text-5-4">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">TeX-save-query</span> nil
      <span style="color: #cc6666;">TeX-show-compilation</span> t
      <span style="color: #cc6666;">TeX-command-extra-options</span> <span style="color: #b5bd68;">"-shell-escape"</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> latex
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">TeX-command-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"XeLaTeX"</span> <span style="color: #b5bd68;">"%`xelatex%(mode)%' %t"</span> TeX-run-TeX nil t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Let&rsquo;s re-order the preferences.</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">+latex-viewers</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>zathura pdf-tools evince okular skim sumatrapdf<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
