config/doom/config.html
        <div id="outline-container-orgf749833" class="outline-3">
          <h3 id="orgf749833">
            <span class="section-number-3">5.5.</span> Markdown
          </h3>
          <div class="outline-text-3" id="text-5-5">
            <p>Let&rsquo;s use mixed pitch, because it&rsquo;s great</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">gfm-mode</span> markdown-mode<span style="color: #81a2be;">)</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">mixed-pitch-mode</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              Most of the time when I write markdown, it&rsquo;s going into some
              app/website which will do it&rsquo;s own line wrapping, hence we
              <i>only</i> want to use visual line wrapping. No hard stuff.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">gfm-mode</span> markdown-mode<span style="color: #81a2be;">)</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">visual-line-mode</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">turn-off-auto-fill</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>
              Since markdown is often seen as rendered HTML, let&rsquo;s try to
              somewhat mirror the style or markdown renderers.
            </p>

            <p>
              Most markdown renders seem to make the first three headings levels
              larger than normal text, the first two much so. Then the fourth
              level tends to be the same as body text, while the fifth and sixth
              are (increasingly) smaller, with the sixth greyed out. Since the
              sixth level is so small, I&rsquo;ll turn up the boldness a notch.
            </p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">custom-set-faces!</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-1 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.25</span> <span style="color: #81a2be;">:weight</span> extra-bold <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-2 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.15</span> <span style="color: #81a2be;">:weight</span> bold       <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-3 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.08</span> <span style="color: #81a2be;">:weight</span> bold       <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-4 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.00</span> <span style="color: #81a2be;">:weight</span> bold       <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-5 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">0.90</span> <span style="color: #81a2be;">:weight</span> bold       <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown-header-face-6 <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">0.75</span> <span style="color: #81a2be;">:weight</span> extra-bold <span style="color: #81a2be;">:inherit</span> markdown-header-face<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orge85eeb8" class="outline-3">
          <h3 id="orge85eeb8">
            <span class="section-number-3">5.6.</span> Nix
          </h3>
          <div class="outline-text-3" id="text-5-6">
            <p>Turn off company for nix</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">nix-mode-hook</span> <span style="color: #cc6666;">company-idle-delay</span> nil<span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Use alejandra formatter</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #81a2be;">set-formatter!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">alejandra</span> <span style="color: #b5bd68;">"alejandra --quiet"</span> <span style="color: #81a2be;">:modes</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>nix-mode<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org" class="outline-3">
          <h3 id="org"><span class="section-number-3">5.7.</span> Org</h3>
          <div class="outline-text-3" id="text-org">
            <p>
              Finally, because this section is fairly expensive to initialise,
              we&rsquo;ll wrap it in an
              <code class="src src-elisp"
                ><span style="color: #b294bb">(</span
                ><span style="color: #b294bb">after!</span> ...<span
                  style="color: #b294bb"
                  >)</span
                ></code
              >
              block.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> org
  &lt;&lt;org-conf&gt;&gt;<span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
