config/doom/config.html

          <div id="outline-container-org89b8cba" class="outline-4">
            <h4 id="org89b8cba">
              <span class="section-number-4">5.7.1.</span> Behavior
            </h4>
            <div class="outline-text-4" id="text-5-7-1"></div>
            <div id="outline-container-orga6fc366" class="outline-5">
              <h5 id="orga6fc366">
                <span class="section-number-5">5.7.1.1.</span> Tweaking defaults
              </h5>
              <div class="outline-text-5" id="text-5-7-1-1">
                <p>Some simple settings</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-directory</span> <span style="color: #b5bd68;">"~/org/"</span>
      <span style="color: #cc6666;">org-archive-location</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #cc6666;">org-directory</span> <span style="color: #b5bd68;">".archive/%s::"</span><span style="color: #81a2be;">)</span>
      <span style="color: #cc6666;">org-roam-directory</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #cc6666;">org-directory</span> <span style="color: #b5bd68;">"notes/"</span><span style="color: #81a2be;">)</span>
      <span style="color: #cc6666;">org-journal-encrypt-journal</span> t
      <span style="color: #cc6666;">org-journal-file-format</span> <span style="color: #b5bd68;">"%Y%m%d.org"</span>
      <span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">add-hook!</span> org-mode <span style="color: #81a2be;">:append</span>
           <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">org-fragtog-mode</span>
           <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">variable-pitch-mode</span>
           <span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span>
 <span style="color: #cc6666;">org-use-property-inheritance</span> t              <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">it's convenient to have properties inherited</span>
 <span style="color: #cc6666;">org-log-done</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">time</span>                          <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">having the time a item is done sounds convininet</span>
 <span style="color: #cc6666;">org-list-allow-alphabetical</span> t               <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">have a. A. a) A) list bullets</span>
 <span style="color: #cc6666;">org-export-in-background</span> t                  <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">run export processes in external emacs process</span>
 <span style="color: #cc6666;">org-catch-invisible-edits</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">smart</span>            <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">try not to accidently do weird stuff in invisible regions</span>
 <span style="color: #cc6666;">org-export-with-sub-superscripts</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">{}</span>       <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">don't treat lone _ / ^ as sub/superscripts, require _{} / ^{}</span>
 <span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  I also like the <code>:comments</code> header-argument, so
                  let&rsquo;s make that a default.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-babel-default-header-args</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #81a2be;">:session</span> . <span style="color: #b5bd68;">"none"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:results</span> . <span style="color: #b5bd68;">"replace"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:exports</span> . <span style="color: #b5bd68;">"code"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:cache</span> . <span style="color: #b5bd68;">"no"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:noweb</span> . <span style="color: #b5bd68;">"no"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:hlines</span> . <span style="color: #b5bd68;">"no"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:tangle</span> . <span style="color: #b5bd68;">"no"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #81a2be;">:comments</span> . <span style="color: #b5bd68;">"link"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  There also seem to be a few keybindings which use
                  <code>hjkl</code>, but miss arrow key equivalents.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">evil-org-mode-map</span>
      <span style="color: #81a2be;">:after</span> evil-org
      <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"g &lt;up&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-backward-heading-same-level</span>
      <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"g &lt;down&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-forward-heading-same-level</span>
      <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"g &lt;left&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-up-element</span>
      <span style="color: #81a2be;">:n</span> <span style="color: #b5bd68;">"g &lt;right&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-down-element</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-org14cbf23" class="outline-5">
              <h5 id="org14cbf23">
                <span class="section-number-5">5.7.1.2.</span> Latex snippets
              </h5>
              <div class="outline-text-5" id="text-5-7-1-2">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span>
          <span style="color: #81a2be;">(</span><span style="color: #b294bb;">&#955;!</span> <span style="color: #de935f;">(</span><span style="color: #cc6666;">yas-minor-mode</span><span style="color: #de935f;">)</span>
              <span style="color: #de935f;">(</span><span style="color: #de935f;">yas-activate-extra-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">latex-mode</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>

            <div id="outline-container-org1987fff" class="outline-5">
              <h5 id="org1987fff">
                <span class="section-number-5">5.7.1.3.</span> Extra
                functionality
              </h5>
              <div class="outline-text-5" id="text-5-7-1-3"></div>
              <div id="outline-container-org10a4c54" class="outline-6">
                <h6 id="org10a4c54">
                  <span class="section-number-6">5.7.1.3.1.</span> Org buffer
                  creation
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-1">
                  <p>
                    Let&rsquo;s also make creating an org buffer just that
                    little bit easier.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">evil-define-command</span> <span style="color: #81a2be;">evil-buffer-org-new</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">count</span> file<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Creates a new ORG buffer replacing the current window, optionally</span>
<span style="color: #717171;">   editing a certain FILE"</span>
  <span style="color: #81a2be;">:repeat</span> nil
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span> <span style="color: #b5bd68;">"P&lt;f&gt;"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> file
      <span style="color: #de935f;">(</span><span style="color: #de935f;">evil-edit</span> file<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>buffer <span style="color: #81a2be;">(</span><span style="color: #de935f;">generate-new-buffer</span> <span style="color: #b5bd68;">"*new org*"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">set-window-buffer</span> nil buffer<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-current-buffer</span> buffer
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-mode</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:leader</span>
      <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:prefix</span> <span style="color: #b5bd68;">"b"</span>
       <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"New empty ORG buffer"</span> <span style="color: #b5bd68;">"o"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">evil-buffer-org-new</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
