config/doom/config.html
              <div id="outline-container-org094600f" class="outline-6">
                <h6 id="org094600f">
                  <span class="section-number-6">5.7.1.3.2.</span> The utility
                  of zero-width spaces
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-2">
                  <p>
                    Occasionally in Org you run into annoyances where you want
                    to have two seperate blocks right together without a space.
                    For example, to <b>emph</b>asise part of a word, or put a
                    currency symbol immediately before an inline source block.
                    There is a solution to this, it just sounds slightly hacky
                    &#x2014; zero width spaces. Because this is Emacs, we can
                    make this feel much less hacky by making a minor addition to
                    the Org key map .
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">org-mode-map</span>
      <span style="color: #81a2be;">:nie</span> <span style="color: #b5bd68;">"M-SPC M-SPC"</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">cmd!</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">insert</span> <span style="color: #b5bd68;">"\u200B"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    We then want to stop the space from being included in
                    exports, which can be done with a little filter.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+org-export-remove-zero-width-space</span> <span style="color: #81a2be;">(</span>text _backend _info<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Remove zero width spaces from TEXT."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">org-export-derived-backend-p</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">replace-regexp-in-string</span> <span style="color: #b5bd68;">"\u200B"</span> <span style="color: #b5bd68;">""</span> text<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-export-filter-plain-text-functions</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+org-export-remove-zero-width-space</span> t<span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
              <div id="outline-container-orgc278a83" class="outline-6">
                <h6 id="orgc278a83">
                  <span class="section-number-6">5.7.1.3.3.</span> List bullet
                  sequence
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-3">
                  <p>
                    I think it makes sense to have list bullets change with
                    depth
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-list-demote-modify-bullet</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"+"</span> . <span style="color: #b5bd68;">"-"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"-"</span> . <span style="color: #b5bd68;">"+"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"*"</span> . <span style="color: #b5bd68;">"+"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"1."</span> . <span style="color: #b5bd68;">"a."</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
              <div id="outline-container-orgdd84e9d" class="outline-6">
                <h6 id="orgdd84e9d">
                  <span class="section-number-6">5.7.1.3.4.</span> cdlatex
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-4">
                  <p>
                    It&rsquo;s also nice to be able to use <code>cdlatex</code>.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">turn-on-org-cdlatex</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    It&rsquo;s handy to be able to quickly insert environments
                    with <code>C-c }</code>. I almost always want to edit them
                    afterwards though, so let&rsquo;s make that happen by
                    default.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> org-edit-latex-emv-after-insert <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-cdlatex-environment-indent</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-edit-latex-environment</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    At some point in the future it could be good to investigate
                    <a
                      href="https://scripter.co/splitting-an-org-block-into-two/"
                      >splitting org blocks</a
                    >. Likewise
                    <a
                      href="https://archive.casouri.cat/note/2020/insert-math-symbol-in-emacs/"
                      >this</a
                    >
                    looks good for symbols.
                  </p>
                </div>
              </div>
