config/doom/config.html
              <div id="outline-container-org6026632" class="outline-6">
                <h6 id="org6026632">
                  <span class="section-number-6">5.7.1.3.5.</span> View exported
                  file
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-5">
                  <p>
                    <code>'localeader v</code> has no pre-existing binding, so I
                    may as well use it with the same functionality as in LaTeX.
                    Let&rsquo;s try viewing possible output files with this.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">org-mode-map</span>
      <span style="color: #81a2be;">:localleader</span>
      <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"View exported file"</span> <span style="color: #b5bd68;">"v"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-view-output-file</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-view-output-file</span> <span style="color: #81a2be;">(</span><span style="color: #f0c674;">&amp;optional</span> org-file-path<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Visit buffer open on the first output file (if any) found, using `</span><span style="color: #de935f;">org-view-output-file-extensions</span><span style="color: #717171;">'"</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>org-file-path <span style="color: #b294bb;">(</span><span style="color: #b294bb;">or</span> org-file-path <span style="color: #81a2be;">(</span><span style="color: #cc6666;">buffer-file-name</span><span style="color: #81a2be;">)</span> <span style="color: #b5bd68;">""</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>dir <span style="color: #b294bb;">(</span><span style="color: #de935f;">file-name-directory</span> org-file-path<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>basename <span style="color: #b294bb;">(</span><span style="color: #de935f;">file-name-base</span> org-file-path<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>output-file nil<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">dolist</span> <span style="color: #b5bd68;">(</span>ext <span style="color: #cc6666;">org-view-output-file-extensions</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">unless</span> output-file
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">file-exists-p</span>
               <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span> dir basename <span style="color: #b5bd68;">"."</span> ext<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> output-file <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span> dir basename <span style="color: #b5bd68;">"."</span> ext<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> output-file
        <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">member</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">file-name-extension</span> output-file<span style="color: #81a2be;">)</span> <span style="color: #cc6666;">org-view-external-file-extensions</span><span style="color: #b294bb;">)</span>
            <span style="color: #b294bb;">(</span><span style="color: #de935f;">browse-url-xdg-open</span> output-file<span style="color: #b294bb;">)</span>
          <span style="color: #b294bb;">(</span><span style="color: #de935f;">pop-to-buffer</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">or</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">find-buffer-visiting</span> output-file<span style="color: #de935f;">)</span>
                             <span style="color: #de935f;">(</span><span style="color: #de935f;">find-file-noselect</span> output-file<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">message</span> <span style="color: #b5bd68;">"No exported file found"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-view-output-file-extensions</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"pdf"</span> <span style="color: #b5bd68;">"md"</span> <span style="color: #b5bd68;">"rst"</span> <span style="color: #b5bd68;">"txt"</span> <span style="color: #b5bd68;">"tex"</span> <span style="color: #b5bd68;">"html"</span><span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Search for output files with these extensions, in order, viewing the first that matches"</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-view-external-file-extensions</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"html"</span><span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"File formats that should be opened externally."</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
