config/doom/config.html
              <div id="outline-container-org1ef68ca" class="outline-6">
                <h6 id="org1ef68ca">
                  <span class="section-number-6">5.7.1.3.6.</span> Citation
                </h6>
                <div class="outline-text-6" id="text-5-7-1-3-6">
                  <blockquote>
                    <p>Extending the <code>:tools biblio</code> module.</p>
                  </blockquote>

                  <p>
                    References in Org are fairly easy now, thanks to
                    <code>org-cite</code>. The <code>:tools biblio</code>
                    module gives a fairly decent basic setup, but it would be
                    nice to take it a bit further. This mostly consists of
                    tweaking settings, but there is one extra package I&rsquo;ll
                    grab for prettier in-buffer citations.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> org-cite-csl-activate <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:host</span> github <span style="color: #81a2be;">:repo</span> <span style="color: #b5bd68;">"andras-simonyi/org-cite-csl-activate"</span><span style="color: #81a2be;">)</span> <span style="color: #81a2be;">:pin</span> <span style="color: #b5bd68;">"9e68d9204469..."</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    In particular, by setting
                    <code>org-cite-csl-activate-use-document-style</code>, we
                    can have the in-buffer displayed citations be the same as
                    the exported form. Isn&rsquo;t that lovely!
                  </p>

                  <p>
                    Unfortunately, there&rsquo;s currently a potential for
                    undesirable buffer modifications, so we&rsquo;ll put all the
                    activation code behind a function we can call when we want
                    it.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> oc-csl-activate
  <span style="color: #81a2be;">:after</span> oc
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-csl-activate-use-document-style</span> t
        <span style="color: #cc6666;">org-cite-csl-activate-use-document-locale</span> t
    <span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+org-cite-csl-activate/enable</span> <span style="color: #de935f;">()</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-activate-processor</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">csl-activate</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #81a2be;">()</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">cursor-sensor-mode</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span> org-cite-csl-activate-render-all<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">defadvice!</span> +org-cite-csl-activate-render-all-silent <span style="color: #b5bd68;">(</span>orig-fn<span style="color: #b5bd68;">)</span>
      <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-cite-csl-activate-render-all</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-silent-modifications</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">funcall</span> orig-fn<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-silent-modifications</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">save-excursion</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">point-min</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-cite-activate</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">point-max</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-cite-csl-activate-render-all</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">fmakunbound</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+org-cite-csl-activate/enable</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    Now that <code>oc-csl-activate</code> is set up, let&rsquo;s
                    go ahead and customise some of the packages already loaded.
                    For starters, we can make use of the my Zotero files with
                    <code>citar</code>, and make the symbols a bit prettier.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> citar
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-global-bibliography</span>
        <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>libfile-search-names <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"library.json"</span> <span style="color: #b5bd68;">"Library.json"</span> <span style="color: #b5bd68;">"library.bib"</span> <span style="color: #b5bd68;">"Library.bib"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
              <span style="color: #b294bb;">(</span>libfile-dir <span style="color: #b5bd68;">"~/Zotero"</span><span style="color: #b294bb;">)</span>
              paths<span style="color: #b5bd68;">)</span>
          <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">dolist</span> <span style="color: #b294bb;">(</span>libfile libfile-search-names<span style="color: #b294bb;">)</span>
            <span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">and</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">not</span> paths<span style="color: #de935f;">)</span>
                       <span style="color: #de935f;">(</span><span style="color: #de935f;">file-exists-p</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">expand-file-name</span> libfile libfile-dir<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
              <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> paths <span style="color: #de935f;">(</span><span style="color: #de935f;">list</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">expand-file-name</span> libfile libfile-dir<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
          paths<span style="color: #de935f;">)</span>
        citar-bibliography <span style="color: #cc6666;">org-cite-global-bibliography</span>
        citar-symbols
        <span style="color: #c5c8c6;">`</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>file ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">all-the-icons-faicon</span> <span style="color: #b5bd68;">"file-o"</span> <span style="color: #81a2be;">:face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-green</span> <span style="color: #81a2be;">:v-adjust</span> <span style="color: #de935f; font-weight: bold;">-0.1</span><span style="color: #b294bb;">)</span> . <span style="color: #b5bd68;">" "</span><span style="color: #b5bd68;">)</span>
          <span style="color: #b5bd68;">(</span>note ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">all-the-icons-material</span> <span style="color: #b5bd68;">"speaker_notes"</span> <span style="color: #81a2be;">:face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-blue</span> <span style="color: #81a2be;">:v-adjust</span> <span style="color: #de935f; font-weight: bold;">-0.3</span><span style="color: #b294bb;">)</span> . <span style="color: #b5bd68;">" "</span><span style="color: #b5bd68;">)</span>
          <span style="color: #b5bd68;">(</span>link ,<span style="color: #b294bb;">(</span><span style="color: #de935f;">all-the-icons-octicon</span> <span style="color: #b5bd68;">"link"</span> <span style="color: #81a2be;">:face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-orange</span> <span style="color: #81a2be;">:v-adjust</span> <span style="color: #de935f; font-weight: bold;">0.01</span><span style="color: #b294bb;">)</span> . <span style="color: #b5bd68;">" "</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    We can also make the Zotero CSL styles available to use.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> oc-csl
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-csl-styles-dir</span> <span style="color: #b5bd68;">"~/Zotero/styles"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    Since CSL works so nicely everywhere, we might as well use
                    it as the default citation export processor for everything.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> oc
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-export-processors</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>t csl<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    Then, for convenience we&rsquo;ll cap things off by putting
                    the citation command under Org&rsquo;s localleader.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">map!</span> <span style="color: #81a2be;">:after</span> org
      <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">org-mode-map</span>
      <span style="color: #81a2be;">:localleader</span>
      <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Insert citation"</span> <span style="color: #b5bd68;">"@"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-cite-insert</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    Lastly, just in case I come across any old citations of
                    mine, I think it would be nice to have a function to convert
                    <code>org-ref</code> citations to
                    <code>org-cite</code> forms.
                  </p>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> oc
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-ref-to-org-cite</span> <span style="color: #de935f;">()</span>
    <span style="color: #717171;">"Attempt to convert org-ref citations to org-cite syntax."</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>cite-conversions <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"cite"</span> . <span style="color: #b5bd68;">"//b"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Cite"</span> . <span style="color: #b5bd68;">"//bc"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"nocite"</span> . <span style="color: #b5bd68;">"/n"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"citep"</span> . <span style="color: #b5bd68;">""</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"citep*"</span> . <span style="color: #b5bd68;">"//f"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"parencite"</span> . <span style="color: #b5bd68;">""</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Parencite"</span> . <span style="color: #b5bd68;">"//c"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"citeauthor"</span> . <span style="color: #b5bd68;">"/a/f"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"citeauthor*"</span> . <span style="color: #b5bd68;">"/a"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"citeyear"</span> . <span style="color: #b5bd68;">"/na/b"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Citep"</span> . <span style="color: #b5bd68;">"//c"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Citealp"</span> . <span style="color: #b5bd68;">"//bc"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Citeauthor"</span> . <span style="color: #b5bd68;">"/a/cf"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Citeauthor*"</span> . <span style="color: #b5bd68;">"/a/c"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"autocite"</span> . <span style="color: #b5bd68;">""</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Autocite"</span> . <span style="color: #b5bd68;">"//c"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"notecite"</span> . <span style="color: #b5bd68;">"/l/b"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Notecite"</span> . <span style="color: #b5bd68;">"/l/bc"</span><span style="color: #de935f;">)</span>
                               <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"pnotecite"</span> . <span style="color: #b5bd68;">"/l"</span><span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Pnotecite"</span> . <span style="color: #b5bd68;">"/l/bc"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
           <span style="color: #b294bb;">(</span>cite-regexp <span style="color: #81a2be;">(</span><span style="color: #b294bb;">rx</span> <span style="color: #de935f;">(</span>regexp <span style="color: #b5bd68;">(</span><span style="color: #de935f;">regexp-opt</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">mapcar</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">car</span> cite-conversions<span style="color: #b294bb;">)</span> t<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
                            <span style="color: #b5bd68;">":"</span> <span style="color: #de935f;">(</span>group <span style="color: #b5bd68;">(</span><span style="color: #de935f;">+</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">not</span> <span style="color: #81a2be;">(</span>any <span style="color: #b5bd68;">"\n         ,.)]}"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">save-excursion</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">point-min</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">while</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">re-search-forward</span> cite-regexp nil t<span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">message</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"[cite%s:@%s]"</span>
                                 <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">assoc</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span> cite-conversions<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
                                 <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">2</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">replace-match</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"[cite%s:@%s]"</span>
                                 <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">assoc</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span> cite-conversions<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
                                 <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">2</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-cite-csl-locales-dir</span> <span style="color: #b5bd68;">"~/code/cloned/csl-locales"</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
            </div>
