config/doom/config.html

            <div id="outline-container-orgabe94a7" class="outline-5">
              <h5 id="orgabe94a7">
                <span class="section-number-5">5.7.1.4.</span> Super agenda
              </h5>
              <div class="outline-text-5" id="text-5-7-1-4">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-super-agenda
  <span style="color: #81a2be;">:commands</span> <span style="color: #81a2be;">(</span><span style="color: #cc6666;">org-super-agenda-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> org-agenda
  <span style="color: #81a2be;">(</span><span style="color: #cc6666;">org-super-agenda-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-agenda-skip-scheduled-if-done</span> t
      <span style="color: #cc6666;">org-agenda-skip-deadline-if-done</span> t
      <span style="color: #cc6666;">org-agenda-include-deadlines</span> t
      <span style="color: #cc6666;">org-agenda-block-separator</span> nil
      <span style="color: #cc6666;">org-agenda-tags-column</span> <span style="color: #de935f; font-weight: bold;">100</span> <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">from testing this seems to be a good value</span>
      <span style="color: #cc6666;">org-agenda-compact-blocks</span> t<span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-agenda-custom-commands</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"o"</span> <span style="color: #b5bd68;">"Overview"</span>
         <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>agenda <span style="color: #b5bd68;">""</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #cc6666;">org-agenda-span</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">day</span><span style="color: #de935f;">)</span>
                      <span style="color: #de935f;">(</span><span style="color: #cc6666;">org-super-agenda-groups</span>
                       <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Today"</span>
                          <span style="color: #81a2be;">:time-grid</span> t
                          <span style="color: #81a2be;">:date</span> today
                          <span style="color: #81a2be;">:todo</span> <span style="color: #b5bd68;">"TODAY"</span>
                          <span style="color: #81a2be;">:scheduled</span> today
                          <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
          <span style="color: #b294bb;">(</span>alltodo <span style="color: #b5bd68;">""</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #cc6666;">org-agenda-overriding-header</span> <span style="color: #b5bd68;">""</span><span style="color: #de935f;">)</span>
                       <span style="color: #de935f;">(</span><span style="color: #cc6666;">org-super-agenda-groups</span>
                        <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Next to do"</span>
                           <span style="color: #81a2be;">:todo</span> <span style="color: #b5bd68;">"NEXT"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Work"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"work"</span>
                           <span style="color: #81a2be;">:priority</span> <span style="color: #b5bd68;">"A"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">3</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Important"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Important"</span>
                           <span style="color: #81a2be;">:priority</span> <span style="color: #b5bd68;">"A"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">6</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Due Today"</span>
                           <span style="color: #81a2be;">:deadline</span> today
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">2</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Due Soon"</span>
                           <span style="color: #81a2be;">:deadline</span> future
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">8</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Overdue"</span>
                           <span style="color: #81a2be;">:deadline</span> past
                           <span style="color: #81a2be;">:face</span> error
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">7</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Assignments"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Assignment"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">10</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Issues"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Issue"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">12</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Emacs"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Emacs"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">13</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Projects"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Project"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">14</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Research"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Research"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">15</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"To read"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Read"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">30</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"To watch"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"Watch"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">30</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Waiting"</span>
                           <span style="color: #81a2be;">:todo</span> <span style="color: #b5bd68;">"WAITING"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">20</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"University"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #b5bd68;">"uni"</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">32</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:name</span> <span style="color: #b5bd68;">"Trivial"</span>
                           <span style="color: #81a2be;">:priority&lt;=</span> <span style="color: #b5bd68;">"E"</span>
                           <span style="color: #81a2be;">:tag</span> <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"Trivial"</span> <span style="color: #b5bd68;">"Unimportant"</span><span style="color: #81a2be;">)</span>
                           <span style="color: #81a2be;">:todo</span> <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"SOMEDAY"</span> <span style="color: #81a2be;">)</span>
                           <span style="color: #81a2be;">:order</span> <span style="color: #de935f; font-weight: bold;">90</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #81a2be;">:discard</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:tag</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"Chore"</span> <span style="color: #b5bd68;">"Routine"</span> <span style="color: #b5bd68;">"Daily"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
