config/doom/config.html
            <div id="outline-container-org604eefd" class="outline-5">
              <h5 id="org604eefd">
                <span class="section-number-5">5.7.1.5.</span> Snippet Helpers
              </h5>
              <div class="outline-text-5" id="text-5-7-1-5">
                <p>
                  I often want to set <code>src-block</code> headers, and
                  it&rsquo;s a pain to
                </p>
                <ul class="org-ul">
                  <li>type them out</li>
                  <li>remember what the accepted values are</li>
                  <li>oh, and specifying the same language again and again</li>
                </ul>

                <p>We can solve this in three steps</p>
                <ul class="org-ul">
                  <li>
                    having one-letter snippets, conditioned on
                    <code>(point)</code> being within a src header
                  </li>
                  <li>
                    creating a nice prompt showing accepted values and the
                    current default
                  </li>
                  <li>
                    pre-filling the <code>src-block</code> language with the
                    last language used
                  </li>
                </ul>

                <p>For header args, the keys I&rsquo;ll use are</p>
                <ul class="org-ul">
                  <li><code>r</code> for <code>:results</code></li>
                  <li><code>e</code> for <code>:exports</code></li>
                  <li><code>v</code> for <code>:eval</code></li>
                  <li><code>s</code> for <code>:session</code></li>
                  <li><code>d</code> for <code>:dir</code></li>
                </ul>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+yas/org-src-header-p</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Determine whether `</span><span style="color: #de935f;">point</span><span style="color: #717171;">' is within a src-block header or header-args."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">pcase</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-type</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">src-block</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">&lt;</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">before code part of the src-block</span>
                   <span style="color: #b294bb;">(</span><span style="color: #b294bb;">save-excursion</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:begin</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                                   <span style="color: #81a2be;">(</span><span style="color: #de935f;">forward-line</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span>
                                   <span style="color: #81a2be;">(</span><span style="color: #de935f;">point</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">inline-src-block</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">&lt;</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">before code part of the inline-src-block</span>
                          <span style="color: #b294bb;">(</span><span style="color: #b294bb;">save-excursion</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:begin</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                                          <span style="color: #81a2be;">(</span><span style="color: #de935f;">search-forward</span> <span style="color: #b5bd68;">"]{"</span><span style="color: #81a2be;">)</span>
                                          <span style="color: #81a2be;">(</span><span style="color: #de935f;">point</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">keyword</span> <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">string-match-p</span> <span style="color: #b5bd68;">"^header-args"</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:value</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Now let&rsquo;s write a function we can reference in
                  yasnippets to produce a nice interactive way to specify header
                  args.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+yas/org-prompt-header-arg</span> <span style="color: #81a2be;">(</span>arg question values<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Prompt the user to set ARG header property to one of VALUES with QUESTION.</span>
<span style="color: #717171;">The default value is identified and indicated. If either default is selected,</span>
<span style="color: #717171;">or no selection is made: nil is returned."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>src-block-p <span style="color: #b294bb;">(</span><span style="color: #de935f;">not</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">looking-back</span> <span style="color: #b5bd68;">"^#\\+property:[ \t]+header-args:.*"</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">line-beginning-position</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>default
           <span style="color: #b294bb;">(</span><span style="color: #b294bb;">or</span>
            <span style="color: #81a2be;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">assoc</span> arg
                        <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">if</span> src-block-p
                            <span style="color: #b294bb;">(</span><span style="color: #de935f;">nth</span> <span style="color: #de935f; font-weight: bold;">2</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-babel-get-src-block-info</span> t<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
                          <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-babel-merge-params</span>
                           <span style="color: #cc6666;">org-babel-default-header-args</span>
                           <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>lang-headers
                                  <span style="color: #b294bb;">(</span><span style="color: #de935f;">intern</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #b5bd68;">"org-babel-default-header-args:"</span>
                                                  <span style="color: #de935f;">(</span><span style="color: #81a2be;">+yas/org-src-lang</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
                             <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">boundp</span> lang-headers<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eval</span> lang-headers t<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
            <span style="color: #b5bd68;">""</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         default-value<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> values <span style="color: #b5bd68;">(</span><span style="color: #de935f;">mapcar</span>
                  <span style="color: #b294bb;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #81a2be;">(</span>value<span style="color: #81a2be;">)</span>
                    <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">string-match-p</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">regexp-quote</span> value<span style="color: #b5bd68;">)</span> default<span style="color: #de935f;">)</span>
                        <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> default-value
                              <span style="color: #b5bd68;">(</span><span style="color: #de935f;">concat</span> value <span style="color: #b5bd68;">" "</span>
                                      <span style="color: #b294bb;">(</span><span style="color: #de935f;">propertize</span> <span style="color: #b5bd68;">"(default)"</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">font-lock-doc-face</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
                      value<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
                  values<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>selection <span style="color: #81a2be;">(</span><span style="color: #de935f;">consult--read</span> values <span style="color: #81a2be;">:prompt</span> question <span style="color: #81a2be;">:default</span> default-value<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">or</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">string-match-p</span> <span style="color: #b5bd68;">"(default)$"</span> selection<span style="color: #81a2be;">)</span>
                  <span style="color: #81a2be;">(</span><span style="color: #de935f;">string=</span> <span style="color: #b5bd68;">""</span> selection<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        selection<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Finally, we fetch the language information for new source
                  blocks.
                </p>

                <p>
                  Since we&rsquo;re getting this info, we might as well go a
                  step further and also provide the ability to determine the
                  most popular language in the buffer that doesn&rsquo;t have
                  any <code>header-args</code> set for it (with
                  <code>#+properties</code>).
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+yas/org-src-lang</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Try to find the current language of the src/header at `</span><span style="color: #de935f;">point</span><span style="color: #717171;">'.</span>
<span style="color: #717171;">Return nil otherwise."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>context <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">pcase</span> <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">org-element-type</span> context<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">src-block</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:language</span> context<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">inline-src-block</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:language</span> context<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">keyword</span> <span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">string-match</span> <span style="color: #b5bd68;">"^header-args:</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(</span><span style="color: #b5bd68;">[</span><span style="color: #c5c8c6; font-weight: bold;">^</span><span style="color: #b5bd68;"> ]+</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">"</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:value</span> context<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                  <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:value</span> context<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+yas/org-last-src-lang</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Return the language of the last src-block, if it exists."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">save-excursion</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">beginning-of-line</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">re-search-backward</span> <span style="color: #b5bd68;">"^[ \t]*#\\+begin_src"</span> nil t<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:language</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-element-context</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+yas/org-most-common-no-property-lang</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Find the lang with the most source blocks that has no global header-args, else nil."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span>src-langs header-langs<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">save-excursion</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point-min</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">while</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"^[ \t]*#\\+begin_src"</span> nil t<span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">push</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">+yas/org-src-lang</span><span style="color: #81a2be;">)</span> src-langs<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point-min</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">while</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"^[ \t]*#\\+property: +header-args"</span> nil t<span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">push</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">+yas/org-src-lang</span><span style="color: #81a2be;">)</span> header-langs<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>

    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> src-langs
          <span style="color: #b5bd68;">(</span><span style="color: #de935f;">mapcar</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">car</span>
                  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">sort alist by frequency (desc.)</span>
                  <span style="color: #b294bb;">(</span><span style="color: #de935f;">sort</span>
                   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">generate alist with form (value . frequency)</span>
                   <span style="color: #81a2be;">(</span><span style="color: #b294bb;">cl-loop</span> for <span style="color: #de935f;">(</span>n . m<span style="color: #de935f;">)</span> in <span style="color: #de935f;">(</span><span style="color: #81a2be;">seq-group-by</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">identity</span> src-langs<span style="color: #de935f;">)</span>
                            collect <span style="color: #de935f;">(</span><span style="color: #de935f;">cons</span> n <span style="color: #b5bd68;">(</span><span style="color: #de935f;">length</span> m<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                   <span style="color: #81a2be;">(</span><span style="color: #b294bb;">lambda</span> <span style="color: #de935f;">(</span>a b<span style="color: #de935f;">)</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">&gt;</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> a<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> b<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>

    <span style="color: #de935f;">(</span><span style="color: #de935f;">car</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cl-set-difference</span> src-langs header-langs <span style="color: #81a2be;">:test</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">string=</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
