config/doom/config.html

            <div id="outline-container-org344bb28" class="outline-5">
              <h5 id="org344bb28">
                <span class="section-number-5">5.7.1.6.</span> Translate capital
                keywords (old) to lower case (new)
              </h5>
              <div class="outline-text-5" id="text-5-7-1-6">
                <p>
                  Everyone used to use <code>#+CAPITAL</code> keywords. Then
                  people realised that <code>#+lowercase</code>
                  is actually both marginally easier and visually nicer, so now
                  the capital version is just used in the manual.
                </p>
                <blockquote>
                  <p>
                    Org is standardized on lower case. Uppercase is used in the
                    manual as a poor man&rsquo;s bold, and supported for
                    historical reasons. &#x2014;
                    <a
                      href="https://orgmode.org/list/87tuuw3n15.fsf@nicolasgoaziou.fr"
                      >Nicolas Goaziou on the Org ML</a
                    >
                  </p>
                </blockquote>

                <p>
                  To avoid sometimes having to choose between the hassle out of
                  updating old documents and using mixed syntax, I&rsquo;ll whip
                  up a basic transcode-y function. It likely misses some edge
                  cases, but should mostly work.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-syntax-convert-keyword-case-to-lower</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Convert all #+KEYWORDS to #+keywords."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">save-excursion</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">goto-char</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point-min</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #de935f;">count</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b294bb;">)</span>
          <span style="color: #b294bb;">(</span><span style="color: #cc6666;">case-fold-search</span> nil<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">while</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"^[ \t]*#\\+[A-Z_]+"</span> nil t<span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">s-matches-p</span> <span style="color: #b5bd68;">"RESULTS"</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">replace-match</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">downcase</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-string</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span> t<span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> count <span style="color: #de935f;">(</span><span style="color: #de935f;">1+</span> count<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">message</span> <span style="color: #b5bd68;">"Replaced %d occurances"</span> count<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-org5c0e9d2" class="outline-5">
              <h5 id="org5c0e9d2">
                <span class="section-number-5">5.7.1.7.</span> Fix problematic
                hooks
              </h5>
              <div class="outline-text-5" id="text-5-7-1-7">
                <p>
                  When one of the
                  <code class="src src-elisp"
                    ><span style="color: #cc6666">org-mode-hook</span></code
                  >
                  functions errors, it halts the hook execution. This is
                  problematic, and there are two hooks in particular which cause
                  issues. Let&rsquo;s make their failure less eventful.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> shut-up-org-problematic-hooks <span style="color: #81a2be;">(</span>orig-fn <span style="color: #f0c674;">&amp;rest</span> args<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-fancy-priorities-mode</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">ignore-errors</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">apply</span> orig-fn args<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgbe5b5a4" class="outline-5">
              <h5 id="orgbe5b5a4">
                <span class="section-number-5">5.7.1.8.</span> Mermaid diagrams
              </h5>
              <div class="outline-text-5" id="text-5-7-1-8">
                <p>Diagram can be generated using something like this</p>

                <pre class="example" id="org415dc0c">
#+begin_src mermaid :file test.png
sequenceDiagram
 A--&gt;B: Works!
#+end_src
</pre
                >

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> ob-mermaid
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-babel-do-load-languages</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-babel-load-languages</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>mermaid . t<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(setq ob-mermaid-cli-path (executable-find "mmdc"))</span>
  <span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-orgd123597" class="outline-5">
              <h5 id="orgd123597">
                <span class="section-number-5">5.7.1.9.</span> Org-roam
              </h5>
              <div class="outline-text-5" id="text-5-7-1-9">
                <p>Add ui for org-roam</p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> websocket
  <span style="color: #81a2be;">:after</span> org-roam<span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-roam-ui
  <span style="color: #81a2be;">:after</span> org-roam
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-roam-ui-sync-theme</span> t
        <span style="color: #cc6666;">org-roam-ui-follow</span> t
        <span style="color: #cc6666;">org-roam-ui-update-on-save</span> t
        <span style="color: #cc6666;">org-roam-ui-open-on-start</span> t<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
            <div id="outline-container-org5364cb5" class="outline-5">
              <h5 id="org5364cb5">
                <span class="section-number-5">5.7.1.10.</span> Org-transclusion
              </h5>
              <div class="outline-text-5" id="text-5-7-1-10">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-transclusion
  <span style="color: #81a2be;">:after</span> org
  <span style="color: #81a2be;">:init</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">map!</span>
   <span style="color: #81a2be;">:map</span> <span style="color: #cc6666;">global-map</span> <span style="color: #b5bd68;">"&lt;f12&gt;"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-transclusion-add</span>
   <span style="color: #81a2be;">:leader</span>
   <span style="color: #81a2be;">:prefix</span> <span style="color: #b5bd68;">"n"</span>
   <span style="color: #81a2be;">:desc</span> <span style="color: #b5bd68;">"Org Transclusion Mode"</span> <span style="color: #b5bd68;">"t"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-transclusion-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>
