config/doom/config.org
**** Org Modern

Fontifying =org-mode= buffers to be as pretty as possible is of paramount importance,
and Minad's lovely =org-modern= goes a long way in this regard.

# #+begin_src emacs-lisp :tangle packages.el
# (package! org-modern :pin "537e6b75e38bc0eff083c390c257098c9fc9ab49")
# #+end_src

...with a touch of configuration...

#+begin_src emacs-lisp :tangle yes
(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq
   ;; org-modern-star '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
   org-modern-table-vertical 1
   org-modern-table-horizontal 0.2
   org-modern-todo-faces
   '(("TODO" :inverse-video t :inherit org-todo)
     ("PROJ" :inverse-video t :inherit +org-todo-project)
     ("STRT" :inverse-video t :inherit +org-todo-active)
     ("[-]"  :inverse-video t :inherit +org-todo-active)
     ("HOLD" :inverse-video t :inherit +org-todo-onhold)
     ("WAIT" :inverse-video t :inherit +org-todo-onhold)
     ("[?]"  :inverse-video t :inherit +org-todo-onhold)
     ("KILL" :inverse-video t :inherit +org-todo-cancel)
     ("NO"   :inverse-video t :inherit +org-todo-cancel))
   org-modern-footnote
   (cons nil (cadr org-script-display))
   org-modern-block-fringe t
   org-modern-block-name
   '((t . t)
     ("src" "»" "«")
     ("example" "»–" "–«")
     ("quote" "❝" "❞")
     ("export" "⏩" "⏪"))
   org-modern-progress nil
   org-modern-priority nil
   org-modern-horizontal-rule (make-string 36 ?─)
   org-modern-keyword
   '((t . t)
     ("title" . "𝙏")
     ("subtitle" . "𝙩")
     ("author" . "𝘼")
     ("email" . #("" 0 1 (display (raise -0.14))))
     ("date" . "𝘿")
     ("property" . "☸")
     ("options" . "⌥")
     ("startup" . "⏻")
     ("macro" . "𝓜")
     ("bind" . #("" 0 1 (display (raise -0.1))))
     ("bibliography" . "")
     ("print_bibliography" . #("" 0 1 (display (raise -0.1))))
     ("cite_export" . "⮭")
     ("print_glossary" . #("ᴬᶻ" 0 1 (display (raise -0.1))))
     ("glossary_sources" . #("" 0 1 (display (raise -0.14))))
     ("include" . "⇤")
     ("setupfile" . "⇚")
     ("html_head" . "🅷")
     ("html" . "🅗")
     ("latex_class" . "🄻")
     ("latex_class_options" . #("🄻" 1 2 (display (raise -0.14))))
     ("latex_header" . "🅻")
     ("latex_header_extra" . "🅻⁺")
     ("latex" . "🅛")
     ("beamer_theme" . "🄱")
     ("beamer_color_theme" . #("🄱" 1 2 (display (raise -0.12))))
     ("beamer_font_theme" . "🄱𝐀")
     ("beamer_header" . "🅱")
     ("beamer" . "🅑")
     ("attr_latex" . "🄛")
     ("attr_html" . "🄗")
     ("attr_org" . "⒪")
     ("call" . #("" 0 1 (display (raise -0.15))))
     ("name" . "⁍")
     ("header" . "›")
     ("caption" . "☰")
     ("RESULTS" . "🠶")))
  (custom-set-faces! '(org-modern-statistics :inherit org-checkbox-statistics-todo)))
#+end_src

Since =org-modern='s tag face supplants Org's tag face, we need to adjust the
spell-check face ignore list

#+begin_src emacs-lisp
(after! spell-fu
  (cl-pushnew 'org-modern-tag (alist-get 'org-mode +spell-excluded-faces-alist)))
#+end_src

