config/doom/config.html
          <div id="outline-container-org6a9762f" class="outline-4">
            <h4 id="org6a9762f">
              <span class="section-number-4">5.7.2.</span> Visuals
            </h4>
            <div class="outline-text-4" id="text-5-7-2"></div>
            <div id="outline-container-org97b32db" class="outline-5">
              <h5 id="org97b32db">
                <span class="section-number-5">5.7.2.1.</span> Org Modern
              </h5>
              <div class="outline-text-5" id="text-5-7-2-1">
                <p>
                  Fontifying <code>org-mode</code> buffers to be as pretty as
                  possible is of paramount importance, and Minad&rsquo;s lovely
                  <code>org-modern</code> goes a long way in this regard.
                </p>

                <p>&#x2026;with a touch of configuration&#x2026;</p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-modern
  <span style="color: #81a2be;">:hook</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-mode</span> . <span style="color: #cc6666;">org-modern-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span>
   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">org-modern-star '("&#9673;" "&#9675;" "&#10040;" "&#10047;" "&#10020;" "&#10012;" "&#9670;" "&#9654;")</span>
   <span style="color: #cc6666;">org-modern-table-vertical</span> <span style="color: #de935f; font-weight: bold;">1</span>
   <span style="color: #cc6666;">org-modern-table-horizontal</span> <span style="color: #de935f; font-weight: bold;">0.2</span>
   <span style="color: #cc6666;">org-modern-todo-faces</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"</span><span style="color: #f0c674; font-weight: bold;">TODO</span><span style="color: #b5bd68;">"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> org-todo<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"PROJ"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-project<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"STRT"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-active<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"[-]"</span>  <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-active<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"HOLD"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-onhold<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"WAIT"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-onhold<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"[?]"</span>  <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-onhold<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"KILL"</span> <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-cancel<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"NO"</span>   <span style="color: #81a2be;">:inverse-video</span> t <span style="color: #81a2be;">:inherit</span> +org-todo-cancel<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #cc6666;">org-modern-footnote</span>
   <span style="color: #de935f;">(</span><span style="color: #de935f;">cons</span> nil <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cadr</span> <span style="color: #cc6666;">org-script-display</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #cc6666;">org-modern-block-fringe</span> t
   <span style="color: #cc6666;">org-modern-block-name</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>t . t<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"src"</span> <span style="color: #b5bd68;">"&#187;"</span> <span style="color: #b5bd68;">"&#171;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"example"</span> <span style="color: #b5bd68;">"&#187;&#8211;"</span> <span style="color: #b5bd68;">"&#8211;&#171;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"quote"</span> <span style="color: #b5bd68;">"&#10077;"</span> <span style="color: #b5bd68;">"&#10078;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"export"</span> <span style="color: #b5bd68;">"&#9193;"</span> <span style="color: #b5bd68;">"&#9194;"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
   <span style="color: #cc6666;">org-modern-progress</span> nil
   <span style="color: #cc6666;">org-modern-priority</span> nil
   <span style="color: #cc6666;">org-modern-horizontal-rule</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">make-string</span> <span style="color: #de935f; font-weight: bold;">36</span> ?&#9472;<span style="color: #de935f;">)</span>
   <span style="color: #cc6666;">org-modern-keyword</span>
   <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>t . t<span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"title"</span> . <span style="color: #b5bd68;">"&#120399;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"subtitle"</span> . <span style="color: #b5bd68;">"&#120425;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"author"</span> . <span style="color: #b5bd68;">"&#120380;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"email"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#57569;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.14</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"date"</span> . <span style="color: #b5bd68;">"&#120383;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"property"</span> . <span style="color: #b5bd68;">"&#9784;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"options"</span> . <span style="color: #b5bd68;">"&#8997;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"startup"</span> . <span style="color: #b5bd68;">"&#9211;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"macro"</span> . <span style="color: #b5bd68;">"&#120028;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"bind"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#57687;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"bibliography"</span> . <span style="color: #b5bd68;">"&#62469;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"print_bibliography"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#58699;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"cite_export"</span> . <span style="color: #b5bd68;">"&#62469;&#11181;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"print_glossary"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#58699;&#7468;&#7611;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"glossary_sources"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#57427;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.14</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"include"</span> . <span style="color: #b5bd68;">"&#8676;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"setupfile"</span> . <span style="color: #b5bd68;">"&#8666;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"html_head"</span> . <span style="color: #b5bd68;">"&#127351;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"html"</span> . <span style="color: #b5bd68;">"&#127319;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex_class"</span> . <span style="color: #b5bd68;">"&#127291;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex_class_options"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#127291;&#59576;"</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #de935f; font-weight: bold;">2</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.14</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex_header"</span> . <span style="color: #b5bd68;">"&#127355;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex_header_extra"</span> . <span style="color: #b5bd68;">"&#127355;&#8314;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex"</span> . <span style="color: #b5bd68;">"&#127323;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"beamer_theme"</span> . <span style="color: #b5bd68;">"&#127281;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"beamer_color_theme"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#127281;&#58378;"</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #de935f; font-weight: bold;">2</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.12</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"beamer_font_theme"</span> . <span style="color: #b5bd68;">"&#127281;&#119808;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"beamer_header"</span> . <span style="color: #b5bd68;">"&#127345;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"beamer"</span> . <span style="color: #b5bd68;">"&#127313;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"attr_latex"</span> . <span style="color: #b5bd68;">"&#127259;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"attr_html"</span> . <span style="color: #b5bd68;">"&#127255;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"attr_org"</span> . <span style="color: #b5bd68;">"&#9386;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"call"</span> . #<span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"&#58726;"</span> <span style="color: #de935f; font-weight: bold;">0</span> <span style="color: #de935f; font-weight: bold;">1</span> <span style="color: #81a2be;">(</span>display <span style="color: #de935f;">(</span>raise <span style="color: #de935f; font-weight: bold;">-0.15</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"name"</span> . <span style="color: #b5bd68;">"&#8269;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"header"</span> . <span style="color: #b5bd68;">"&#8250;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"caption"</span> . <span style="color: #b5bd68;">"&#9776;"</span><span style="color: #b5bd68;">)</span>
     <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"RESULTS"</span> . <span style="color: #b5bd68;">"&#129078;"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">custom-set-faces!</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #cc6666;">org-modern-statistics</span> <span style="color: #81a2be;">:inherit</span> org-checkbox-statistics-todo<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Since <code>org-modern</code>&rsquo;s tag face supplants
                  Org&rsquo;s tag face, we need to adjust the spell-check face
                  ignore list
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> spell-fu
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">cl-pushnew</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-modern-tag</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">alist-get</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span> <span style="color: #cc6666;">+spell-excluded-faces-alist</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
