config/doom/config.html

            <div id="outline-container-org4001f82" class="outline-5">
              <h5 id="org4001f82">
                <span class="section-number-5">5.7.2.2.</span> Emphasis markers
              </h5>
              <div class="outline-text-5" id="text-5-7-2-2">
                <p>
                  While <code>org-hide-emphasis-markers</code> is very nice, it
                  can sometimes make edits which occur at the border a bit more
                  fiddley. We can improve this situation without sacrificing
                  visual amenities with the <code>org-appear</code> package.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-appear
  <span style="color: #81a2be;">:hook</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-mode</span> . <span style="color: #cc6666;">org-appear-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-appear-autoemphasis</span> t
        <span style="color: #cc6666;">org-appear-autosubmarkers</span> t
        <span style="color: #cc6666;">org-appear-autolinks</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">for proper first-time setup, `</span><span style="color: #de935f;">org-appear--set-elements</span><span style="color: #5a5b5a;">'</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">needs to be run after other hooks have acted.</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">run-at-time</span> nil nil <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-appear--set-elements</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>

            <div id="outline-container-org07c074c" class="outline-5">
              <h5 id="org07c074c">
                <span class="section-number-5">5.7.2.3.</span> Font Display
              </h5>
              <div class="outline-text-5" id="text-5-7-2-3">
                <p>
                  Mixed pitch is great. As is <code>+org-pretty-mode</code>,
                  let&rsquo;s use them.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">+org-pretty-mode</span> <span style="color: #c5c8c6;">#'</span><span style="color: #cc6666;">mixed-pitch-mode</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>Let&rsquo;s make headings a bit bigger</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">custom-set-faces!</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-1 <span style="color: #81a2be;">:weight</span> extra-bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.25</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-2 <span style="color: #81a2be;">:weight</span> bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.15</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-3 <span style="color: #81a2be;">:weight</span> bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.12</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-4 <span style="color: #81a2be;">:weight</span> semi-bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.09</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-5 <span style="color: #81a2be;">:weight</span> semi-bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.06</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-6 <span style="color: #81a2be;">:weight</span> semi-bold <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.03</span><span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-8 <span style="color: #81a2be;">:weight</span> semi-bold<span style="color: #81a2be;">)</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>outline-9 <span style="color: #81a2be;">:weight</span> semi-bold<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>And the same with the title.</p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">custom-set-faces!</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>org-document-title <span style="color: #81a2be;">:height</span> <span style="color: #de935f; font-weight: bold;">1.2</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  It seems reasonable to have deadlines in the error face when
                  they&rsquo;re passed.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-agenda-deadline-faces</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #de935f; font-weight: bold;">1.001</span> . error<span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #de935f; font-weight: bold;">1.0</span> . org-warning<span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #de935f; font-weight: bold;">0.5</span> . org-upcoming-deadline<span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span><span style="color: #de935f; font-weight: bold;">0.0</span> . org-upcoming-distant-deadline<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  We can then have quote blocks stand out a bit more by making
                  them <i>italic</i>.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-fontify-quote-and-verse-blocks</span> t<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  While <code>org-hide-emphasis-markers</code> is very nice, it
                  can sometimes make edits which occur at the border a bit more
                  fiddley. We can improve this situation without sacrificing
                  visual amenities with the <code>org-appear</code> package.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-appear
  <span style="color: #81a2be;">:hook</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-mode</span> . <span style="color: #cc6666;">org-appear-mode</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-appear-autoemphasis</span> t
        <span style="color: #cc6666;">org-appear-autosubmarkers</span> t
        <span style="color: #cc6666;">org-appear-autolinks</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">for proper first-time setup, `</span><span style="color: #de935f;">org-appear--set-elements</span><span style="color: #5a5b5a;">'</span>
  <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">needs to be run after other hooks have acted.</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">run-at-time</span> nil nil <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-appear--set-elements</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Org files can be rather nice to look at, particularly with
                  some of the customisations here. This comes at a cost however,
                  expensive font-lock. Feeling like you&rsquo;re typing through
                  molasses in large files is no fun, but there is a way I can
                  defer font-locking when typing to make the experience more
                  responsive.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">locally-defer-font-lock</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Set jit-lock defer and stealth, when buffer is over a certain size."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">when</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">&gt;</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">buffer-size</span><span style="color: #b5bd68;">)</span> <span style="color: #de935f; font-weight: bold;">50000</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">jit-lock-defer-time</span> <span style="color: #de935f; font-weight: bold;">0.05</span>
                <span style="color: #cc6666;">jit-lock-stealth-time</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-mode-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">locally-defer-font-lock</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
                <p>
                  Apparently this causes issues with some people, but I
                  haven&rsquo;t noticed anything problematic beyond the expected
                  slight delay in some fontification, so until I do I&rsquo;ll
                  use the above.
                </p>
              </div>
            </div>
