config/doom/config.html

            <div id="outline-container-orgde97588" class="outline-5">
              <h5 id="orgde97588">
                <span class="section-number-5">5.7.2.4.</span> Reduced text
                indent
              </h5>
              <div class="outline-text-5" id="text-5-7-2-4">
                <p>
                  Thanks to the various bits and bobs of setup we have here, the
                  non-heading lines tend to appear over-indented in
                  <code>org-indent-mode</code>. We can adjust this by modifying
                  the generated text prefixes.
                </p>

                <p>
                  There&rsquo;s another issue we can have when using mixed-pitch
                  mode, where the line height is set by the indent prefix
                  displayed with the fixed-pitch font. This means that on
                  0-indent lines the line spacing can be different, which
                  doesn&rsquo;t look very good. We can also solve this problem
                  by modifying the generated text prefixes to but a fixed-pitch
                  zero width space at the start of 0-indent lines instead of
                  nothing.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> +org-indent--reduced-text-prefixes <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-indent--compute-prefixes</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-indent--text-line-prefixes</span>
        <span style="color: #de935f;">(</span><span style="color: #de935f;">make-vector</span> <span style="color: #cc6666;">org-indent--deepest-level</span> nil<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">when</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">&gt;</span> <span style="color: #cc6666;">org-indent-indentation-per-level</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">dotimes</span> <span style="color: #b5bd68;">(</span>n <span style="color: #cc6666;">org-indent--deepest-level</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">aset</span> <span style="color: #cc6666;">org-indent--text-line-prefixes</span>
            n
            <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-add-props</span>
                <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">make-string</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">*</span> n <span style="color: #b294bb;">(</span><span style="color: #de935f;">1-</span> <span style="color: #cc6666;">org-indent-indentation-per-level</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
                                     ?\s<span style="color: #de935f;">)</span>
                        <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">&gt;</span> n <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span>
                             <span style="color: #b5bd68;">(</span><span style="color: #de935f;">char-to-string</span> <span style="color: #cc6666;">org-indent-boundary-char</span><span style="color: #b5bd68;">)</span>
                          <span style="color: #b5bd68;">"\u200b"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                nil <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-indent</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
