config/doom/config.html

            <div id="outline-container-orgf662579" class="outline-5">
              <h5 id="orgf662579">
                <span class="section-number-5">5.7.2.5.</span> Fontifying inline
                src blocks
              </h5>
              <div class="outline-text-5" id="text-5-7-2-5">
                <p>
                  Org does lovely things with <code>#+begin_src</code> blocks,
                  like using font-lock for language&rsquo;s major-mode behind
                  the scenes and pulling out the lovely colourful results. By
                  contrast, inline <code>src_</code> blocks are somewhat
                  neglected.
                </p>

                <p>
                  I am not the first person to feel this way, thankfully others
                  have
                  <a
                    href="https://stackoverflow.com/questions/20309842/how-to-syntax-highlight-for-org-mode-inline-source-code-src-lang/28059832"
                    >taken to stackexchange</a
                  >
                  to voice their desire for inline src fontification. I was
                  going to steal their work, but unfortunately they didn&rsquo;t
                  perform <i>true</i> source code fontification, but simply
                  applied the <code>org-code</code> face to the content.
                </p>

                <p>
                  We can do better than that, and we shall! Using
                  <code>org-src-font-lock-fontify-block</code>
                  we can apply language-appropriate syntax highlighting. Then,
                  continuing on to
                  <code>{{{results(...)}}}</code> , it can have the
                  <code>org-block</code> face applied to match, and then the
                  value-surrounding constructs hidden by mimicking the behaviour
                  of <code>prettify-symbols-mode</code>.
                </p>

                <div class="warning" id="orgab7702b">
                  <p>
                    This currently only highlights a single inline src block per
                    line. I have no idea why it stops, but I&rsquo;d rather it
                    didn&rsquo;t. If you have any idea what&rsquo;s going on or
                    how to fix this <i>please</i> get in touch.
                  </p>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-prettify-inline-results</span> t
  <span style="color: #717171;">"Whether to use (ab)use prettify-symbols-mode on {{{results(...)}}}.</span>
<span style="color: #717171;">Either t or a cons cell of strings which are used as substitutions</span>
<span style="color: #717171;">for the start and end of inline results, respectively."</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-fontify-inline-src-blocks-max-length</span> <span style="color: #de935f; font-weight: bold;">200</span>
  <span style="color: #717171;">"Maximum content length of an inline src block that will be fontified."</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-fontify-inline-src-blocks</span> <span style="color: #81a2be;">(</span>limit<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Try to apply `</span><span style="color: #de935f;">org-fontify-inline-src-blocks-1</span><span style="color: #717171;">'."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">condition-case</span> nil
      <span style="color: #de935f;">(</span><span style="color: #de935f;">org-fontify-inline-src-blocks-1</span> limit<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">error</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">message</span> <span style="color: #b5bd68;">"Org mode fontification error in %S at %d"</span>
                    <span style="color: #b294bb;">(</span><span style="color: #de935f;">current-buffer</span><span style="color: #b294bb;">)</span>
                    <span style="color: #b294bb;">(</span><span style="color: #de935f;">line-number-at-pos</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-fontify-inline-src-blocks-1</span> <span style="color: #81a2be;">(</span>limit<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Fontify inline src_LANG blocks, from `</span><span style="color: #de935f;">point</span><span style="color: #717171;">' up to LIMIT."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #cc6666;">case-fold-search</span> t<span style="color: #b5bd68;">)</span>
        <span style="color: #b5bd68;">(</span>initial-point <span style="color: #b294bb;">(</span><span style="color: #de935f;">point</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">while</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"\\_&lt;src_</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(</span><span style="color: #b5bd68;">[</span><span style="color: #c5c8c6; font-weight: bold;">^</span><span style="color: #b5bd68;"> \t\n[{]+</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">[{[]?"</span> limit t<span style="color: #b5bd68;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">stolen from `</span><span style="color: #de935f;">org-element-inline-src-block-parser</span><span style="color: #5a5b5a;">'</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">(</span>beg <span style="color: #de935f;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
            pt
            <span style="color: #81a2be;">(</span>lang-beg <span style="color: #de935f;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
            <span style="color: #81a2be;">(</span>lang-end <span style="color: #de935f;">(</span><span style="color: #de935f;">match-end</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">remove-text-properties</span> beg lang-end <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>face nil<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> lang-beg lang-end <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-meta-line</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> beg lang-beg <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">shadow</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> beg lang-end <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-block</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> pt <span style="color: #81a2be;">(</span><span style="color: #de935f;">goto-char</span> lang-end<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">`</span><span style="color: #de935f;">org-element--parse-paired-brackets</span><span style="color: #5a5b5a;">' doesn't take a limit, so to</span>
        <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">prevent it searching the entire rest of the buffer we temporarily</span>
        <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">narrow the active region.</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">save-restriction</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">narrow-to-region</span> beg <span style="color: #de935f;">(</span><span style="color: #de935f;">min</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point-max</span><span style="color: #b5bd68;">)</span> limit <span style="color: #b5bd68;">(</span><span style="color: #de935f;">+</span> lang-end <span style="color: #cc6666;">org-fontify-inline-src-blocks-max-length</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #b294bb;">when</span> <span style="color: #de935f;">(</span><span style="color: #b294bb;">ignore-errors</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-element--parse-paired-brackets</span> ?\[<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #de935f;">remove-text-properties</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>face nil<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-block</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #b294bb;">when</span> <span style="color: #de935f;">(</span><span style="color: #b294bb;">ignore-errors</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-element--parse-paired-brackets</span> ?\{<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #de935f;">remove-text-properties</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>face nil<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">1+</span> pt<span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>org-block shadow<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">=</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">1+</span> pt<span style="color: #b294bb;">)</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">1-</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">point</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
              <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">if</span> <span style="color: #cc6666;">org-src-fontify-natively</span>
                  <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-src-font-lock-fontify-block</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">buffer-substring-no-properties</span> lang-beg lang-end<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">1+</span> pt<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">1-</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">point</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
                <span style="color: #b294bb;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">1+</span> pt<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">1-</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">point</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-block</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">1-</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>org-block shadow<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
            <span style="color: #de935f;">(</span><span style="color: #b294bb;">setq</span> pt <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">when</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">and</span> <span style="color: #cc6666;">org-prettify-inline-results</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"\\= {{{results("</span> limit t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> pt <span style="color: #de935f;">(</span><span style="color: #de935f;">1+</span> pt<span style="color: #de935f;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-block</span><span style="color: #81a2be;">)</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">goto-char</span> pt<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #cc6666;">org-prettify-inline-results</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">goto-char</span> initial-point<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">org-fontify-inline-src-results</span> limit<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-fontify-inline-src-results</span> <span style="color: #81a2be;">(</span>limit<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">while</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">re-search-forward</span> <span style="color: #b5bd68;">"{{{results(</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">(</span><span style="color: #b5bd68;">.+?</span><span style="color: #c5c8c6; font-weight: bold;">\\</span><span style="color: #c5c8c6; font-weight: bold;">)</span><span style="color: #b5bd68;">)}}}"</span> limit t<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">remove-list-of-text-properties</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">point</span><span style="color: #b5bd68;">)</span>
                                    <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span>composition
                                      prettify-symbols-start
                                      prettify-symbols-end<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">font-lock-append-text-property</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">match-end</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">face</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-block</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>start <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span> <span style="color: #b294bb;">(</span>end <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-beginning</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-silent-modifications</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">compose-region</span> start end <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">org-prettify-inline-results</span> t<span style="color: #de935f;">)</span> <span style="color: #b5bd68;">"&#10216;"</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">car</span> <span style="color: #cc6666;">org-prettify-inline-results</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">add-text-properties</span> start end <span style="color: #c5c8c6;">`</span><span style="color: #81a2be;">(</span>prettify-symbols-start ,start prettify-symbols-end ,end<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>start <span style="color: #81a2be;">(</span><span style="color: #de935f;">match-end</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span> <span style="color: #b294bb;">(</span>end <span style="color: #81a2be;">(</span><span style="color: #de935f;">point</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-silent-modifications</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">compose-region</span> start end <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">org-prettify-inline-results</span> t<span style="color: #de935f;">)</span> <span style="color: #b5bd68;">"&#10217;"</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">cdr</span> <span style="color: #cc6666;">org-prettify-inline-results</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">add-text-properties</span> start end <span style="color: #c5c8c6;">`</span><span style="color: #81a2be;">(</span>prettify-symbols-start ,start prettify-symbols-end ,end<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-fontify-inline-src-blocks-enable</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Add inline src fontification to font-lock in Org.</span>
<span style="color: #717171;">Must be run as part of `</span><span style="color: #de935f;">org-font-lock-set-keywords-hook</span><span style="color: #717171;">'."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-font-lock-extra-keywords</span>
        <span style="color: #de935f;">(</span><span style="color: #de935f;">append</span> <span style="color: #cc6666;">org-font-lock-extra-keywords</span> <span style="color: #c5c8c6;">'</span><span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span><span style="color: #de935f;">org-fontify-inline-src-blocks</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-font-lock-set-keywords-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-fontify-inline-src-blocks-enable</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
