config/doom/config.html

            <div id="outline-container-org6004c2b" class="outline-5">
              <h5 id="org6004c2b">
                <span class="section-number-5">5.7.2.6.</span> Symbols
              </h5>
              <div class="outline-text-5" id="text-5-7-2-6">
                <p>
                  It&rsquo;s also nice to change the character used for
                  collapsed items (by default <code></code>), I think
                  <code></code> is better for indicating &rsquo;collapsed
                  section&rsquo;. and add an extra <code>org-bullet</code> to
                  the default list of four. I&rsquo;ve also added some fun
                  alternatives, just commented out.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(use-package org-pretty-tags</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:config</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">(setq org-pretty-tags-surrogate-strings</span>
<span style="color: #5a5b5a;">;;        </span><span style="color: #5a5b5a;">`(("uni"        . ,(all-the-icons-faicon   "graduation-cap" :face 'all-the-icons-purple  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("ucc"        . ,(all-the-icons-material "computer"       :face 'all-the-icons-silver  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("assignment" . ,(all-the-icons-material "library_books"  :face 'all-the-icons-orange  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("test"       . ,(all-the-icons-material "timer"          :face 'all-the-icons-red     :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("lecture"    . ,(all-the-icons-fileicon "keynote"        :face 'all-the-icons-orange  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("email"      . ,(all-the-icons-faicon   "envelope"       :face 'all-the-icons-blue    :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("read"       . ,(all-the-icons-octicon  "book"           :face 'all-the-icons-lblue   :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("article"    . ,(all-the-icons-octicon  "file-text"      :face 'all-the-icons-yellow  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("web"        . ,(all-the-icons-faicon   "globe"          :face 'all-the-icons-green   :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("info"       . ,(all-the-icons-faicon   "info-circle"    :face 'all-the-icons-blue    :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("issue"      . ,(all-the-icons-faicon   "bug"            :face 'all-the-icons-red     :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("someday"    . ,(all-the-icons-faicon   "calendar-o"     :face 'all-the-icons-cyan    :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("idea"       . ,(all-the-icons-octicon  "light-bulb"     :face 'all-the-icons-yellow  :v-adjust 0.01))</span>
<span style="color: #5a5b5a;">;;          </span><span style="color: #5a5b5a;">("emacs"      . ,(all-the-icons-fileicon "emacs"          :face 'all-the-icons-lpurple :v-adjust 0.01))))</span>
<span style="color: #5a5b5a;">;;  </span><span style="color: #5a5b5a;">(org-pretty-tags-global-mode))</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> org-superstar
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">org-superstar-headline-bullets-list '("&#9673;" "&#9675;" "&#10040;" "&#10047;" "&#10020;" "&#10012;" "&#9670;" "&#9654;")</span>
        <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">org-superstar-headline-bullets-list '("&#8544;" "&#8545;" "&#8546;" "&#8547;" "&#8548;" "&#8549;" "&#8550;" "&#8551;" "&#8552;" "&#8553;")</span>
        org-superstar-prettify-item-bullets t <span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-ellipsis</span> <span style="color: #b5bd68;">" &#9662; "</span>
      <span style="color: #cc6666;">org-hide-leading-stars</span> t
      <span style="color: #cc6666;">org-priority-highest</span> ?A
      <span style="color: #cc6666;">org-priority-lowest</span> ?E
      <span style="color: #cc6666;">org-priority-faces</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span>?A . <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-red</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>?B . <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-orange</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>?C . <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-yellow</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>?D . <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-green</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>?E . <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">all-the-icons-blue</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
                <p>
                  It&rsquo;s also nice to make use of the Unicode characters for
                  check boxes, and other commands.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">appendq!</span> <span style="color: #cc6666;">+ligatures-extra-symbols</span>
          <span style="color: #81a2be;">(</span><span style="color: #de935f;">list</span>
           <span style="color: #81a2be;">:list_property</span> <span style="color: #b5bd68;">"&#8759;"</span>
           <span style="color: #81a2be;">:em_dash</span>       <span style="color: #b5bd68;">"&#8212;"</span>
           <span style="color: #81a2be;">:ellipses</span>      <span style="color: #b5bd68;">"&#8230;"</span>
           <span style="color: #81a2be;">:arrow_right</span>   <span style="color: #b5bd68;">"&#8594;"</span>
           <span style="color: #81a2be;">:arrow_left</span>    <span style="color: #b5bd68;">"&#8592;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:title         "&#120399;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:subtitle      "&#120425;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:author        "&#120380;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:date          "&#120383;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:latex_class   "&#127282;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:attr_latex    "&#127259;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:attr_html     "&#127255;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:begin_quote   "&#10077;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:end_quote     "&#10078;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:caption       "&#9776;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:header        "&#8250;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:bibliography  "&#62469;"</span>
           <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">:print_biblio  "&#58699;"</span>
           <span style="color: #81a2be;">)</span>
          <span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> +org-init-appearance-h--no-ligatures-a <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+org-init-appearance-h</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-ligatures!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span> nil<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-ligatures!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span>
    <span style="color: #81a2be;">:list_property</span> <span style="color: #b5bd68;">"::"</span>
    <span style="color: #81a2be;">:em_dash</span>       <span style="color: #b5bd68;">"---"</span>
    <span style="color: #81a2be;">:ellipsis</span>      <span style="color: #b5bd68;">"..."</span>
    <span style="color: #81a2be;">:arrow_right</span>   <span style="color: #b5bd68;">"-&gt;"</span>
    <span style="color: #81a2be;">:arrow_left</span>    <span style="color: #b5bd68;">"&lt;-"</span>
    <span style="color: #81a2be;">:arrow_lr</span>      <span style="color: #b5bd68;">"&lt;-&gt;"</span>
    <span style="color: #81a2be;">:properties</span>    <span style="color: #b5bd68;">":PROPERTIES:"</span>
    <span style="color: #81a2be;">:end</span>           <span style="color: #b5bd68;">":END:"</span>
    <span style="color: #81a2be;">:priority_a</span>    <span style="color: #b5bd68;">"[#A]"</span>
    <span style="color: #81a2be;">:priority_b</span>    <span style="color: #b5bd68;">"[#B]"</span>
    <span style="color: #81a2be;">:priority_c</span>    <span style="color: #b5bd68;">"[#C]"</span>
    <span style="color: #81a2be;">:priority_d</span>    <span style="color: #b5bd68;">"[#D]"</span>
    <span style="color: #81a2be;">:priority_e</span>    <span style="color: #b5bd68;">"[#E]"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(set-ligatures! 'org-mode</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:merge t</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:list_property "::"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:em_dash       "---"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:ellipsis      "..."</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:arrow_right   "-&gt;"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">:arrow_left    "&lt;-"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :title         "#+title:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :subtitle      "#+subtitle:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :author        "#+author:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :date          "#+date:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :latex_class   "#+latex_class:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :attr_latex    "#+attr_latex:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :attr_html     "#+attr_html:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :begin_quote   "#+begin_quote"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :end_quote     "#+end_quote"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :caption       "#+caption:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :header        "#+header:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :bibliography  "#+bibliography:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">;; :print-biblio  "#+print_bibliography:"</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">)</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(plist-put +ligatures-extra-symbols :name "&#8269;")</span>
</pre>
                </div>
              </div>
            </div>
