config/doom/config.html

            <div id="outline-container-orgd5bdaa5" class="outline-5">
              <h5 id="orgd5bdaa5">
                <span class="section-number-5">5.7.2.7.</span> LaTeX Fragments
              </h5>
              <div class="outline-text-5" id="text-5-7-2-7"></div>
              <div id="outline-container-org5efe4fb" class="outline-6">
                <h6 id="org5efe4fb">
                  <span class="section-number-6">5.7.2.7.1.</span> Prettier
                  highlighting
                </h6>
                <div class="outline-text-6" id="text-5-7-2-7-1">
                  <p>First off, we want those fragments to look good.</p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-highlight-latex-and-related</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>native script entities<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>

                  <p>
                    However, by using <code>native</code> highlighting the
                    <code>org-block</code> face is added, and that doesn&rsquo;t
                    look too great &#x2014; particularly when the fragments are
                    previewed.
                  </p>

                  <p>
                    Ideally
                    <code>org-src-font-lock-fontify-block</code> wouldn&rsquo;t
                    add the <code>org-block</code> face, but we can avoid
                    advising that entire function by just adding another face
                    with <code>:inherit default</code> which will override the
                    background colour.
                  </p>

                  <p>
                    Inspecting <code>org-do-latex-and-related</code> shows that
                    <code>"latex"</code> is the language argument passed, and so
                    we can override the background as discussed above.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #de935f;">require</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">org-src</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-src-block-faces</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"latex"</span> <span style="color: #de935f;">(</span><span style="color: #81a2be;">:inherit</span> default <span style="color: #81a2be;">:extend</span> t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>

              <div id="outline-container-org3a00c44" class="outline-6">
                <h6 id="org3a00c44">
                  <span class="section-number-6">5.7.2.7.2.</span> More eager
                  rendering
                </h6>
                <div class="outline-text-6" id="text-5-7-2-7-2">
                  <p>
                    What&rsquo;s better than syntax-highlighted LaTeX is
                    <i>rendered</i> LaTeX though, and we can have this be
                    performed automatically with <code>org-fragtog</code>.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> org-fragtog
  <span style="color: #81a2be;">:hook</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">org-mode</span> . <span style="color: #cc6666;">org-fragtog-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
              <div id="outline-container-org38e47cb" class="outline-6">
                <h6 id="org38e47cb">
                  <span class="section-number-6">5.7.2.7.3.</span> Prettier
                  rendering
                </h6>
                <div class="outline-text-6" id="text-5-7-2-7-3">
                  <p>
                    Since we can, instead of making the background colour match
                    the <code>default</code> face, let&rsquo;s make it
                    transparent.
                  </p>
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-format-latex-options</span>
      <span style="color: #81a2be;">(</span><span style="color: #de935f;">plist-put</span> <span style="color: #cc6666;">org-format-latex-options</span> <span style="color: #81a2be;">:background</span> <span style="color: #b5bd68;">"Transparent"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
              <div id="outline-container-org1aa67b3" class="outline-6">
                <h6 id="org1aa67b3">
                  <span class="section-number-6">5.7.2.7.4.</span> Fixes for
                  lualatex
                </h6>
                <div class="outline-text-6" id="text-5-7-2-7-4">
                  <div class="org-src-container">
                    <pre
                      class="src src-emacs-lisp"
                    ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-preview-latex-default-process</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">dvisvgm</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-preview-latex-process-alist</span>
       <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span>dvipng <span style="color: #81a2be;">:programs</span>
         <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"lualatex"</span> <span style="color: #b5bd68;">"dvipng"</span><span style="color: #b5bd68;">)</span>
         <span style="color: #81a2be;">:description</span> <span style="color: #b5bd68;">"dvi &gt; png"</span> <span style="color: #81a2be;">:message</span> <span style="color: #b5bd68;">"you need to install the programs: latex and dvipng."</span> <span style="color: #81a2be;">:image-input-type</span> <span style="color: #b5bd68;">"dvi"</span> <span style="color: #81a2be;">:image-output-type</span> <span style="color: #b5bd68;">"png"</span> <span style="color: #81a2be;">:image-size-adjust</span>
         <span style="color: #b5bd68;">(</span><span style="color: #de935f; font-weight: bold;">1.0</span> . <span style="color: #de935f; font-weight: bold;">1.0</span><span style="color: #b5bd68;">)</span>
         <span style="color: #81a2be;">:latex-compiler</span>
         <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"lualatex -output-format dvi -interaction nonstopmode -output-directory %o %f"</span><span style="color: #b5bd68;">)</span>
         <span style="color: #81a2be;">:image-converter</span>
         <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"dvipng -fg %F -bg %B -D %D -T tight -o %O %f"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
       <span style="color: #de935f;">(</span>dvisvgm <span style="color: #81a2be;">:programs</span>
          <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex"</span> <span style="color: #b5bd68;">"dvisvgm"</span><span style="color: #b5bd68;">)</span>
          <span style="color: #81a2be;">:description</span> <span style="color: #b5bd68;">"dvi &gt; svg"</span> <span style="color: #81a2be;">:message</span> <span style="color: #b5bd68;">"you need to install the programs: latex and dvisvgm."</span> <span style="color: #81a2be;">:use-xcolor</span> t <span style="color: #81a2be;">:image-input-type</span> <span style="color: #b5bd68;">"xdv"</span> <span style="color: #81a2be;">:image-output-type</span> <span style="color: #b5bd68;">"svg"</span> <span style="color: #81a2be;">:image-size-adjust</span>
          <span style="color: #b5bd68;">(</span><span style="color: #de935f; font-weight: bold;">1.7</span> . <span style="color: #de935f; font-weight: bold;">1.5</span><span style="color: #b5bd68;">)</span>
          <span style="color: #81a2be;">:latex-compiler</span>
          <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"xelatex -no-pdf -interaction nonstopmode -output-directory %o %f"</span><span style="color: #b5bd68;">)</span>
          <span style="color: #81a2be;">:image-converter</span>
          <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"dvisvgm %f -n -b min -c %S -o %O"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
       <span style="color: #de935f;">(</span>imagemagick <span style="color: #81a2be;">:programs</span>
              <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"latex"</span> <span style="color: #b5bd68;">"convert"</span><span style="color: #b5bd68;">)</span>
              <span style="color: #81a2be;">:description</span> <span style="color: #b5bd68;">"pdf &gt; png"</span> <span style="color: #81a2be;">:message</span> <span style="color: #b5bd68;">"you need to install the programs: latex and imagemagick."</span> <span style="color: #81a2be;">:use-xcolor</span> t <span style="color: #81a2be;">:image-input-type</span> <span style="color: #b5bd68;">"pdf"</span> <span style="color: #81a2be;">:image-output-type</span> <span style="color: #b5bd68;">"png"</span> <span style="color: #81a2be;">:image-size-adjust</span>
              <span style="color: #b5bd68;">(</span><span style="color: #de935f; font-weight: bold;">1.0</span> . <span style="color: #de935f; font-weight: bold;">1.0</span><span style="color: #b5bd68;">)</span>
              <span style="color: #81a2be;">:latex-compiler</span>
              <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"xelatex -no-pdf -interaction nonstopmode -output-directory %o %f"</span><span style="color: #b5bd68;">)</span>
              <span style="color: #81a2be;">:image-converter</span>
              <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"convert -density %D -trim -antialias %f -quality 100 %O"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                  </div>
                </div>
              </div>
            </div>
          </div>
