config/doom/config.html

          <div id="outline-container-orga10a1b2" class="outline-4">
            <h4 id="orga10a1b2">
              <span class="section-number-4">5.7.3.</span> Exporting
            </h4>
            <div class="outline-text-4" id="text-5-7-3"></div>
            <div id="outline-container-org720d7d2" class="outline-5">
              <h5 id="org720d7d2">
                <span class="section-number-5">5.7.3.1.</span> Exporting Org
                code
              </h5>
              <div class="outline-text-5" id="text-5-7-3-1">
                <p>
                  With all our Org config and hooks, exporting an Org code block
                  when using a font-lock based method can produce undesirable
                  results. To address this, we can tweak
                  <code>+org-babel-mode-alist</code> when exporting.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+org-mode--fontlock-only-mode</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Just apply org-mode's font-lock once."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #cc6666;">org-mode-hook</span>
        <span style="color: #cc6666;">org-hide-leading-stars</span>
        <span style="color: #cc6666;">org-hide-emphasis-markers</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">org-set-font-lock-defaults</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">font-lock-ensure</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">fundamental-mode</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">+org-export-babel-mask-org-config</span> <span style="color: #81a2be;">(</span>_backend<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Use `</span><span style="color: #de935f;">+org-mode--fontlock-only-mode</span><span style="color: #717171;">' instead of `</span><span style="color: #de935f;">org-mode</span><span style="color: #717171;">'."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq-local</span> <span style="color: #cc6666;">org-src-lang-modes</span>
              <span style="color: #de935f;">(</span><span style="color: #de935f;">append</span> <span style="color: #cc6666;">org-src-lang-modes</span>
                      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">list</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">cons</span> <span style="color: #b5bd68;">"org"</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+org-mode--fontlock-only</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #de935f;">add-hook</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-export-before-processing-hook</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">+org-export-babel-mask-org-config</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>

            <div id="outline-container-orgff2f5f4" class="outline-5">
              <h5 id="orgff2f5f4">
                <span class="section-number-5">5.7.3.2.</span> General settings
              </h5>
              <div class="outline-text-5" id="text-5-7-3-2">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-export-headline-levels</span> <span style="color: #de935f; font-weight: bold;">5</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">I like nesting</span>
</pre>
                </div>
                <p>
                  I&rsquo;m also going to make use of an item in
                  <code>ox-extra</code> so that I can add an
                  <code>:ignore:</code> tag to headings for the content to be
                  kept, but the heading itself ignored (unlike
                  <code>:noexport:</code> which ignored both heading and
                  content). This is useful when I want to use headings to
                  provide a structure for writing that doesn&rsquo;t appear in
                  the final documents.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #de935f;">require</span> <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">ox-extra</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #de935f;">ox-extras-activate</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>ignore-headlines<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
          </div>

          <div id="outline-container-orga71dd14" class="outline-4">
            <h4 id="orga71dd14">
              <span class="section-number-4">5.7.4.</span> LaTeX Export
            </h4>
            <div class="outline-text-4" id="text-5-7-4"></div>
            <div id="outline-container-org125401e" class="outline-5">
              <h5 id="org125401e">
                <span class="section-number-5">5.7.4.1.</span> Compiling
              </h5>
              <div class="outline-text-5" id="text-5-7-4-1">
                <p>
                  By default Org uses <code>pdflatex</code> &times; 3 +
                  <code>bibtex</code>. This simply won&rsquo;t do in our modern
                  world. <code>latexmk</code> + <code>biber</code> (which is
                  used automatically with <code>latexmk</code>) is a simply
                  superior combination.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">org-latex-compilers = ("pdflatex" "xelatex" "lualatex"), which are the possible values for %latex</span>
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(setq org-latex-pdf-process '("latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"))</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-latex-pdf-process</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #b5bd68;">"LC_ALL=en_US.UTF-8 latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  While <code>org-latex-pdf-process</code> does support a
                  function, and we could use that instead, this would no longer
                  use the log buffer &#x2014; it&rsquo;s a bit blind, you give
                  it the file name and expect it to do its thing.
                </p>

                <p>
                  The default values of <code>org-latex-compilers</code> is
                  given in commented form to see how
                  <code>org-latex-pdf-process</code> works with them.
                </p>

                <p>
                  While the <code>-%latex</code> above is slightly hacky (<code
                    >-pdflatex</code
                  >
                  expects to be given a value) it allows us to leave
                  <code>org-latex-compilers</code> unmodified. This is nice in
                  case I open an org file that uses
                  <code>#+LATEX_COMPILER</code> for example, it should still
                  work.
                </p>
              </div>
            </div>
