config/doom/config.html

            <div id="outline-container-org3a6e8da" class="outline-5">
              <h5 id="org3a6e8da">
                <span class="section-number-5">5.7.4.2.</span> Class templates
              </h5>
              <div class="outline-text-5" id="text-5-7-4-2">
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> ox-latex
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"scr-article"</span>
                 <span style="color: #b5bd68;">"\\documentclass{scrartcl}"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"blank"</span>
                 <span style="color: #b5bd68;">"[NO-DEFAULT-PACKAGES]\n[NO-PACKAGES]\n[EXTRA]"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"bmc-article"</span>
                 <span style="color: #b5bd68;">"\\documentclass[article,code,maths]{bmc}\n[NO-DEFAULT-PACKAGES]\n[NO-PACKAGES]\n[EXTRA]"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"bmc"</span>
                 <span style="color: #b5bd68;">"\\documentclass[code,maths]{bmc}\n[NO-DEFAULT-PACKAGES]\n[NO-PACKAGES]\n[EXTRA]"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\chapter{%s}"</span> . <span style="color: #b5bd68;">"\\chapter*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"memoir"</span> <span style="color: #b5bd68;">"\\documentclass{memoir}"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">add-to-list</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">org-latex-classes</span>
               <span style="color: #c5c8c6;">'</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"scrlttr2"</span> <span style="color: #b5bd68;">"\\documentclass{scrlttr2}"</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\section{%s}"</span> . <span style="color: #b5bd68;">"\\section*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subsubsection{%s}"</span> . <span style="color: #b5bd68;">"\\subsubsection*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\paragraph{%s}"</span> . <span style="color: #b5bd68;">"\\paragraph*{%s}"</span><span style="color: #b5bd68;">)</span>
                 <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">"\\subparagraph{%s}"</span> . <span style="color: #b5bd68;">"\\subparagraph*{%s}"</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-latex-default-class</span> <span style="color: #b5bd68;">"scr-article"</span>
      <span style="color: #cc6666;">org-latex-tables-booktabs</span> t
      <span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
