config/doom/config.html
            <div id="outline-container-org4731cb0" class="outline-5">
              <h5 id="org4731cb0">
                <span class="section-number-5">5.7.4.3.</span> Extra special
                strings
              </h5>
              <div class="outline-text-5" id="text-5-7-4-3">
                <p>
                  LaTeX already recognises <code>---</code> and
                  <code>--</code> as em/en-dashes, <code>\-</code> as a shy
                  hyphen, and the conversion of <code>...</code> to
                  <code>\ldots{}</code> is hardcoded into
                  <code>org-latex-plain-text</code> (unlike
                  <code>org-html-plain-text</code>).
                </p>

                <p>
                  I&rsquo;d quite like to also recognise <code>-&gt;</code> and
                  <code>&lt;-</code>, so let&rsquo;s set come up with some
                  advice.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-latex-extra-special-string-regexps</span>
  <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span><span style="color: #b5bd68;">"-&gt;"</span> . <span style="color: #b5bd68;">"\\\\textrightarrow{}"</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b5bd68;">"&lt;-"</span> . <span style="color: #b5bd68;">"\\\\textleftarrow{}"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-latex-convert-extra-special-strings</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">string</span><span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Convert special characters in STRING to LaTeX."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">dolist</span> <span style="color: #de935f;">(</span>a <span style="color: #cc6666;">org-latex-extra-special-string-regexps</span> string<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">let</span> <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">(</span>re <span style="color: #81a2be;">(</span><span style="color: #de935f;">car</span> a<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
          <span style="color: #b294bb;">(</span>rpl <span style="color: #81a2be;">(</span><span style="color: #de935f;">cdr</span> a<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span> string <span style="color: #b294bb;">(</span><span style="color: #de935f;">replace-regexp-in-string</span> re rpl string t<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> org-latex-plain-text-extra-special-a <span style="color: #81a2be;">(</span>orig-fn text info<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Make `</span><span style="color: #de935f;">org-latex-plain-text</span><span style="color: #717171;">' handle some extra special strings."</span>
  <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-latex-plain-text</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>output <span style="color: #b294bb;">(</span><span style="color: #de935f;">funcall</span> orig-fn text info<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:with-special-strings</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">setq</span> output <span style="color: #b294bb;">(</span><span style="color: #81a2be;">org-latex-convert-extra-special-strings</span> output<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    output<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>

            <div id="outline-container-org234d24a" class="outline-5">
              <h5 id="org234d24a">
                <span class="section-number-5">5.7.4.4.</span> Make verbatim
                different to code
              </h5>
              <div class="outline-text-5" id="text-5-7-4-4">
                <p>
                  Since have just gone to so much effort above let&rsquo;s make
                  the most of it by making
                  <code>verbatim</code> use <code>verb</code> instead of
                  <code>protectedtexttt</code> (default).
                </p>

                <p>
                  This gives the same advantages as mentioned in the
                  <a href="#org234d24a">HTML export section</a>.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-latex-text-markup-alist</span>
      <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span><span style="color: #de935f;">(</span>bold . <span style="color: #b5bd68;">"\\textbf{%s}"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>code . protectedtexttt<span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>italic . <span style="color: #b5bd68;">"\\emph{%s}"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>strike-through . <span style="color: #b5bd68;">"\\sout{%s}"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>underline . <span style="color: #b5bd68;">"\\uline{%s}"</span><span style="color: #de935f;">)</span>
        <span style="color: #de935f;">(</span>verbatim . verb<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
