config/doom/config.html
            <div id="outline-container-orgca1baec" class="outline-5">
              <h5 id="orgca1baec">
                <span class="section-number-5">5.7.4.5.</span> Support images
                from URLs
              </h5>
              <div class="outline-text-5" id="text-5-7-4-5">
                <p>
                  You can link to remote images easily, and they work nicely
                  with HTML-based exports. However, LaTeX can only include local
                  files, and so the current behaviour of
                  <code>org-latex-link</code> is just to insert a URL to the
                  image.
                </p>

                <p>
                  We can do better than that by downloading the image to a
                  predictable location, and using that. By making the filename
                  predictable as opposed to just another tempfile, this can
                  provide a caching mechanism.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> +org-latex-link <span style="color: #81a2be;">(</span>orig-fn link desc info<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Acts as `</span><span style="color: #de935f;">org-latex-link</span><span style="color: #717171;">', but supports remote images."</span>
  <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-latex-link</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> o-link link
        o-desc desc
        o-info info<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #b294bb;">and</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">member</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-get</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">cadr</span> link<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">:type</span><span style="color: #b294bb;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"http"</span> <span style="color: #b5bd68;">"https"</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
           <span style="color: #b5bd68;">(</span><span style="color: #de935f;">member</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">file-name-extension</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">plist-get</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">cadr</span> link<span style="color: #de935f;">)</span> <span style="color: #81a2be;">:path</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
                   <span style="color: #c5c8c6;">'</span><span style="color: #b294bb;">(</span><span style="color: #b5bd68;">"png"</span> <span style="color: #b5bd68;">"jpg"</span> <span style="color: #b5bd68;">"jpeg"</span> <span style="color: #b5bd68;">"pdf"</span> <span style="color: #b5bd68;">"svg"</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-latex-link--remote</span> link desc info<span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">funcall</span> orig-fn link desc info<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">org-latex-link--remote</span> <span style="color: #81a2be;">(</span>link _desc info<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>url <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-get</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">cadr</span> link<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">:raw-link</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>ext <span style="color: #b294bb;">(</span><span style="color: #de935f;">file-name-extension</span> url<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
         <span style="color: #b5bd68;">(</span>target <span style="color: #b294bb;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"%s%s.%s"</span>
                         <span style="color: #81a2be;">(</span><span style="color: #cc6666;">temporary-file-directory</span><span style="color: #81a2be;">)</span>
                         <span style="color: #81a2be;">(</span><span style="color: #de935f;">replace-regexp-in-string</span> <span style="color: #b5bd68;">"[./]"</span> <span style="color: #b5bd68;">"-"</span>
                                                   <span style="color: #de935f;">(</span><span style="color: #de935f;">file-name-sans-extension</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">substring</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-get</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">cadr</span> link<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">:path</span><span style="color: #b294bb;">)</span> <span style="color: #de935f; font-weight: bold;">2</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
                         ext<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">file-exists-p</span> target<span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">url-copy-file</span> url target<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">setcdr</span> link <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">--&gt;</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">cadr</span> link<span style="color: #b294bb;">)</span>
                   <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-put</span> it <span style="color: #81a2be;">:type</span> <span style="color: #b5bd68;">"file"</span><span style="color: #b294bb;">)</span>
                   <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-put</span> it <span style="color: #81a2be;">:path</span> target<span style="color: #b294bb;">)</span>
                   <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-put</span> it <span style="color: #81a2be;">:raw-link</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">concat</span> <span style="color: #b5bd68;">"file:"</span> target<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
                   <span style="color: #b294bb;">(</span><span style="color: #de935f;">list</span> it<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">concat</span> <span style="color: #b5bd68;">"% fetched from "</span> url <span style="color: #b5bd68;">"\n"</span>
            <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-latex--inline-image</span> link info<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>
              </div>
            </div>
