config/doom/config.html
            <div id="outline-container-orga6f39c7" class="outline-5">
              <h5 id="orga6f39c7">
                <span class="section-number-5">5.7.4.6.</span> Pretty code
                blocks
              </h5>
              <div class="outline-text-5" id="text-5-7-4-6">
                <p>
                  We could just use minted for syntax highlighting &#x2014;
                  however, we can do better! The
                  <code>engrave-faces</code> package lets us use Emacs&rsquo;
                  font-lock for syntax highlighting, exporting that as LaTeX
                  commands.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">package!</span> engrave-faces <span style="color: #81a2be;">:recipe</span> <span style="color: #81a2be;">(</span><span style="color: #81a2be;">:local-repo</span> <span style="color: #b5bd68;">"tecosaur/engrave-faces"</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> engrave-faces-latex
  <span style="color: #81a2be;">:config</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">engrave-faces-preset-styles</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">engrave-faces-generate-preset</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:after</span> ox-latex<span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  We&rsquo;ll modify the way listings are generated to make
                  using this as easy as:
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-latex-listings</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">engraved</span><span style="color: #b294bb;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #b5bd68; font-weight: bold;">NOTE</span><span style="color: #5a5b5a;"> non-standard value</span>
</pre>
                </div>

                <p>
                  Thanks to <code>org-latex-conditional-features</code> and some
                  copy-paste with the <code>minted</code> entry in
                  <code>org-latex-scr-block</code> we can easily add this as a
                  recognised <code>org-latex-listings</code> value.
                </p>

                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defvar-local</span> <span style="color: #cc6666;">org-export-has-code-p</span> nil<span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> org-export-expect-no-code <span style="color: #81a2be;">(</span><span style="color: #f0c674;">&amp;rest</span> _<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:before</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-export-as</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-export-has-code-p</span> nil<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> org-export-register-code <span style="color: #81a2be;">(</span><span style="color: #f0c674;">&amp;rest</span> _<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-latex-src-block</span>
  <span style="color: #81a2be;">:after</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-latex-inline-src-block-engraved</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-export-has-code-p</span> t<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  Whenever this is used, in order for it to actually work (and
                  look a little better) we add bit to the preamble:
                </p>

                <p>
                  At some point it would be nice to make the box colours easily
                  customisable. At the moment it&rsquo;s fairly easy to change
                  the syntax highlighting colours with
                  <code class="src src-elisp"
                    ><span style="color: #b294bb">(</span
                    ><span style="color: #b294bb">setq</span>
                    <span style="color: #cc6666"
                      >engrave-faces-preset-styles</span
                    >
                    <span style="color: #81a2be">(</span
                    ><span style="color: #de935f"
                      >engrave-faces-generate-preset</span
                    ><span style="color: #81a2be">)</span
                    ><span style="color: #b294bb">)</span></code
                  >, but perhaps a toggle which specifies whether to use the
                  default values, the current theme, or any named theme could be
                  a good idea. It should also possible to set the box background
                  dynamically to match. The named theme could work by looking
                  for a style definition with a certain name in a cache dir, and
                  then switching to that theme and producing (and saving) the
                  style definition if it doesn&rsquo;t exist.
                </p>

                <p>
                  Now let&rsquo;s have the example block be styled similarly.
                </p>
                <div class="org-src-container">
                  <pre
                    class="src src-emacs-lisp"
                  ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defadvice!</span> org-latex-example-block-engraved <span style="color: #81a2be;">(</span>orig-fn example-block contents info<span style="color: #81a2be;">)</span>
  <span style="color: #717171;">"Like `</span><span style="color: #de935f;">org-latex-example-block</span><span style="color: #717171;">', but supporting an engraved backend"</span>
  <span style="color: #81a2be;">:around</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-latex-example-block</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>output-block <span style="color: #b294bb;">(</span><span style="color: #de935f;">funcall</span> orig-fn example-block contents info<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eq</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">engraved</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:latex-listings</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
        <span style="color: #b5bd68;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"\\begin{Code}[alt]\n%s\n\\end{Code}"</span> output-block<span style="color: #b5bd68;">)</span>
      output-block<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
                </div>

                <p>
                  In addition to the vastly superior visual output, this should
                  also be much faster to compile for code-heavy documents (like
                  this config).
                </p>

                <p>
                  Performing a little benchmark with this document, I find that
                  this is indeed the case.
                </p>

                <table
                  border="2"
                  cellspacing="0"
                  cellpadding="6"
                  rules="groups"
                  frame="hsides"
                >
                  <colgroup>
                    <col class="org-left" />

                    <col class="org-left" />

                    <col class="org-left" />

                    <col class="org-right" />
                  </colgroup>
                  <thead>
                    <tr>
                      <th scope="col" class="org-left">
                        LaTeX syntax highlighting backend
                      </th>
                      <th scope="col" class="org-left">Compile time</th>
                      <th scope="col" class="org-left">Overhead</th>
                      <th scope="col" class="org-right">Overhead ratio</th>
                    </tr>
                  </thead>
                  <tbody>
                    <tr>
                      <td class="org-left">verbatim</td>
                      <td class="org-left">12 s</td>
                      <td class="org-left">0</td>
                      <td class="org-right">0.0</td>
                    </tr>

                    <tr>
                      <td class="org-left">lstlistings</td>
                      <td class="org-left">15 s</td>
                      <td class="org-left">3 s</td>
                      <td class="org-right">0.2</td>
                    </tr>

                    <tr>
                      <td class="org-left">Engrave</td>
                      <td class="org-left">34 s</td>
                      <td class="org-left">22 s</td>
                      <td class="org-right">1.8</td>
                    </tr>

                    <tr>
                      <td class="org-left">Pygments (Minted)</td>
                      <td class="org-left">184 s</td>
                      <td class="org-left">172 s</td>
                      <td class="org-right">14.3</td>
                    </tr>
                  </tbody>
                </table>

                <p>
                  Treating the verbatim (no syntax highlighting) result as a
                  baseline; this rudimentary test suggest that
                  <code>engrave-faces</code> is around eight times faster than
                  <code>pygments</code>, and takes three times as long as no
                  syntax highlighting (verbatim).
                </p>
              </div>
            </div>
          </div>
