config/doom/config.html

          <div id="outline-container-orge407a3a" class="outline-4">
            <h4 id="orge407a3a">
              <span class="section-number-4">5.7.5.</span> Beamer Export
            </h4>
            <div class="outline-text-4" id="text-5-7-5">
              <p>It&rsquo;s nice to use a different theme by default</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-beamer-theme</span> <span style="color: #b5bd68;">"[progressbar=foot]metropolis"</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                And I think that it&rsquo;s natural to divide a presentation
                into sections, e.g. Introduction, Overview&#x2026; so
                let&rsquo;s set bump up the headline level that becomes a frame
                from <code>1</code> to <code>2</code>.
              </p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-beamer-frame-level</span> <span style="color: #de935f; font-weight: bold;">2</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org927af9b" class="outline-4">
            <h4 id="org927af9b">
              <span class="section-number-4">5.7.6.</span> ASCII export
            </h4>
            <div class="outline-text-4" id="text-5-7-6">
              <p>To start with, why settle for ASCII when UTF-8 exists?</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-ascii-charset</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">utf-8</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>
                The ASCII export is generally fairly nice. I think the main
                aspect that could benefit from improvement is the appearance of
                LaTeX fragments. There&rsquo;s a nice utility we can use to
                create unicode representation, which are much nicer. It&rsquo;s
                called <code>latex2text</code>, and it&rsquo;s part of the
                <code>pylatexenc</code> package, and it&rsquo;s
                <a
                  href="https://repology.org/project/python:pylatexenc/versions"
                  >not really packaged</a
                >. So, we&rsquo;ll resort to installing it with
                <code>pip</code>.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-shell"
                ><span style="color: #81a2be; font-weight: bold;">sudo</span> python3 <span style="color: #de935f;">-m</span> pip install pylatexenc
</pre>
              </div>

              <p>
                With that installed, we can override the
                <code class="src src-elisp"
                  ><span style="color: #b294bb">(</span
                  ><span style="color: #de935f">org-ascii-latex-fragment</span
                  ><span style="color: #b294bb">)</span></code
                >
                and
                <code class="src src-elisp"
                  ><span style="color: #b294bb">(</span
                  ><span style="color: #de935f"
                    >org-ascii-latex-environment</span
                  ><span style="color: #b294bb">)</span></code
                >
                functions, which are conveniently very slim &#x2014; just
                extracting the content, and indenting. We&rsquo;ll only do
                something different when <code>utf-8</code> is set.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> ox-ascii
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defvar</span> <span style="color: #cc6666;">org-ascii-convert-latex</span> t
    <span style="color: #717171;">"Use latex2text to convert LaTeX elements to unicode."</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defadvice!</span> org-ascii-latex-environment-unicode-a <span style="color: #de935f;">(</span>latex-environment _contents info<span style="color: #de935f;">)</span>
    <span style="color: #717171;">"Transcode a LATEX-ENVIRONMENT element from Org to ASCII, converting to unicode.</span>
<span style="color: #717171;">CONTENTS is nil.  INFO is a plist holding contextual</span>
<span style="color: #717171;">information."</span>
    <span style="color: #81a2be;">:override</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-ascii-latex-environment</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:with-latex</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #de935f;">org-ascii--justify-element</span>
       <span style="color: #b294bb;">(</span><span style="color: #de935f;">org-remove-indentation</span>
        <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span>latex <span style="color: #b294bb;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:value</span> latex-environment<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span>
               <span style="color: #b5bd68;">(</span>unicode <span style="color: #b294bb;">(</span><span style="color: #b294bb;">and</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">eq</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:ascii-charset</span><span style="color: #de935f;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">utf-8</span><span style="color: #81a2be;">)</span>
                             <span style="color: #cc6666;">org-ascii-convert-latex</span>
                             <span style="color: #81a2be;">(</span><span style="color: #81a2be;">doom-call-process</span> <span style="color: #b5bd68;">"latex2text"</span> <span style="color: #b5bd68;">"-q"</span> <span style="color: #b5bd68;">"--code"</span> latex<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
          <span style="color: #de935f;">(</span><span style="color: #b294bb;">if</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">=</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">car</span> unicode<span style="color: #b294bb;">)</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #b5bd68;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">utf-8 set, and sucessfully ran latex2text</span>
              <span style="color: #b5bd68;">(</span><span style="color: #de935f;">cdr</span> unicode<span style="color: #b5bd68;">)</span> latex<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
       latex-environment info<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>

  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">defadvice!</span> org-ascii-latex-fragment-unicode-a <span style="color: #de935f;">(</span>latex-fragment _contents info<span style="color: #de935f;">)</span>
    <span style="color: #717171;">"Transcode a LATEX-FRAGMENT object from Org to ASCII, converting to unicode.</span>
<span style="color: #717171;">CONTENTS is nil.  INFO is a plist holding contextual</span>
<span style="color: #717171;">information."</span>
    <span style="color: #81a2be;">:override</span> <span style="color: #c5c8c6;">#'</span><span style="color: #f0c674;">org-ascii-latex-fragment</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">when</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:with-latex</span><span style="color: #b5bd68;">)</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">let*</span> <span style="color: #b294bb;">(</span><span style="color: #81a2be;">(</span>latex <span style="color: #de935f;">(</span><span style="color: #81a2be;">org-element-property</span> <span style="color: #81a2be;">:value</span> latex-fragment<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
             <span style="color: #81a2be;">(</span>unicode <span style="color: #de935f;">(</span><span style="color: #b294bb;">and</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">eq</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">plist-get</span> info <span style="color: #81a2be;">:ascii-charset</span><span style="color: #b294bb;">)</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">utf-8</span><span style="color: #b5bd68;">)</span>
                           <span style="color: #cc6666;">org-ascii-convert-latex</span>
                             <span style="color: #b5bd68;">(</span><span style="color: #81a2be;">doom-call-process</span> <span style="color: #b5bd68;">"latex2text"</span> <span style="color: #b5bd68;">"-q"</span> <span style="color: #b5bd68;">"--code"</span> latex<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
        <span style="color: #b294bb;">(</span><span style="color: #b294bb;">if</span> <span style="color: #81a2be;">(</span><span style="color: #b294bb;">and</span> unicode <span style="color: #de935f;">(</span><span style="color: #de935f;">=</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">car</span> unicode<span style="color: #b5bd68;">)</span> <span style="color: #de935f; font-weight: bold;">0</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span> <span style="color: #5a5b5a;">; </span><span style="color: #5a5b5a;">utf-8 set, and sucessfully ran latex2text</span>
            <span style="color: #81a2be;">(</span><span style="color: #de935f;">cdr</span> unicode<span style="color: #81a2be;">)</span> latex<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>

          <div id="outline-container-org62987a8" class="outline-4">
            <h4 id="org62987a8">
              <span class="section-number-4">5.7.7.</span> Reveal export
            </h4>
            <div class="outline-text-4" id="text-5-7-7">
              <p>
                By default reveal is rather nice, there are just a few tweaks
                that I consider a good idea.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">org-re-reveal-theme</span> <span style="color: #b5bd68;">"white"</span>
      <span style="color: #cc6666;">org-re-reveal-transition</span> <span style="color: #b5bd68;">"slide"</span>
      <span style="color: #cc6666;">org-re-reveal-plugins</span> <span style="color: #c5c8c6;">'</span><span style="color: #81a2be;">(</span>markdown notes math search zoom<span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
