config/doom/config.org
*** Ansi colours

It's nice to see ANSI colour codes displayed. However, until Emacs 28 it's not
possible to do this without modifying the buffer, so let's condition this block
on that.

#+begin_src emacs-lisp
(after! text-mode
  (add-hook! 'text-mode-hook
    (unless (derived-mode-p 'org-mode)
      ;; Apply ANSI color codes
      (with-silent-modifications
        (ansi-color-apply-on-region (point-min) (point-max) t)))))
#+end_src

It's nice to see ANSI colour codes displayed
#+begin_src emacs-lisp
(after! text-mode
  (add-hook! 'text-mode-hook
             ;; Apply ANSI color codes
             (with-silent-modifications
               (ansi-color-apply-on-region (point-min) (point-max)))))
#+end_src
** Python
#+begin_src emacs-lisp
(after! lsp-python-ms
  (setq lsp-python-ms-executable (executable-find "python-language-server"))
  (set-lsp-priority! 'mspyls 1))
#+end_src
** Rust
Set rust-analyzer as prefered lsp-server.
#+begin_src emacs-lisp
(setq rustic-lsp-server 'rust-analyzer)
#+end_src
** CSharp
#+begin_src emacs-lisp
(use-package! html-mode
  :mode "\\.cshtml\\'"
  )
#+end_src
** HTML
#+begin_src emacs-lisp
(setq-hook! 'web-mode-hook +format-with-lsp nil)
(setq-hook! 'web-mode-hook +format-with 'prettier)
#+end_src

* Functions
** Org
Export pdf asynchronously
#+begin_src emacs-lisp
(defun leniviy/org-save-and-export-pdf ()
  (interactive)
  (if (eq major-mode 'org-mode)
      (org-latex-export-to-pdf :async t)))
#+end_src

Export TeX
#+begin_src emacs-lisp
(defun leniviy/org-save-and-export-latex ()
  (interactive)
  (if (eq major-mode 'org-mode)
      (org-latex-export-to-latex :async t)))
(defun leniviy/org-save-and-export-beamer ()
  (if (eq major-mode 'org-mode)
      (org-beamer-export-to-latex :async t)))
#+end_src

config tangling
#+begin_src emacs-lisp
(defun config-tangle ()
  (interactive)
  (shell-command
   "emacs --batch --eval \"(require 'org)\" --eval '(org-babel-tangle-file \"~/.config/doom/config.org\")'"
   ;; (concat "org-tangle " doom-private-dir "config.org" " &")
   )
  )

()
#+end_src
