config/doom/config.html
        <div id="outline-container-org7bc8b15" class="outline-3">
          <h3 id="org7bc8b15">
            <span class="section-number-3">5.8.</span> Plaintext
          </h3>
          <div class="outline-text-3" id="text-5-8"></div>
          <div id="outline-container-org83b97b8" class="outline-4">
            <h4 id="org83b97b8">
              <span class="section-number-4">5.8.1.</span> Ansi colours
            </h4>
            <div class="outline-text-4" id="text-5-8-1">
              <p>
                It&rsquo;s nice to see ANSI colour codes displayed. However,
                until Emacs 28 it&rsquo;s not possible to do this without
                modifying the buffer, so let&rsquo;s condition this block on
                that.
              </p>

              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> text-mode
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">text-mode-hook</span>
    <span style="color: #de935f;">(</span><span style="color: #b294bb;">unless</span> <span style="color: #b5bd68;">(</span><span style="color: #de935f;">derived-mode-p</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #b5bd68;">)</span>
      <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Apply ANSI color codes</span>
      <span style="color: #b5bd68;">(</span><span style="color: #b294bb;">with-silent-modifications</span>
        <span style="color: #b294bb;">(</span><span style="color: #de935f;">ansi-color-apply-on-region</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">point-min</span><span style="color: #81a2be;">)</span> <span style="color: #81a2be;">(</span><span style="color: #de935f;">point-max</span><span style="color: #81a2be;">)</span> t<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>

              <p>It&rsquo;s nice to see ANSI colour codes displayed</p>
              <div class="org-src-container">
                <pre
                  class="src src-emacs-lisp"
                ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> text-mode
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">add-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">text-mode-hook</span>
             <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Apply ANSI color codes</span>
             <span style="color: #de935f;">(</span><span style="color: #b294bb;">with-silent-modifications</span>
               <span style="color: #b5bd68;">(</span><span style="color: #de935f;">ansi-color-apply-on-region</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point-min</span><span style="color: #b294bb;">)</span> <span style="color: #b294bb;">(</span><span style="color: #de935f;">point-max</span><span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
        <div id="outline-container-org3fceeae" class="outline-3">
          <h3 id="org3fceeae">
            <span class="section-number-3">5.9.</span> Python
          </h3>
          <div class="outline-text-3" id="text-5-9">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">after!</span> lsp-python-ms
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">setq</span> <span style="color: #cc6666;">lsp-python-ms-executable</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">executable-find</span> <span style="color: #b5bd68;">"python-language-server"</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #81a2be;">set-lsp-priority!</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">mspyls</span> <span style="color: #de935f; font-weight: bold;">1</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org5464b82" class="outline-3">
          <h3 id="org5464b82">
            <span class="section-number-3">5.10.</span> Rust
          </h3>
          <div class="outline-text-3" id="text-5-10">
            <p>Set rust-analyzer as prefered lsp-server.</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq</span> rustic-lsp-server <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">rust-analyzer</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org5155ff9" class="outline-3">
          <h3 id="org5155ff9">
            <span class="section-number-3">5.11.</span> CSharp
          </h3>
          <div class="outline-text-3" id="text-5-11">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">use-package!</span> html-mode
  <span style="color: #81a2be;">:mode</span> <span style="color: #b5bd68;">"\\.cshtml\\'"</span>
  <span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgee917a7" class="outline-3">
          <h3 id="orgee917a7">
            <span class="section-number-3">5.12.</span> HTML
          </h3>
          <div class="outline-text-3" id="text-5-12">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">web-mode-hook</span> <span style="color: #cc6666;">+format-with-lsp</span> nil<span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">setq-hook!</span> <span style="color: #c5c8c6;">'</span><span style="color: #cc6666;">web-mode-hook</span> <span style="color: #cc6666;">+format-with</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">prettier</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>

      <div id="outline-container-orgf82e89a" class="outline-2">
        <h2 id="orgf82e89a">
          <span class="section-number-2">6.</span> Functions
        </h2>
        <div class="outline-text-2" id="text-6"></div>
        <div id="outline-container-org5091255" class="outline-3">
          <h3 id="org5091255">
            <span class="section-number-3">6.1.</span> Org
          </h3>
          <div class="outline-text-3" id="text-6-1">
            <p>Export pdf asynchronously</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">leniviy/org-save-and-export-pdf</span> <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #de935f;">org-latex-export-to-pdf</span> <span style="color: #81a2be;">:async</span> t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>Export TeX</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">leniviy/org-save-and-export-latex</span> <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #de935f;">org-latex-export-to-latex</span> <span style="color: #81a2be;">:async</span> t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">leniviy/org-save-and-export-beamer</span> <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">if</span> <span style="color: #de935f;">(</span><span style="color: #de935f;">eq</span> <span style="color: #cc6666;">major-mode</span> <span style="color: #c5c8c6;">'</span><span style="color: #f0c674;">org-mode</span><span style="color: #de935f;">)</span>
      <span style="color: #de935f;">(</span><span style="color: #de935f;">org-beamer-export-to-latex</span> <span style="color: #81a2be;">:async</span> t<span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>

            <p>config tangling</p>
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">config-tangle</span> <span style="color: #81a2be;">()</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">shell-command</span>
   <span style="color: #b5bd68;">"emacs --batch --eval \"(require 'org)\" --eval '(org-babel-tangle-file \"~/.config/doom/config.org\")'"</span>
   <span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(concat "org-tangle " doom-private-dir "config.org" " &amp;")</span>
   <span style="color: #81a2be;">)</span>
  <span style="color: #b294bb;">)</span>

<span style="color: #b294bb;">()</span>
</pre>
            </div>
          </div>
        </div>
