config/doom/config.org
** Files
#+begin_src emacs-lisp
(defun open-file-external (file)
  (interactive "f")
  (let ((process-connection-type nil))
    (start-process
     "" nil shell-file-name
     shell-command-switch
     (format "nohup 1>/dev/null 2>/dev/null xdg-open %s"
             (expand-file-name file)))))

;; (defun get-current-file-location ()
;;   "Return the current file location."
;;   (interactive)
;;   (when buffer-file-name
;;     (file-truename buffer-file-name)))

(defun copy-file-location-to-clipboard ()
  "Copy the current file location to the clipboard."
  (interactive)
  (kill-new (buffer-file-name))
  (message "File location copied to clipboard: %s" (buffer-file-name)))
#+end_src
