config/doom/config.html
        <div id="outline-container-org715a587" class="outline-3">
          <h3 id="org715a587">
            <span class="section-number-3">6.2.</span> Files
          </h3>
          <div class="outline-text-3" id="text-6-2">
            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">open-file-external</span> <span style="color: #81a2be;">(</span>file<span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span> <span style="color: #b5bd68;">"f"</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">let</span> <span style="color: #de935f;">(</span><span style="color: #b5bd68;">(</span><span style="color: #cc6666;">process-connection-type</span> nil<span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span>
    <span style="color: #de935f;">(</span><span style="color: #de935f;">start-process</span>
     <span style="color: #b5bd68;">""</span> nil <span style="color: #cc6666;">shell-file-name</span>
     <span style="color: #cc6666;">shell-command-switch</span>
     <span style="color: #b5bd68;">(</span><span style="color: #de935f;">format</span> <span style="color: #b5bd68;">"nohup 1&gt;/dev/null 2&gt;/dev/null xdg-open %s"</span>
             <span style="color: #b294bb;">(</span><span style="color: #de935f;">expand-file-name</span> file<span style="color: #b294bb;">)</span><span style="color: #b5bd68;">)</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>

<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">(defun get-current-file-location ()</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">"Return the current file location."</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">(interactive)</span>
<span style="color: #5a5b5a;">;;   </span><span style="color: #5a5b5a;">(when buffer-file-name</span>
<span style="color: #5a5b5a;">;;     </span><span style="color: #5a5b5a;">(file-truename buffer-file-name)))</span>

<span style="color: #b294bb;">(</span><span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">copy-file-location-to-clipboard</span> <span style="color: #81a2be;">()</span>
  <span style="color: #717171;">"Copy the current file location to the clipboard."</span>
  <span style="color: #81a2be;">(</span><span style="color: #b294bb;">interactive</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">kill-new</span> <span style="color: #de935f;">(</span><span style="color: #cc6666;">buffer-file-name</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span>
  <span style="color: #81a2be;">(</span><span style="color: #de935f;">message</span> <span style="color: #b5bd68;">"File location copied to clipboard: %s"</span> <span style="color: #de935f;">(</span><span style="color: #cc6666;">buffer-file-name</span><span style="color: #de935f;">)</span><span style="color: #81a2be;">)</span><span style="color: #b294bb;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: leniviy</p>
      <p class="date">Created: 2023-07-16 Sun 17:30</p>
    </div>
  </body>
</html>
